[
  {
    "word": "xanax",
    "pronunciation": "zuh·naks",
    "concise_definition": "n. 阿普唑仑（一种苯二氮䓬类镇静药物）",
    "forms": {
      "plural": "xanaxes"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A brand name for alprazolam, a prescription benzodiazepine medication used to treat anxiety disorders, panic disorders, and sometimes depression; it acts on the central nervous system to produce a calming effect.",
        "explanation_cn": "阿普唑仑的商标名，是一种用于治疗焦虑症、恐慌症，有时也用于抑郁症的处方苯二氮䓬类药物；它通过作用于中枢神经系统产生镇静和放松效果。",
        "example_en": "She was prescribed Xanax to help manage her severe panic attacks.",
        "example_cn": "她被开具了阿普唑仑以帮助控制严重的恐慌发作。"
      },
      {
        "pos": "noun",
        "explanation_en": "Colloquially, a slang term for any benzodiazepine used recreationally for its sedative or euphoric effects, often associated with misuse or dependency.",
        "explanation_cn": "口语中，泛指任何被用于娱乐性服用的苯二氮䓬类药物，以获得镇静或欣快感，常与滥用或成瘾相关。",
        "example_en": "He was caught with a stash of Xanax he bought online without a prescription.",
        "example_cn": "他因被查出非法网购并持有大量阿普唑仑而被捕。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "valium",
        "analysis": "“Valium”（地西泮）是另一种苯二氮䓬类药物，与 Xanax 作用机制相似，但半衰期更长，镇静效果更持久，常用于肌肉痉挛和酒精戒断；而 Xanax 起效更快、作用时间较短，更适合急性焦虑或恐慌发作。"
      },
      {
        "word_to_compare": "ativan",
        "analysis": "“Ativan”（劳拉西泮）与 Xanax 同属苯二氮䓬类，用于焦虑和失眠，但其代谢更稳定，成瘾风险略低，临床常用于短期治疗；Xanax 因其快速起效和较强欣快感，滥用倾向更高。"
      },
      {
        "word_to_compare": "benzodiazepine",
        "analysis": "“Benzodiazepine”（苯二氮䓬类）是药物类别总称，包括 Xanax、Valium、Ativan 等；Xanax 是其中一种具体药物，而 benzodiazepine 是化学分类术语，不特指某一种药品。"
      }
    ]
  },
  {
    "word": "xavier",
    "pronunciation": "zav·ee·er",
    "concise_definition": "n. (人名) 萨维埃",
    "forms": {
      "variant_spelling": [
        "Xaviers",
        "Xavier's"
      ]
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A proper noun, typically used as a given name or surname, most famously associated with Saint Francis Xavier, a 16th-century Spanish Jesuit missionary and co-founder of the Society of Jesus.",
        "explanation_cn": "一个专有名词，通常用作人名或姓氏，最著名的是指16世纪西班牙耶稣会传教士圣方济各·沙勿略，他是耶稣会的联合创始人之一。",
        "example_en": "Saint Francis Xavier traveled extensively across Asia to spread Christianity.",
        "example_cn": "圣方济各·沙勿略曾广泛游历亚洲传播基督教。"
      },
      {
        "pos": "noun",
        "explanation_en": "A place name or institutional name derived from Saint Francis Xavier, such as Xavier University or Xavier Street, often associated with Catholic education or heritage.",
        "explanation_cn": "以圣方济各·沙勿略命名的地点或机构名称，如圣方济各大学或沙勿略街，常与天主教教育或传统相关。",
        "example_en": "She enrolled at Xavier University, known for its strong liberal arts program.",
        "example_cn": "她入读了以文科教育见长的圣方济各大学。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "francis",
        "analysis": "“Francis” 是一个更常见的教名，源自拉丁语 Franciscus，意为“法国人”或“自由人”，广泛用于多个圣人和历史人物，如圣方济各·阿西西。而 “Xavier” 是一个地名姓氏，特指西班牙的 Xavier 地区，仅在与圣方济各·沙勿略相关时才具有宗教和文化上的显著意义。"
      },
      {
        "word_to_compare": "ignatius",
        "analysis": "“Ignatius” 是另一位耶稣会创始人圣依纳爵·罗耀拉的名字，常与 Xavier 并列提及，因两人共同创立耶稣会。但 “Ignatius” 更强调内在灵修与神学体系，而 “Xavier” 更突出传教行动与地理扩张。"
      },
      {
        "word_to_compare": "joseph",
        "analysis": "“Joseph” 是一个普遍的希伯来语名字，意为“上帝将增添”，在基督教传统中代表圣母玛利亚的丈夫，象征谦卑与守护。与 “Xavier” 相比，它不具备特定的地理或传教象征，文化含义更广泛且非特定于天主教教育体系。"
      }
    ]
  },
  {
    "word": "xbox",
    "pronunciation": "eks·boks",
    "concise_definition": "n. 微软出品的家用游戏主机系列",
    "forms": {
      "plural": "Xboxes"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A line of home video game consoles developed and marketed by Microsoft, first released in 2001, designed to compete with Sony's PlayStation and Nintendo's consoles, offering high-performance gaming, online multiplayer services via Xbox Live, and integration with media applications.",
        "explanation_cn": "由微软开发和销售的一系列家用视频游戏主机，首次发布于2001年，旨在与索尼的PlayStation和任天堂的主机竞争，提供高性能游戏体验、通过Xbox Live实现在线多人游戏，并整合多媒体应用功能。",
        "example_en": "I bought the latest Xbox Series X to play the new open-world game.",
        "example_cn": "我买了最新的Xbox Series X来玩这款新的开放世界游戏。"
      },
      {
        "pos": "noun",
        "explanation_en": "A brand name that represents Microsoft's ecosystem of gaming hardware, software, and services, including controllers, games, subscriptions (Xbox Game Pass), and cloud gaming capabilities.",
        "explanation_cn": "代表微软游戏硬件、软件和服务生态系统的品牌名称，包括手柄、游戏、订阅服务（Xbox Game Pass）以及云游戏功能。",
        "example_en": "With Xbox Game Pass, you can access hundreds of games for a monthly fee.",
        "example_cn": "通过Xbox Game Pass，你可以按月付费访问数百款游戏。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "playstation",
        "analysis": "“PlayStation” 是索尼公司推出的家用游戏主机系列，与Xbox同为市场主要竞争者。两者在硬件性能、独占游戏和在线服务上各有侧重：PlayStation更强调单机叙事体验和第一方工作室（如顽皮狗）的高质量独占游戏，而Xbox更注重跨平台兼容性、云游戏和订阅服务（如Game Pass）的整合。"
      },
      {
        "word_to_compare": "switch",
        "analysis": "“Switch” 是任天堂推出的混合型游戏主机，兼具家用主机与便携掌机功能。与Xbox强调高性能和4K画质不同，Switch以创新的可拆卸手柄设计和独特的第一方IP（如《塞尔达传说》《马里奥》）为核心竞争力，更注重家庭娱乐和移动场景下的游戏体验。"
      },
      {
        "word_to_compare": "console",
        "analysis": "“Console” 是一个通用术语，泛指所有家用游戏主机，包括Xbox、PlayStation、Switch等。而 “Xbox” 是一个具体品牌，属于“console”的子类。使用 “console” 时指代的是设备类别，而 “Xbox” 则特指微软的产品线及其生态系统。"
      }
    ]
  },
  {
    "word": "xd",
    "pronunciation": "eks-dee",
    "concise_definition": "n. 网络用语，表示大笑",
    "forms": {
      "plural": "xd"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "An internet slang expression, typically used in text-based communication, to represent laughter or amusement, often resembling a face with closed eyes and an open mouth (X for eyes, D for mouth).",
        "explanation_cn": "一种网络用语，常用于文字交流中，表示大笑或感到有趣，其形态类似一张闭眼张嘴的脸（X代表眼睛，D代表嘴巴）。",
        "example_en": "That joke was hilarious! xd",
        "example_cn": "那个笑话太好笑了！xd"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "lol",
        "analysis": "“lol” (laugh out loud) 是英语网络用语中表示大笑的最常见缩写，强调的是‘大声笑出来’的动作，常用于正式或半正式的在线对话中。而 “xd” 更具视觉形象性，源自东亚网络文化，通过字符组合模拟表情，情感表达更夸张、更具地域文化特色。"
      },
      {
        "word_to_compare": "haha",
        "analysis": "“haha” 是拟声词，直接模仿笑声的发音，语气较温和、自然，适用于多种语境。而 “xd” 是视觉符号，不发音，主要用于快速表达强烈情绪，常见于即时通讯和社交媒体，语气更活泼、年轻化。"
      },
      {
        "word_to_compare": "rofl",
        "analysis": "“rofl” (rolling on the floor laughing) 表示极度大笑，强度高于 “xd”，常用于表达爆笑到失控的情境。而 “xd” 虽然也表示大笑，但强度中等，更偏向于轻松、调侃的语气，使用范围更广，不局限于极端情境。"
      }
    ]
  },
  {
    "word": "xi",
    "pronunciation": "shee",
    "concise_definition": "n. 希腊字母 Ξ, ξ (第14个字母)",
    "forms": {
      "uppercase": "Ξ",
      "lowercase": "ξ"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "The fourteenth letter of the Greek alphabet, represented as Ξ in uppercase and ξ in lowercase. It is used in mathematics, physics, and engineering to denote specific variables, constants, or functions, particularly in contexts involving complex numbers, particle physics, or statistical models.",
        "explanation_cn": "希腊字母表中的第14个字母，大写为 Ξ，小写为 ξ。常用于数学、物理和工程领域，表示特定的变量、常数或函数，尤其在复数、粒子物理或统计模型的语境中。",
        "example_en": "In quantum field theory, the symbol ξ is often used to represent a coupling constant.",
        "example_cn": "在量子场论中，符号 ξ 常用于表示耦合常数。"
      },
      {
        "pos": "noun",
        "explanation_en": "A symbol used in some computer science and algorithmic contexts to denote a specific type of transformation or operator, especially in formal language theory or automata theory.",
        "explanation_cn": "在某些计算机科学和算法语境中，用作表示特定类型变换或运算符的符号，尤其在形式语言理论或自动机理论中。",
        "example_en": "The automaton transitions are defined using the operator ξ to represent non-deterministic choices.",
        "example_cn": "该自动机的转移规则使用运算符 ξ 来表示非确定性选择。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "alpha",
        "analysis": "“Alpha” (α) 是希腊字母表的第一个字母，常用于表示起点、主导因素或基本变量（如α粒子、α系数）。而 “xi” (ξ) 是第14个字母，使用频率较低，通常用于更专业或抽象的数学物理符号中，不具基础性或象征性含义。"
      },
      {
        "word_to_compare": "sigma",
        "analysis": "“Sigma” (Σ, σ) 在数学中广泛用于表示求和（Σ）或标准差（σ），具有高度通用性和公众认知度。相比之下，“xi” 的使用范围狭窄，仅限于特定理论模型，公众几乎不熟悉。"
      },
      {
        "word_to_compare": "lambda",
        "analysis": "“Lambda” (λ) 在数学、物理和计算机科学中用途广泛，如波长、特征值、λ演算等，已成为跨学科的通用符号。而 “xi” 的应用高度专业化，通常仅在特定领域（如高能物理中的介子符号）中出现，不具备跨领域通用性。"
      }
    ]
  },
  {
    "word": "xiao",
    "pronunciation": "shǎo",
    "concise_definition": "n. 小, 少; v. 嘲笑, 讥讽",
    "forms": {
      "plural": "xiao"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A Chinese character (小) meaning 'small' or 'little', used to denote size, quantity, or age in a diminutive sense.",
        "explanation_cn": "汉字‘小’，表示‘小’或‘少’，用于描述尺寸、数量或年龄上的微小或轻微。",
        "example_en": "Xiao li (小李) is a common way to refer to someone named Li who is younger or of lower status.",
        "example_cn": "‘小李’是称呼年纪较轻或地位较低的李姓人士的常见方式。"
      },
      {
        "pos": "verb",
        "explanation_en": "To laugh at or mock someone in a derisive or contemptuous manner, often implying ridicule or scorn.",
        "explanation_cn": "以轻蔑或嘲弄的方式嘲笑某人，常带有讥讽或鄙视的意味。",
        "example_en": "He xiaoed at her suggestion, making her feel embarrassed.",
        "example_cn": "他嘲笑她的建议，让她感到尴尬。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "small",
        "analysis": "“Small” 是英语中表示尺寸或数量少的通用词，强调客观的物理或数量属性。而 “xiao” (小) 在中文中不仅表示大小，还常用于社会关系中表达亲昵、谦逊或地位差异，具有文化语用功能。"
      },
      {
        "word_to_compare": "laugh",
        "analysis": "“Laugh” 是中性或积极的发声行为，表示愉悦或幽默；而 “xiao” (嘲笑) 是带有负面情感的动词，特指带有轻蔑或讽刺意味的笑，语义更负面，语用更尖锐。"
      },
      {
        "word_to_compare": "ridicule",
        "analysis": "“Ridicule” 是英语中与 “xiao” (嘲笑) 最接近的近义词，都表示通过言语或行为使人难堪。但 “ridicule” 更正式、更强调系统性贬低，而 “xiao” 在口语中更常用，语气更直接、更生活化。"
      }
    ]
  },
  {
    "word": "xii",
    "pronunciation": "ksee·eye·eye",
    "concise_definition": "n. 罗马数字 12",
    "forms": {
      "arabic_equivalent": "12"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "The Roman numeral representing the number twelve, formed by combining X (10), I (1), and I (1), following the additive principle of Roman numerals.",
        "explanation_cn": "罗马数字，表示数字十二，由 X（10）、I（1）和 I（1）组合而成，遵循罗马数字的加法原则。",
        "example_en": "The book's preface is labeled 'xii' to indicate the twelfth page of introductory material.",
        "example_cn": "这本书的前言标为 'xii'，表示序言部分的第十二页。"
      },
      {
        "pos": "noun",
        "explanation_en": "Used in formal or traditional contexts such as clock faces, chapter numbering, monarch titles, or legal documents to denote the twelfth item in a sequence.",
        "explanation_cn": "用于钟表盘面、章节编号、君主头衔或法律文件等正式或传统场合，表示序列中的第十二项。",
        "example_en": "King Henry XII ruled during a period of significant political reform.",
        "example_cn": "亨利十二世在位期间经历了重大的政治改革。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "12",
        "analysis": "阿拉伯数字 '12' 是现代通用的十进制数字表示法，简洁直观，广泛用于日常计算和科技领域。而 'xii' 是罗马数字，具有历史和象征意义，多用于仪式性、装饰性或传统语境，如钟表、书籍章节或皇室称号，不具备计算功能。"
      },
      {
        "word_to_compare": "XII",
        "analysis": "XII 是 xii 的大写形式，两者在数值和用法上完全相同，仅在书写风格上存在区别。大写形式 XII 常用于正式文件、纪念碑、法律文书或标题中，以体现庄重感；小写 xii 多见于页码、注释或非正式排版。"
      },
      {
        "word_to_compare": "twelfth",
        "analysis": "‘Twelfth’ 是英语中表示序数的单词，强调顺序中的第十二位（如 the twelfth chapter），而 'xii' 是纯粹的数词符号，不直接表达序数含义，需通过上下文判断其是否表示顺序。在正式写作中，'twelfth' 更符合现代英语规范，而 'xii' 则保留古典风格。"
      }
    ]
  },
  {
    "word": "xiii",
    "pronunciation": "ek-siː-ˈiː",
    "concise_definition": "n. 罗马数字13",
    "forms": {
      "arabic_numeral": "13"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "The Roman numeral representing the number thirteen, composed of X (10) + III (3), commonly used in formal contexts such as monarchs' names, book chapters, clock faces, and historical dates.",
        "explanation_cn": "罗马数字，表示数字13，由X（10）和III（3）组成，常用于正式场合，如君主名称、书籍章节、钟表表面和历史日期。",
        "example_en": "King Charles XIII ruled Sweden in the early 19th century.",
        "example_cn": "查尔斯十三世国王于19世纪初统治瑞典。"
      },
      {
        "pos": "noun",
        "explanation_en": "A symbolic or decorative representation of the number 13, often used in architecture, art, or ceremonial contexts to convey tradition, formality, or numerological significance.",
        "explanation_cn": "数字13的一种象征性或装饰性表达，常用于建筑、艺术或仪式场合，以传达传统、正式性或数字神秘主义的意义。",
        "example_en": "The manuscript was dated 'xiii Kalendas Aprilis' in the ancient Roman calendar.",
        "example_cn": "这份手稿在古罗马历法中标注为‘四月前三日’（xiii Kalendas Aprilis）。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "13",
        "analysis": "“13” 是阿拉伯数字，用于现代日常计算和书写，简洁直接；而 “xiii” 是罗马数字，具有历史和文化象征意义，多用于正式、传统或装饰性语境，如皇室头衔、纪念碑或钟表。两者数值相同，但使用场景和语用功能截然不同。"
      },
      {
        "word_to_compare": "XIII",
        "analysis": "“XIII” 与 “xiii” 完全等价，仅大小写不同。在正式出版物或印刷体中，通常使用大写 “XIII” 以符合传统规范；小写 “xiii” 多见于手写、非正式文本或特定风格设计中。语义和用法无区别。"
      },
      {
        "word_to_compare": "thirteen",
        "analysis": "“Thirteen” 是英文单词形式，用于口语和书面语中的自然表达，强调语言的流畅性；而 “xiii” 是符号系统的一部分，强调形式感、历史延续性和视觉象征。在正式文件中，若需避免歧义，通常优先使用 “13” 或 “thirteen”，而 “xiii” 则保留于特定文化语境。"
      }
    ]
  },
  {
    "word": "xinjiang",
    "pronunciation": "sheen·jyang",
    "concise_definition": "n. 新疆（中国西北自治区）",
    "forms": {
      "plural": "Xinjiangs (rarely used)"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A vast autonomous region in northwestern China, officially known as the Xinjiang Uygur Autonomous Region, known for its diverse ethnic populations, arid landscapes, rich natural resources, and historical significance along the ancient Silk Road.",
        "explanation_cn": "中国西北部的一个广袤自治区，正式名称为新疆维吾尔自治区，以多元民族构成、干旱地貌、丰富的自然资源以及作为古代丝绸之路重要枢纽的历史地位而闻名。",
        "example_en": "Xinjiang is home to the Uygur people and famous for its dried fruits, handwoven carpets, and nomadic culture.",
        "example_cn": "新疆是维吾尔族的聚居地，以干果、手工编织地毯和游牧文化而闻名。"
      },
      {
        "pos": "noun",
        "explanation_en": "A geopolitical and cultural region that has been a focal point of China's economic development, security policies, and ethnic integration efforts in recent decades.",
        "explanation_cn": "近几十年来，新疆作为中国经济发展、安全政策和民族融合努力的核心区域，具有重要的地缘政治与文化意义。",
        "example_en": "The Chinese government has invested heavily in infrastructure projects in Xinjiang to promote regional stability and economic growth.",
        "example_cn": "中国政府在新疆投入大量资金用于基础设施建设，以促进区域稳定和经济增长。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "tibet",
        "analysis": "“Tibet”（西藏）与“Xinjiang”同为中国西部的少数民族自治区，均具有独特的宗教文化、地理环境和民族构成。但西藏以藏传佛教为核心，人口以藏族为主；而新疆以伊斯兰文化为主，主要民族为维吾尔族，且自然资源（如石油、天然气）更为丰富，战略地位更侧重于陆上丝绸之路与中亚连接。"
      },
      {
        "word_to_compare": "inner_mongolia",
        "analysis": "“Inner Mongolia”（内蒙古）同样是中国的少数民族自治区，但其地理特征以草原和半干旱平原为主，民族以蒙古族为主，文化传统以游牧和马背文化为特色。相比之下，新疆地貌更复杂（沙漠、高山、绿洲并存），民族构成更多元，且与中亚国家接壤，国际关联性更强。"
      },
      {
        "word_to_compare": "region",
        "analysis": "“Region”（地区）是一个泛指地理或行政区域的通用词，无特定文化或政治含义。而“Xinjiang”是一个具有明确行政边界、民族身份、历史脉络和国家政策背景的专有名词，不能简单等同于普通地理术语。"
      }
    ]
  },
  {
    "word": "xiv",
    "pronunciation": "eksˈiːve",
    "concise_definition": "n. 罗马数字14",
    "forms": {
      "arabic_numeral": "14"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "The Roman numeral representing the number 14, formed by combining X (10) and IV (4), following the subtractive notation rule in Roman numerals.",
        "explanation_cn": "罗马数字中表示14的符号，由X（10）和IV（4）组合而成，遵循罗马数字中的减法记数规则。",
        "example_en": "The conference will be held on Chapter XIV of the manual.",
        "example_cn": "会议将在手册的第十四章举行。"
      },
      {
        "pos": "noun",
        "explanation_en": "A designation used in formal or historical contexts, such as in monarchs' names (e.g., King Henry XIV), book chapters, or numbered sequences in legal or academic documents.",
        "explanation_cn": "用于正式或历史语境中的编号标识，如君主名称（如亨利十四世）、书籍章节，或法律与学术文件中的编号序列。",
        "example_en": "Pope XIV was never officially recognized due to historical disputes.",
        "example_cn": "由于历史争议，第十四任教皇从未被正式承认。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "14",
        "analysis": "“14” 是阿拉伯数字，用于现代日常计数和数学运算，简洁通用；而 “XIV” 是罗马数字，主要用于象征性、装饰性或传统场合，如钟表、章节编号、皇室名号等，强调历史感与仪式感。"
      },
      {
        "word_to_compare": "fourteen",
        "analysis": "“Fourteen” 是英文单词形式，用于口语和书面语中表达数量，语义直接；“XIV” 是符号形式，不发音为单词，仅作为视觉标识使用，常见于正式文献、纪念碑或编号系统中，不具备语言功能，仅具符号功能。"
      },
      {
        "word_to_compare": "XIVth",
        "analysis": "“XIVth” 是 “XIV” 的序数形式，用于表示第十四（如 the XIVth century），强调顺序；而 “XIV” 单独使用时通常表示基数（数量14），在语境中需根据上下文判断其为基数还是序数。"
      }
    ]
  },
  {
    "word": "xl",
    "pronunciation": "eks·el",
    "concise_definition": "n. 超大号（服装尺码）",
    "forms": {
      "plural": "xls"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "An abbreviation for 'extra large', used primarily as a size designation for clothing, footwear, or other wearable items to indicate a size larger than 'large'.",
        "explanation_cn": "‘extra large’ 的缩写，主要用于服装、鞋类或其他穿戴物品的尺码标识，表示比‘大号’更大的尺寸。",
        "example_en": "I usually wear XL in t-shirts, but this brand runs small.",
        "example_cn": "我通常穿T恤的XL码，但这个品牌的尺码偏小。"
      },
      {
        "pos": "noun",
        "explanation_en": "In computing or data contexts, 'XL' may informally refer to Microsoft Excel, especially in casual or shorthand communication.",
        "explanation_cn": "在计算或数据语境中，'XL' 可非正式地指代 Microsoft Excel，尤其在非正式或简写交流中。",
        "example_en": "Can you send me the report in XL format?",
        "example_cn": "你能把报告以 Excel 格式发给我吗？"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "xxl",
        "analysis": "‘XXL’（超超大号）是比 ‘XL’ 更大的尺码，通常用于体型明显超出标准 XL 范围的人群。两者均为服装尺码，但 XXL 表示更极端的尺寸，常用于大码服装系列。"
      },
      {
        "word_to_compare": "large",
        "analysis": "‘Large’（大号）是比 ‘XL’ 小一级的标准尺码。‘XL’ 是 ‘large’ 的扩展，用于满足更大体型的需求。在尺码体系中，‘large’ 属于中等偏上，而 ‘XL’ 已进入大码范围。"
      },
      {
        "word_to_compare": "excel",
        "analysis": "‘Excel’ 是微软的电子表格软件，全拼为 E-X-C-E-L，而 ‘XL’ 是其常见缩写。虽然 ‘XL’ 作为缩写可指代该软件，但作为独立单词时，‘excel’ 是动词，意为‘杰出、擅长’，与尺码无关。两者拼写相似但语义和用法完全不同。"
      }
    ]
  },
  {
    "word": "xmas",
    "pronunciation": "kris·muhz",
    "concise_definition": "n. 圣诞节（Christmas 的缩写）",
    "forms": {
      "plural": "xmas"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A shortened, informal form of 'Christmas,' used primarily in writing to save space or convey a casual tone, especially in advertising, cards, and digital communication.",
        "explanation_cn": "‘Christmas’ 的简写形式，常用于书面语中以节省空间或传达轻松随意的语气，尤其在广告、贺卡和数字通讯中。",
        "example_en": "I sent her a card with 'Happy Xmas!' written on it.",
        "example_cn": "我给她寄了一张写着‘圣诞快乐！’的贺卡。"
      },
      {
        "pos": "noun",
        "explanation_en": "A culturally recognized term for the Christian holiday celebrating the birth of Jesus Christ, often associated with gift-giving, family gatherings, and festive decorations, regardless of religious context.",
        "explanation_cn": "指庆祝耶稣基督诞生的基督教节日，常与送礼、家庭聚会和节日装饰相关联，即使在非宗教语境中也被广泛使用。",
        "example_en": "The city is decorated with lights and trees for Xmas.",
        "example_cn": "这座城市为圣诞节装饰了彩灯和圣诞树。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "Christmas",
        "analysis": "‘Christmas’ 是正式全称，带有宗教和文化庄重感，适用于书面语、宗教场合和正式演讲；而 ‘Xmas’ 是非正式缩写，常用于日常交流、商业宣传或空间受限的场景。虽然两者指代同一节日，但 ‘Xmas’ 可能被部分宗教人士视为淡化了宗教含义。"
      },
      {
        "word_to_compare": "holiday",
        "analysis": "‘Holiday’ 是泛指‘假期’或‘节日’，不特指圣诞节，可指任何公共假期（如国庆节、感恩节）。而 ‘Xmas’ 专指 12 月 25 日的圣诞节，语义范围更窄、更具体。"
      },
      {
        "word_to_compare": "Yuletide",
        "analysis": "‘Yuletide’ 是一个较古老、文学化的词汇，指圣诞节前后的一段节庆时期，常带有传统、怀旧和民俗色彩，多用于诗歌或散文中。‘Xmas’ 则是现代、口语化的缩写，更贴近当代日常用语。"
      }
    ]
  },
  {
    "word": "xml",
    "pronunciation": "ek·sem·el",
    "concise_definition": "n. 可扩展标记语言",
    "forms": {
      "none": ""
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A markup language designed to store and transport data in a structured, human-readable and machine-readable format, using custom tags to define elements and their relationships.",
        "explanation_cn": "一种用于以结构化、人类可读且机器可读的格式存储和传输数据的标记语言，使用自定义标签来定义元素及其相互关系。",
        "example_en": "The application uses XML to exchange configuration data between the server and the client.",
        "example_cn": "该应用程序使用 XML 在服务器和客户端之间交换配置数据。"
      },
      {
        "pos": "noun",
        "explanation_en": "A standard format widely adopted for data interchange in web services, enterprise systems, and document storage due to its flexibility and platform independence.",
        "explanation_cn": "由于其灵活性和平台无关性，XML 被广泛采用为 Web 服务、企业系统和文档存储中数据交换的标准格式。",
        "example_en": "Many legacy systems still rely on XML files for data import and export.",
        "example_cn": "许多遗留系统仍依赖 XML 文件进行数据导入和导出。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "json",
        "analysis": "“JSON”（JavaScript 对象表示法）是一种轻量级的数据交换格式，语法更简洁，更贴近编程语言中的对象结构，易于解析且占用空间更小，因此在现代 Web API 中更常用。而 “XML” 语法冗长，支持注释、命名空间和复杂的数据类型，更适合需要严格结构和元数据的场景，如配置文件和文档标准。"
      },
      {
        "word_to_compare": "html",
        "analysis": "“HTML”（超文本标记语言）主要用于定义网页的结构和内容，其标签是预定义的（如 <p>, <div>），侧重于显示效果。而 “XML” 的标签是用户自定义的，不规定显示方式，仅用于描述数据的结构和含义，因此 XML 更注重数据语义而非呈现。"
      },
      {
        "word_to_compare": "yaml",
        "analysis": "“YAML”（YAML Ain't Markup Language）是一种以人类可读性为优先的数据序列化格式，使用缩进而非标签来表示层级结构，语法更简洁直观。与 XML 相比，YAML 更适合配置文件和小型数据交换，但缺乏 XML 的强类型支持和命名空间机制，因此在复杂企业系统中 XML 仍占主导地位。"
      }
    ]
  },
  {
    "word": "xo",
    "pronunciation": "eks-oh",
    "concise_definition": "n. (非正式) 拥抱与亲吻的符号",
    "forms": {
      "plural": "xos"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A symbolic representation used in written communication, especially in informal letters, texts, or social media, where 'X' stands for a kiss and 'O' stands for a hug.",
        "explanation_cn": "在书面交流中（尤其是非正式信件、短信或社交媒体）使用的符号，其中 'X' 代表亲吻，'O' 代表拥抱。",
        "example_en": "Thanks for everything! Love you lots, xo",
        "example_cn": "感谢一切！非常爱你，么么哒 xo"
      },
      {
        "pos": "noun",
        "explanation_en": "A cultural shorthand for affection, warmth, or endearment, often used to close personal messages between friends, family, or romantic partners.",
        "explanation_cn": "一种表达亲密、温暖或爱意的文化简写，常用于朋友、家人或情侣之间私人信息的结尾。",
        "example_en": "She signed off every email with 'xo' to show she cared.",
        "example_cn": "她每封邮件都以 'xo' 结尾，以表达她的关心。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "love",
        "analysis": "“Love” (爱) 是一个情感名词，表达强烈的情感依恋，语义完整且正式；而 “xo” 是一种视觉符号，仅在非正式语境中作为情感的简略表达，不具备独立语义，必须依赖上下文理解。"
      },
      {
        "word_to_compare": "xx",
        "analysis": "“XX” 有时也用于表示亲吻（尤其在英国英语中），但通常不包含拥抱的含义。而 “xo” 明确区分了亲吻 (X) 和拥抱 (O)，更具象化地传达了两种身体亲密行为，因此在情感表达上更丰富。"
      },
      {
        "word_to_compare": "best regards",
        "analysis": "“Best regards” 是正式书信结尾的礼貌用语，强调尊重与专业性；而 “xo” 是高度非正式、情感化的表达，仅用于亲密关系中，两者在语域、语境和情感强度上完全对立。"
      }
    ]
  },
  {
    "word": "xp",
    "pronunciation": "eks·pee",
    "concise_definition": "n. 经验值, 体验点",
    "forms": {
      "plural": "xps"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A numerical value awarded in video games, apps, or online platforms to represent a user's progress, achievement, or level of engagement, often used to unlock new features, levels, or rewards.",
        "explanation_cn": "在电子游戏、应用程序或在线平台中，用于表示用户进度、成就或参与度的数值，通常用于解锁新功能、等级或奖励。",
        "example_en": "After defeating the boss, I gained 500 XP and leveled up to level 15.",
        "example_cn": "击败Boss后，我获得了500经验值，等级提升到了15级。"
      },
      {
        "pos": "noun",
        "explanation_en": "A metaphorical or informal term used outside gaming contexts to describe personal growth, skill acquisition, or earned recognition through effort.",
        "explanation_cn": "在游戏之外的语境中，作为比喻或非正式用语，指通过努力获得的个人成长、技能提升或认可。",
        "example_en": "Running this project taught me a lot — I got a ton of XP in leadership and communication.",
        "example_cn": "负责这个项目让我学到了很多——我在领导力和沟通方面积累了大量‘经验值’。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "experience",
        "analysis": "“Experience”（经验）是通用词，泛指通过实践获得的知识或技能，适用于所有语境，强调过程与积累。而 “XP” 是游戏化语境中的量化版本，专指系统化、数值化的奖励机制，更具技术性和娱乐性。"
      },
      {
        "word_to_compare": "points",
        "analysis": "“Points”（积分）是更宽泛的奖励单位，可用于评分、竞赛、忠诚度计划等，不特指成长或进步。而 “XP” 专用于表示能力提升或等级进化的系统，具有明确的升级导向和成长路径。"
      },
      {
        "word_to_compare": "level",
        "analysis": "“Level”（等级）是 XP 的结果或状态，表示用户当前所处的阶段。XP 是达成升级所需的“燃料”，而 level 是其体现。二者常成对出现，但功能不同：XP 是输入，level 是输出。"
      }
    ]
  },
  {
    "word": "xs",
    "pronunciation": "eks-es",
    "concise_definition": "n. 超小号（服装尺码）",
    "forms": {
      "plural": "xs"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A size designation in clothing and apparel, indicating the smallest standard size available, typically for individuals with a very slim or petite build.",
        "explanation_cn": "服装尺码中的一个标识，表示最小的标准尺码，通常适用于身材非常瘦小或娇小的人。",
        "example_en": "She ordered the dress in XS because she has a petite frame.",
        "example_cn": "她身材娇小，所以订购了超小号的连衣裙。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "s",
        "analysis": "“S”（小号）是比 “XS” 大一个等级的尺码，适用于身材较瘦但非极瘦的人群。XS 是最小的常规尺码，而 S 是为标准小体型设计的，两者在肩宽、胸围和腰围上通常有 2–5 厘米的差异。"
      },
      {
        "word_to_compare": "xxs",
        "analysis": "“XXS”（超超小号）是比 “XS” 更小的尺码，通常用于特殊体型或高端时尚品牌，不属于常规尺码体系。XS 是大多数品牌最小的标准尺码，而 XXS 则是为极端瘦小体型提供的额外选项。"
      },
      {
        "word_to_compare": "size",
        "analysis": "“Size”（尺码）是一个通用术语，泛指任何物品（如服装、鞋子、容器）的规格或尺寸。而 “XS” 是 “size” 的一个具体子类，专用于服装领域，表示特定的最小尺寸等级。"
      }
    ]
  },
  {
    "word": "xu",
    "pronunciation": "ksoo",
    "concise_definition": "n. (越南货币单位) 越南盾的辅币单位",
    "forms": {
      "plural": "xu"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A subunit of the Vietnamese đồng, where 100 xu equal 1 đồng; historically used in everyday transactions but now largely obsolete due to inflation.",
        "explanation_cn": "越南盾的辅币单位，100 xu 等于 1 越南盾；历史上曾用于日常交易，但因通货膨胀现已基本失效。",
        "example_en": "In the 1980s, a loaf of bread might cost 500 xu.",
        "example_cn": "20世纪80年代，一条面包可能售价500 xu。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "cent",
        "analysis": "“Cent”（美分/分）是美元、欧元等货币的百分之一辅币单位，至今仍在广泛使用。而 “xu” 是越南盾的辅币，因严重通货膨胀已失去实际购买力，仅具历史或象征意义。两者在货币体系中的地位和使用频率有本质区别。"
      },
      {
        "word_to_compare": "fen",
        "analysis": "“Fen”（分）是中国人民币的辅币单位，100 fen = 1 元，虽然在日常交易中已极少使用，但仍为法定货币单位。相比之下，“xu” 在越南已完全退出流通，不再具有法定货币功能，仅存于历史语境中。"
      },
      {
        "word_to_compare": "sene",
        "analysis": "“Sene”（分）是萨摩亚、汤加等国货币的辅币单位，目前仍在部分场景中使用。而 “xu” 已因货币贬值而被市场淘汰，不具备实际交易功能，因此 “sene” 仍具现实经济意义，而 “xu” 仅具语言和历史价值。"
      }
    ]
  },
  {
    "word": "xv",
    "pronunciation": "ek-sɪv",
    "concise_definition": "n. 罗马数字15",
    "forms": {
      "alternative_form": "XV"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "The Roman numeral representing the number 15, formed by combining X (10) and V (5). It is commonly used in clocks, book chapters, monarch titles, and formal numbering systems.",
        "explanation_cn": "罗马数字，表示数字15，由X（10）和V（5）组合而成，常用于钟表、书籍章节、君主头衔及正式编号系统中。",
        "example_en": "The conference is scheduled for XV July, 2024.",
        "example_cn": "会议定于2024年7月15日举行。"
      },
      {
        "pos": "noun",
        "explanation_en": "A symbolic representation used in historical, architectural, or ceremonial contexts to denote ordinal position or quantity in a traditional format.",
        "explanation_cn": "在历史、建筑或仪式语境中，用作传统格式表示序数或数量的符号形式。",
        "example_en": "King Henry XV ruled during a period of great cultural change.",
        "example_cn": "亨利十五世在文化巨变时期统治国家。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "fifteen",
        "analysis": "“Fifteen” 是英语中表示数字15的常规阿拉伯数字词，用于日常口语和书面语。而 “xv” 是其罗马数字形式，主要用于象征性、装饰性或传统性场合，不具备日常计数功能，但具有文化与历史意义。"
      },
      {
        "word_to_compare": "15",
        "analysis": "“15” 是现代阿拉伯数字表示法，具有通用性、计算性和标准化优势，广泛用于数学、科技和现代文档。而 “xv” 属于古代记数系统，不具备运算功能，主要用于美学、仪式或延续传统。"
      },
      {
        "word_to_compare": "XVth",
        "analysis": "“XVth” 是 “xv” 的序数形式，表示“第十五”，常用于日期、章节或排名（如 XVth century）。而 “xv” 单独使用时通常表示基数15，不隐含顺序含义，需结合上下文判断。"
      }
    ]
  },
  {
    "word": "xvi",
    "pronunciation": "ek·sɪˈvi",
    "concise_definition": "n. 罗马数字16",
    "forms": {
      "arabic_numeral": "16"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "The Roman numeral representing the number 16, formed by combining the symbols X (10), V (5), and I (1) as XVI = 10 + 5 + 1.",
        "explanation_cn": "罗马数字，表示数值16，由符号X（10）、V（5）和I（1）组合而成，即 XVI = 10 + 5 + 1。",
        "example_en": "The book's preface is labeled 'xvi' to indicate the sixteenth page of the introductory material.",
        "example_cn": "这本书的前言标注为'xvi'，表示引言部分的第十六页。"
      },
      {
        "pos": "noun",
        "explanation_en": "A designation used in formal or traditional contexts, such as in monarchs' names, chapter numbering, or legal documents, to denote the 16th item in a sequence.",
        "explanation_cn": "用于正式或传统语境中的标识，如君主名称、章节编号或法律文件中，表示序列中的第16项。",
        "example_en": "King Henry XVI ruled during a period of great political reform.",
        "example_cn": "亨利十六世在一段重大政治改革时期统治国家。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "16",
        "analysis": "阿拉伯数字'16'是现代通用的十进制数字表示法，简洁直观，广泛用于日常计算和科技领域。而'xvi'是罗马数字，具有历史和象征意义，多用于正式场合、钟表、书籍章节或皇室命名，强调传统与庄重。"
      },
      {
        "word_to_compare": "XVI",
        "analysis": "'XVI' 与 'xvi' 实为同一罗马数字，区别仅在于大小写。在正式出版物或法律文书中，通常使用大写'XVI'以示规范；而在非正式或手写文本中，小写'xvi'也常见。两者语义完全相同，仅风格有别。"
      },
      {
        "word_to_compare": "sixteen",
        "analysis": "'Sixteen' 是英语中表示数字16的完整单词形式，用于口语和书面语中表达数量。而'xvi'是符号化的数字表示，不发音为单词，仅作为视觉标识使用。前者强调语言表达，后者强调形式传统与空间节省。"
      }
    ]
  },
  {
    "word": "xx",
    "pronunciation": "eks eks",
    "concise_definition": "n. 字母 xx, 未知变量, 未知数",
    "forms": {
      "plural": "xxs"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "The two letters 'x' used together, often as a placeholder or symbol for something unknown, unspoken, or undefined, especially in mathematics, cryptography, or informal contexts.",
        "explanation_cn": "两个字母 'x' 连用，常作为未知、未言明或未定义事物的占位符或符号，尤其在数学、密码学或非正式语境中使用。",
        "example_en": "The treasure map had an 'X' marked at the spot where the gold was buried.",
        "example_cn": "藏宝图上在埋藏黄金的地方标了一个 'X'。"
      },
      {
        "pos": "noun",
        "explanation_en": "A symbol used to represent an unknown quantity in algebra or equations, often serving as the standard variable in mathematical expressions.",
        "explanation_cn": "在代数或方程中用以表示未知量的符号，通常是数学表达式中的标准变量。",
        "example_en": "Solve for x: 2x + 5 = 15.",
        "example_cn": "求解 x：2x + 5 = 15。"
      },
      {
        "pos": "noun",
        "explanation_en": "In informal usage, 'xx' can represent kisses in written communication, especially in letters or texts, derived from the visual resemblance of two 'x's to lips.",
        "explanation_cn": "在非正式语境中，'xx' 可表示亲吻，常用于书信或短信中，源于两个 'x' 在视觉上类似亲吻的嘴唇。",
        "example_en": "Love you, xx",
        "example_cn": "爱你，么么。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "x",
        "analysis": "单个 'x' 通常作为变量或标记使用，而 'xx' 是其复数形式或强调形式。在数学中，'x' 是标准未知数，而 'xx' 可能表示两个独立的未知量或用于视觉强调。在非正式语境中，'x' 可表示一次亲吻，'xx' 则表示两次，情感更强烈。"
      },
      {
        "word_to_compare": "unknown",
        "analysis": "“Unknown” 是一个通用名词，泛指任何未被识别或未被知晓的事物，语义范围更广。而 'xx' 是一个具体的符号或字母组合，其含义依赖于上下文，常用于特定领域（如数学、通信）作为未知的视觉代表。"
      },
      {
        "word_to_compare": "symbol",
        "analysis": "“Symbol” 是一个上位词，泛指任何代表其他事物的标记或记号。'xx' 是一种具体的符号，具有文化约定的含义（如亲吻、变量），而 'symbol' 本身不指定任何特定形式或意义。"
      }
    ]
  },
  {
    "word": "xxx",
    "pronunciation": "eks",
    "concise_definition": "n. 未知数, 未知项, 无名氏",
    "forms": {
      "plural": "xxxs"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A placeholder symbol used in mathematics, programming, or general contexts to represent an unknown or unspecified value, entity, or variable.",
        "explanation_cn": "在数学、编程或一般语境中用作代表未知或未指定数值、实体或变量的占位符符号。",
        "example_en": "In algebra, x is often used to represent an unknown quantity in an equation.",
        "example_cn": "在代数中，x 常用于表示方程中的未知量。"
      },
      {
        "pos": "noun",
        "explanation_en": "A term used informally to refer to something unnamed, unidentified, or deliberately left vague, often in casual speech or writing.",
        "explanation_cn": "在非正式口语或写作中，用于指代未命名、未识别或故意模糊的事物。",
        "example_en": "I met this guy at the party — he just said his name was 'XXX'.",
        "example_cn": "我在聚会上认识了一个人，他只说自己的名字是 'XXX'。"
      },
      {
        "pos": "noun",
        "explanation_en": "A censorship mark used to obscure sensitive, explicit, or private information, especially in media or legal documents.",
        "explanation_cn": "用于在媒体或法律文件中遮蔽敏感、露骨或私人信息的审查标记。",
        "example_en": "The report redacted the witness's name, replacing it with XXX.",
        "example_cn": "报告中对证人的姓名进行了遮蔽，用 XXX 替代。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "variable",
        "analysis": "“Variable”（变量）是数学或编程中的专业术语，特指可被赋值或改变的量，具有明确的语义和操作性。而 “xxx” 是一个非正式的占位符，通常不参与运算，仅用于表示缺失或隐藏的信息。"
      },
      {
        "word_to_compare": "placeholder",
        "analysis": "“Placeholder”（占位符）是一个通用术语，泛指任何临时替代内容的符号或文本，如网页中的 'Lorem ipsum'。'xxx' 是 'placeholder' 的一种具体形式，但更常用于表示未知或被隐藏的内容，而非单纯临时填充。"
      },
      {
        "word_to_compare": "blank",
        "analysis": "“Blank”（空白）指完全空缺、未填写的状态，如空白表格或空白区域。而 'xxx' 是一个明确的符号，虽代表未知，但本身是可见且有形的，常用于主动遮蔽而非被动缺失。"
      }
    ]
  }
]