[
  {
    "word": "ya",
    "pronunciation": "yaa",
    "concise_definition": "int. 嗯, 嗯嗯, 是的 (口语)",
    "forms": {
      "variant": [
        "yeah",
        "yeh",
        "yup"
      ]
    },
    "definitions": [
      {
        "pos": "interjection",
        "explanation_en": "An informal, colloquial affirmation used to express agreement, acknowledgment, or confirmation, often in casual speech or texting.",
        "explanation_cn": "一种非正式、口语化的肯定词，用于表达同意、认可或确认，常见于随意对话或短信中。",
        "example_en": "Ya, I'll be there at seven.",
        "example_cn": "嗯，我七点到。"
      },
      {
        "pos": "interjection",
        "explanation_en": "A casual, sometimes hesitant or reluctant response to a question or request, conveying minimal engagement or passive agreement.",
        "explanation_cn": "一种随意、有时带有犹豫或勉强语气的回应，用于对问题或请求表示轻微的参与或被动同意。",
        "example_en": "Do you want to go out tonight? — Ya, I guess.",
        "example_cn": "今晚想出去吗？—— 嗯，算了吧。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "yes",
        "analysis": "“Yes” 是标准、正式的肯定词，适用于所有语境；而 “ya” 是其非正式口语变体，常用于朋友间或轻松场合，语气更随意、随意甚至略带敷衍。"
      },
      {
        "word_to_compare": "yeah",
        "analysis": "“Yeah” 与 “ya” 意义几乎完全相同，都是 “yes” 的口语形式，但 “yeah” 更常见于美式英语，发音更清晰；“ya” 更简短、更口语化，有时带有方言或懒音色彩，如美式南部或城市俚语。"
      },
      {
        "word_to_compare": "yup",
        "analysis": "“Yup” 是 “yes” 的另一种口语变体，语气更轻快、活泼，常带有积极或兴奋的语调；而 “ya” 更中性，甚至可能隐含不情愿或敷衍，语调更平淡。"
      }
    ]
  },
  {
    "word": "yacht",
    "pronunciation": "yach",
    "concise_definition": "n. 帆船, 游艇",
    "forms": {
      "plural": "yachts"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A relatively small, luxurious boat designed for pleasure cruising or racing, typically owned by wealthy individuals and equipped with comfortable accommodations.",
        "explanation_cn": "一种相对较小、豪华的船只，专为休闲巡航或竞赛设计，通常由富有人士拥有，并配备舒适的居住设施。",
        "example_en": "They spent their summer vacation sailing on a sleek white yacht off the coast of Monaco.",
        "example_cn": "他们夏天在摩纳哥海岸驾驶一艘流线型的白色游艇度假。"
      },
      {
        "pos": "noun",
        "explanation_en": "A vessel used for racing, often built with high-performance materials and aerodynamic design to maximize speed and maneuverability.",
        "explanation_cn": "一种专为竞赛设计的船只，通常采用高性能材料和空气动力学设计，以最大化速度与操控性。",
        "example_en": "The America's Cup features some of the most advanced yachts in the world.",
        "example_cn": "美洲杯帆船赛汇聚了世界上一些最先进的游艇。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "boat",
        "analysis": "“Boat” (船) 是一个泛指所有小型水上载具的通用词，可以是渔船、划艇、渡船等，不强调豪华或用途。而 “yacht” 特指用于休闲、娱乐或竞赛的豪华船只，具有更高的舒适性与象征财富的属性。"
      },
      {
        "word_to_compare": "ship",
        "analysis": "“Ship” (船/轮船) 通常指大型的、用于商业运输、军事或远洋航行的船只，规模远大于游艇，且功能以运输或作战为主。而 “yacht” 体积小、非商用，强调个人享受与生活方式。"
      },
      {
        "word_to_compare": "cruise ship",
        "analysis": "“Cruise ship” (邮轮) 是一种大型、多层、搭载数百至数千名乘客的旅游船舶，提供酒店式服务和娱乐设施，属于大众旅游产品。而 “yacht” 通常只容纳少数人，强调私密性、个性化和高端体验。"
      }
    ]
  },
  {
    "word": "yachts",
    "pronunciation": "yachts",
    "concise_definition": "n. 帆船, 游艇",
    "forms": {
      "singular": "yacht"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A medium to large-sized recreational boat or ship, typically powered by sails or engines, used for leisure, racing, or luxury travel.",
        "explanation_cn": "一种中型至大型的休闲船只，通常由帆或发动机驱动，用于休闲娱乐、竞赛或豪华旅行。",
        "example_en": "They spent their summer vacation cruising the Mediterranean on a sleek, 50-foot yacht.",
        "example_cn": "他们夏天在地中海乘坐一艘流线型的50英尺游艇度假。"
      },
      {
        "pos": "noun",
        "explanation_en": "A vessel designed for speed and elegance, often associated with wealth and status, and sometimes used in competitive sailing events.",
        "explanation_cn": "一种专为速度与优雅而设计的船只，常与财富和地位相关联，有时也用于竞技帆船赛事。",
        "example_en": "The America's Cup is one of the most prestigious yacht racing competitions in the world.",
        "example_cn": "美洲杯帆船赛是世界上最负盛名的游艇竞赛之一。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "boat",
        "analysis": "“Boat”（船）是一个泛指所有小型水上交通工具的总称，涵盖渔船、划艇、快艇等，不强调用途或奢华程度。而 “yacht” 特指用于休闲或竞赛的、通常较大型且设备豪华的船只，具有明确的社交与身份象征意义。"
      },
      {
        "word_to_compare": "ship",
        "analysis": "“Ship”（船/舰）一般指大型商用或军用船只，如货轮、油轮或军舰，强调运输或军事功能。而 “yacht” 是私人所有、非商业用途的休闲船只，体积通常小于船舶，且注重舒适性与设计美感。"
      },
      {
        "word_to_compare": "cruise ship",
        "analysis": "“Cruise ship”（邮轮）是为搭载数百至数千名乘客进行长途海上度假而设计的巨型船舶，配备酒店式设施，属于大众旅游产品。而 “yacht” 通常只容纳少数人（10人以内），强调私密性、个性化服务和高端体验，两者在规模、用途和受众上截然不同。"
      }
    ]
  },
  {
    "word": "yah",
    "pronunciation": "yæ",
    "concise_definition": "int. 嗯, 是的, 表示同意或确认（非正式口语）",
    "forms": {
      "variant": [
        "ya",
        "yeh"
      ]
    },
    "definitions": [
      {
        "pos": "interjection",
        "explanation_en": "An informal, often regional or colloquial expression used to convey agreement, affirmation, or acknowledgment, typically in casual speech.",
        "explanation_cn": "一种非正式、常带有地域或口语色彩的感叹词，用于表达同意、肯定或确认，多用于随意对话中。",
        "example_en": "Yah, I'll be there at seven.",
        "example_cn": "嗯，我会七点到那儿。"
      },
      {
        "pos": "interjection",
        "explanation_en": "A vocalized response indicating mild surprise, hesitation, or reluctant acceptance, often used to soften a reply or avoid direct confrontation.",
        "explanation_cn": "一种语气词，用于表达轻微的惊讶、犹豫或勉强接受，常用于缓和语气或避免直接对抗。",
        "example_en": "Yah... I guess you're right.",
        "example_cn": "嗯……我想你是对的。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "yes",
        "analysis": "“Yes” 是标准、中性的肯定回答，适用于所有语境；而 “yah” 是非正式口语变体，带有地域口音或随意语气，常用于美国南部、中西部或非正式社交场合，语义相同但语用更轻松、更口语化。"
      },
      {
        "word_to_compare": "yeah",
        "analysis": "“Yeah” 是 “yah” 最常见的现代口语变体，发音更轻、更普遍，广泛用于全球英语口语中；“yah” 则更偏向于特定方言（如美国南方）或老式用法，语调可能更拖长或更重，带有更强的地域色彩。"
      },
      {
        "word_to_compare": "uh-huh",
        "analysis": "“Uh-huh” 是一种非词汇化的肯定回应，通常以点头伴随，语气更含糊、被动；而 “yah” 是一个明确的词，带有语义内容，可用于独立成句，表达更主动的认同或回应。"
      }
    ]
  },
  {
    "word": "yahoo",
    "pronunciation": "yay·hoo",
    "concise_definition": "n. 喊叫者, 野蛮人, 雅虎; interj. 哈哈! 好极了!",
    "forms": {
      "plural": "yahoos"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A crude, vulgar, or uncivilized person; originally coined by Jonathan Swift in Gulliver's Travels to describe a race of brutish human-like creatures representing the worst aspects of humanity.",
        "explanation_cn": "指粗俗、野蛮或未开化的人；最初由乔纳森·斯威夫特在《格列佛游记》中创造，用以描述一种野蛮的人形生物，象征人性中最恶劣的方面。",
        "example_en": "He behaved like a yahoo at the concert, shouting and throwing bottles.",
        "example_cn": "他在音乐会上表现得像个野蛮人，大喊大叫还扔瓶子。"
      },
      {
        "pos": "noun",
        "explanation_en": "The name of a major American internet company, Yahoo! Inc., founded in 1994, known for its search engine, email, and web portal services.",
        "explanation_cn": "指一家美国大型互联网公司雅虎公司（Yahoo! Inc.），成立于1994年，以其搜索引擎、电子邮件和门户网站服务而闻名。",
        "example_en": "I used to check my email on Yahoo! every morning.",
        "example_cn": "我过去每天早上都用雅虎邮箱查邮件。"
      },
      {
        "pos": "interjection",
        "explanation_en": "An exclamation expressing excitement, triumph, or joy.",
        "explanation_cn": "表示兴奋、胜利或喜悦的感叹词。",
        "example_en": "Yahoo! We won the game!",
        "example_cn": "太棒了！我们赢了比赛！"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "lout",
        "analysis": "“Lout”（粗鲁的人）指举止粗俗、缺乏教养的人，语气较轻，常用于日常语境；而 “yahoo” 带有更强的文学和道德批判色彩，源自《格列佛游记》，暗示人性堕落，语义更重、更具讽刺性。"
      },
      {
        "word_to_compare": "brute",
        "analysis": "“Brute”（野兽般的人）强调生理上的残暴或缺乏理性，常用于描述暴力行为；“yahoo” 则更侧重于社会性粗俗和道德低下，不一定伴随暴力，但体现文明的缺失。"
      },
      {
        "word_to_compare": "google",
        "analysis": "“Google” 是另一家互联网巨头，与 “yahoo” 同为科技公司名称，但 “google” 已成为动词（意为“搜索”），而 “yahoo” 作为公司名已逐渐式微，其作为感叹词或贬义词的用法仍保留。两者在语义上无直接关联，仅在品牌语境中可作对比。"
      }
    ]
  },
  {
    "word": "yak",
    "pronunciation": "yak",
    "concise_definition": "n. 牦牛, 喋喋不休的人; v. 喋喋不休地讲",
    "forms": {
      "plural": "yaks"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A long-haired, stocky domesticated bovine animal native to the Himalayan region, valued for its wool, milk, meat, and as a beast of burden.",
        "explanation_cn": "一种原产于喜马拉雅地区的长毛、体格健壮的家养牛科动物，以其毛发、牛奶、肉类和作为驮畜而被重视。",
        "example_en": "The Tibetan herders rely on yaks to carry supplies across the mountain trails.",
        "example_cn": "西藏牧民依靠牦牛在山间小道上运送物资。"
      },
      {
        "pos": "noun",
        "explanation_en": "A person who talks excessively or incessantly, often in a boring or annoying way.",
        "explanation_cn": "指喋喋不休、爱唠叨的人，通常指说话冗长乏味或令人厌烦。",
        "example_en": "My uncle is a real yak—he talks for hours about his golf game.",
        "example_cn": "我叔叔真是个话痨，一聊起他的高尔夫球就能说上几个小时。"
      },
      {
        "pos": "verb",
        "explanation_en": "To talk at length, often in a tedious or unimportant way; to chatter or gossip.",
        "explanation_cn": "指长时间地说话，通常内容乏味或无关紧要；喋喋不休地闲聊或议论。",
        "example_en": "She yakked on about her vacation for the entire dinner.",
        "example_cn": "她在整个晚餐时间都在唠叨她的假期。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "ox",
        "analysis": "“Ox”（公牛/犍牛）泛指被驯化用于拉车或耕作的成年公牛，通常指体型庞大、力量强的牛类，但不特指毛发浓密的高山品种。而 “yak” 是特指喜马拉雅地区适应高寒环境的长毛牛种，具有独特的生理特征和文化用途。"
      },
      {
        "word_to_compare": "chatter",
        "analysis": "“Chatter”（闲聊）强调快速、轻快、非正式的说话，常用于描述轻松或琐碎的对话，如鸟儿啁啾或朋友闲谈。而 “yak” 更带有负面含义，强调说话冗长、令人厌烦，常含批评意味，语气更重。"
      },
      {
        "word_to_compare": "blab",
        "analysis": "“Blab”（泄露/多嘴）侧重于无意或不加节制地泄露秘密或信息，强调内容的不当暴露，而非说话的长度。而 “yak” 更关注说话行为本身——持续、啰嗦，不一定涉及泄密，但常让人感到疲惫。"
      }
    ]
  },
  {
    "word": "yale",
    "pronunciation": "yayl",
    "concise_definition": "n. 耶鲁大学",
    "forms": {
      "plural": "Yales"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A prestigious private Ivy League research university located in New Haven, Connecticut, United States, founded in 1701, known for its academic excellence, influential alumni, and historic campus.",
        "explanation_cn": "位于美国康涅狄格州纽黑文的一所著名私立常春藤盟校研究型大学，成立于1701年，以卓越的学术水平、杰出的校友网络和历史悠久的校园而闻名。",
        "example_en": "She earned her law degree from Yale and now works at a top international firm.",
        "example_cn": "她毕业于耶鲁大学，获得法学学位，如今在一家顶尖国际律师事务所工作。"
      },
      {
        "pos": "noun",
        "explanation_en": "A member or graduate of Yale University, often used to denote someone with elite educational background or social status.",
        "explanation_cn": "指耶鲁大学的在校生或毕业生，常用于形容拥有精英教育背景或社会地位的人。",
        "example_en": "Many of the country’s political leaders are Yales, shaped by the university’s rigorous curriculum and network.",
        "example_cn": "该国许多政治领袖都是耶鲁人，深受该校严谨课程和人脉网络的影响。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "harvard",
        "analysis": "“Harvard”（哈佛大学）与“Yale”同为美国顶尖常春藤盟校，均以学术声誉和精英教育著称。但哈佛更强调商业、公共政策与全球影响力，而耶鲁则以人文社科、法律和艺术领域的深厚传统闻名，校园文化更注重批判性思维与独立精神。"
      },
      {
        "word_to_compare": "princeton",
        "analysis": "“Princeton”（普林斯顿大学）与耶鲁同属常春藤盟校，但普林斯顿规模更小，更专注于本科教育与基础科学研究，学术氛围偏重理论与内敛；而耶鲁拥有更庞大的研究生院体系、活跃的公共辩论文化及更广泛的艺术与戏剧传统。"
      },
      {
        "word_to_compare": "stanford",
        "analysis": "“Stanford”（斯坦福大学）位于加州，以科技创新、创业精神和硅谷联系紧密著称，强调实用主义与商业化转化；而耶鲁则根植于东海岸传统精英教育体系，更重视人文素养、法律与公共事务的培养，风格更为古典与保守。"
      }
    ]
  },
  {
    "word": "yall",
    "pronunciation": "yawl",
    "concise_definition": "pron. 你们（南方美式英语中 'you all' 的缩略形式）",
    "forms": {
      "standard_form": "you all",
      "plural_form": "y'all"
    },
    "definitions": [
      {
        "pos": "pronoun",
        "explanation_en": "A colloquial contraction of 'you all,' used primarily in Southern American English to address a group of two or more people. It functions as the second-person plural pronoun.",
        "explanation_cn": "主要在美国南方英语中使用的口语化缩略形式，相当于 'you all'，用于称呼两个或以上的人，作为第二人称复数代词。",
        "example_en": "Y'all come back now, ya hear?",
        "example_cn": "你们一定要再回来啊，听到了吗？"
      },
      {
        "pos": "pronoun",
        "explanation_en": "Sometimes used informally to address a single person in a friendly, inclusive, or emphatic tone, especially in regional dialects.",
        "explanation_cn": "有时在非正式场合中用于亲切、包容或强调地称呼单数个体，尤其在某些方言中。",
        "example_en": "Y'all did a great job on that project!",
        "example_cn": "你（们）把这个项目做得太棒了！"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "you",
        "analysis": "“You” 是标准英语中的第二人称单数或复数代词，无数量区分。而 “yall” 是明确的复数形式，用于强调说话对象是多人，尤其在口语中避免歧义。在北方英语中，人们可能用 “you guys” 或 “you all” 来替代 “yall” 的功能。"
      },
      {
        "word_to_compare": "y'all",
        "analysis": "“Y’all” 是 “yall” 的标准拼写形式，带撇号表示缩略。两者发音和含义完全相同，但 “y’all” 更符合书面语规范，而 “yall” 常见于非正式文本、社交媒体或方言表达中，体现口语化风格。"
      },
      {
        "word_to_compare": "you guys",
        "analysis": "“You guys” 是美式英语中广泛使用的非正式复数形式，但带有性别倾向（常用于混合性别或男性群体），而 “yall” 更中性，广泛用于南方各族裔群体，文化包容性更强。此外，“you guys” 在正式场合可能被视为不够得体，而 “yall” 在其使用语境中是自然且被接受的。"
      }
    ]
  },
  {
    "word": "yamaha",
    "pronunciation": "yuh·muh·hah",
    "concise_definition": "n. 雅马哈（日本著名乐器与摩托车制造商）",
    "forms": {
      "plural": "Yamahas"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A Japanese multinational corporation founded in 1887, originally known for manufacturing pianos and musical instruments, and now widely recognized for producing motorcycles, marine products, and industrial machinery.",
        "explanation_cn": "一家成立于1887年的日本跨国公司，最初以制造钢琴和乐器闻名，现广泛知名于生产摩托车、船用产品和工业机械。",
        "example_en": "He bought a Yamaha guitar for his first music lesson.",
        "example_cn": "他为第一次音乐课买了一把雅马哈吉他。"
      },
      {
        "pos": "noun",
        "explanation_en": "A brand name commonly used to refer to any motorcycle or musical instrument made by the Yamaha Corporation, often used generically in casual speech.",
        "explanation_cn": "在日常口语中，常被用作泛指雅马哈公司生产的任何摩托车或乐器的品牌名称。",
        "example_en": "I saw a Yamaha speeding down the highway — must be a new model.",
        "example_cn": "我看到一辆雅马哈在高速公路上飞驰——一定是新款。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "Honda",
        "analysis": "“Honda”（本田）是另一家日本大型制造商，主要生产汽车、摩托车和动力设备，与 Yamaha 在摩托车领域有直接竞争。但 Honda 的产品线更侧重于汽车和发动机技术，而 Yamaha 更强项于音乐乐器和高性能船用发动机。"
      },
      {
        "word_to_compare": "Roland",
        "analysis": "“Roland”（罗兰）是另一家日本电子乐器制造商，以电子鼓、合成器和音乐制作设备著称。与 Yamaha 相比，Roland 更专注于数字音乐技术和现代电子音效，而 Yamaha 在传统乐器（如钢琴、管风琴）和声学乐器制造方面更具历史积淀和市场主导地位。"
      },
      {
        "word_to_compare": "Suzuki",
        "analysis": "“Suzuki”（铃木）同样是日本知名摩托车和汽车制造商，与 Yamaha 在两轮交通工具市场有重叠。但 Suzuki 更强调经济型、实用型产品，而 Yamaha 更注重运动性能、设计美学和高端市场定位，尤其在赛车和音乐领域拥有更强的品牌形象。"
      }
    ]
  },
  {
    "word": "yan",
    "pronunciation": "yahn",
    "concise_definition": "n. 烟, 烟雾 (中文方言或音译词，非标准英语词汇)",
    "forms": {
      "plural": "yans"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A non-standard English term, often used as a phonetic rendering of the Chinese word '烟' (yān), meaning smoke or fumes, especially in contexts involving tobacco, incense, or industrial emissions.",
        "explanation_cn": "非标准英语词汇，常作为中文‘烟’（yān）的音译，指烟雾或烟气，尤指烟草、香火或工业排放产生的烟。",
        "example_en": "The temple was filled with yan from the burning incense sticks.",
        "example_cn": "寺庙里弥漫着点燃的香火所冒出的烟。"
      },
      {
        "pos": "noun",
        "explanation_en": "Used informally in some English-speaking communities with Chinese cultural influence to refer to cigarette smoke or the act of smoking, especially in casual or transliterated speech.",
        "explanation_cn": "在一些受中华文化影响的英语使用者群体中，非正式地用于指香烟的烟雾或吸烟行为，常见于口语或音译语境。",
        "example_en": "He stepped outside to have a quick yan before returning to work.",
        "example_cn": "他出门抽了口烟，然后回去工作。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "smoke",
        "analysis": "“Smoke” 是标准英语中表示烟雾的通用词，涵盖所有来源（如火、香烟、工业排放）的可见气态产物。而 “yan” 是中文‘烟’的音译，仅在特定文化语境中使用，不具备普遍语言接受度，属于借词或方言表达。"
      },
      {
        "word_to_compare": "fume",
        "analysis": "“Fume” 通常指刺鼻、有害的气体或烟雾，多用于化学或工业语境，带有负面含义。而 “yan” 语义更中性，可指香烟、香火等日常烟雾，情感色彩更温和，且不具备专业术语属性。"
      },
      {
        "word_to_compare": "vapor",
        "analysis": "“Vapor” 指液体蒸发形成的气态物质，如水蒸气，通常无色或透明，与 “yan” 所指的可见颗粒状烟雾（含碳粒）在物理形态和来源上不同。'Yan' 更接近 'smoke' 而非 'vapor'。"
      }
    ]
  },
  {
    "word": "yang",
    "pronunciation": "yäng",
    "concise_definition": "n. 阳, 阳性, 阳气",
    "forms": {
      "plural": "yangs"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "In Chinese philosophy, the active, positive, masculine principle in nature, characterized by light, heat, movement, and expansion, often contrasted with yin.",
        "explanation_cn": "在中国哲学中，指自然界中主动、积极、阳性的原则，以光明、温暖、运动和扩张为特征，常与阴相对。",
        "example_en": "The balance of yin and yang is essential to traditional Chinese medicine.",
        "example_cn": "阴阳平衡是中医的根本原则。"
      },
      {
        "pos": "noun",
        "explanation_en": "A symbol or representation of this principle in Taoist cosmology, often depicted as the white half of the yin-yang symbol.",
        "explanation_cn": "在道教宇宙观中，作为这一原则的象征，通常以阴阳符号中的白色部分表示。",
        "example_en": "The temple's architecture reflects the harmony of yin and yang, with bright yang areas contrasting with shaded yin courtyards.",
        "example_cn": "这座寺庙的建筑体现了阴阳和谐，明亮的阳区与阴暗的庭院形成对比。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "yin",
        "analysis": "“Yin”（阴）是“yang”的对立面，代表被动、消极、阴性的原则，以黑暗、寒冷、静止和收缩为特征。两者相互依存、相互转化，共同构成宇宙运行的基本动力。单独使用“yang”时，其意义必须通过与“yin”的对比才能完整理解。"
      },
      {
        "word_to_compare": "masculine",
        "analysis": "“Masculine”（阳性的，男性的）在西方语境中主要指与男性特质相关的属性，如力量、理性、主动。而“yang”虽常被译为“masculine”，但其哲学内涵更广泛，涵盖自然能量的动态属性，不限于性别，也不带有社会文化偏见。"
      },
      {
        "word_to_compare": "positive",
        "analysis": "“Positive”（积极的）在一般英语中指乐观、肯定或有利的含义，而“yang”作为哲学概念，其“阳性”属性特指能量的外向性与活跃性，不等同于道德或情绪上的“正面”。例如，风暴在“yang”中是阳性能量的体现，但未必是‘积极’的。"
      }
    ]
  },
  {
    "word": "yankee",
    "pronunciation": "yang·kee",
    "concise_definition": "n. 北方人, 美国人（尤指美国东北部人）, 有时含贬义",
    "forms": {
      "plural": "yankees"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A person from the northern United States, especially during or after the American Civil War; often used to distinguish Northerners from Southerners.",
        "explanation_cn": "指美国北方人，尤其在美国内战期间或之后，常用于区分北方人与南方人。",
        "example_en": "During the Civil War, Confederate soldiers often referred to Union troops as 'yankees'.",
        "example_cn": "内战期间，南方联盟士兵常称联邦军队为‘北方佬’。"
      },
      {
        "pos": "noun",
        "explanation_en": "A colloquial or sometimes derogatory term used by non-Americans to refer to any American, especially in contexts of cultural or political criticism.",
        "explanation_cn": "非美国人对任何美国人的非正式称呼，有时带有贬义，尤其在文化或政治批评语境中使用。",
        "example_en": "In some parts of the world, 'yankee' is used to criticize U.S. foreign policy.",
        "example_cn": "在世界某些地区，‘yankee’一词被用来批评美国的外交政策。"
      },
      {
        "pos": "noun",
        "explanation_en": "A member of the New York Yankees, a famous professional baseball team based in the Bronx, New York.",
        "explanation_cn": "指纽约洋基队（位于纽约布朗克斯区的著名职业棒球队）的队员。",
        "example_en": "He's been a lifelong fan of the yankees and owns every jersey from the 1990s.",
        "example_cn": "他一直是洋基队的忠实球迷，收藏了所有1990年代的球衣。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "american",
        "analysis": "“American”（美国人）是中性、正式的术语，泛指所有美国公民，无地域或情感色彩。而 “yankee” 通常带有地域性（特指北方人）或文化偏见（非美国人使用时可能含贬义），语义范围更窄、语用更复杂。"
      },
      {
        "word_to_compare": "northerner",
        "analysis": "“Northerner”（北方人）是地理性中性词，仅指居住在美国北部的人，不带历史或政治含义。而 “yankee” 不仅指地理来源，还承载着内战历史、文化对立和国际刻板印象，语义更厚重。"
      },
      {
        "word_to_compare": "gringo",
        "analysis": "“Gringo”（洋基佬/老外）是拉丁美洲地区对美国人的贬义称呼，常用于口语，强调文化入侵或外来者身份。与 “yankee” 类似，但 “gringo” 几乎不用于美国本土，且主要在西班牙语语境中使用，地域性更强。"
      }
    ]
  },
  {
    "word": "yankees",
    "pronunciation": "yæn·kiz",
    "concise_definition": "n. 纽约洋基队, 北方人, 美国人（俚语）",
    "forms": {
      "singular": "yankee"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A member of the New York Yankees, a professional baseball team based in New York City, known for its long history of success and iconic status in Major League Baseball.",
        "explanation_cn": "指位于纽约市的职业棒球队纽约洋基队的队员，该队以悠久的成功历史和在美国职业棒球大联盟中的标志性地位而闻名。",
        "example_en": "The yankees won their 27th World Series title in 2009.",
        "example_cn": "洋基队在2009年赢得了他们的第27个世界大赛冠军。"
      },
      {
        "pos": "noun",
        "explanation_en": "A person from the northern United States, especially during or after the American Civil War, often used in contrast to 'Southerners'.",
        "explanation_cn": "指美国北方人，尤其在美国内战期间或之后，常与‘南方人’相对使用。",
        "example_en": "During the Civil War, the yankees fought against the confederate soldiers.",
        "example_cn": "内战期间，北方人与南方邦联士兵作战。"
      },
      {
        "pos": "noun",
        "explanation_en": "A colloquial term used outside the United States to refer to an American person, sometimes with a connotation of cultural or economic dominance.",
        "explanation_cn": "在美国以外地区对美国人的俚称，有时带有文化或经济主导的暗示。",
        "example_en": "The tourists were surprised when locals called them 'yankees' despite their Canadian passports.",
        "example_cn": "尽管这些游客持有加拿大护照，当地居民仍称他们为‘洋基’，令他们感到惊讶。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "american",
        "analysis": "“American”（美国人）是正式、中性的术语，泛指所有美国公民或来自美国的人。而 “yankee” 是非正式用语，常带有地域、历史或文化色彩，可能隐含褒贬，尤其在国际语境中可能被视为刻板印象或轻蔑称呼。"
      },
      {
        "word_to_compare": "northerner",
        "analysis": "“Northerner”（北方人）是地理和历史上的中性描述，专指美国北部居民，不涉及文化刻板印象。而 “yankee” 虽然也指北方人，但因与内战、洋基队等文化符号紧密关联，语义更丰富，有时带有情感或政治色彩。"
      },
      {
        "word_to_compare": "bostonian",
        "analysis": "“Bostonian”（波士顿人）是特指来自波士顿市的人，地域范围极小且具体。而 “yankee” 范围更广，可泛指整个新英格兰地区乃至全美北方，甚至扩展为对所有美国人的泛称，语义层级更高、更模糊。"
      }
    ]
  },
  {
    "word": "yao",
    "pronunciation": "yow",
    "concise_definition": "n. 药, 草药; v. (方言) 要, 需要",
    "forms": {
      "plural": "yaos"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A traditional Chinese medicinal herb or remedy, often used in herbal medicine to treat illness or promote health.",
        "explanation_cn": "指中医中使用的草药或药方，常用于治疗疾病或促进健康。",
        "example_en": "She brewed a pot of yao to soothe her cold.",
        "example_cn": "她煮了一壶草药来缓解感冒。"
      },
      {
        "pos": "verb",
        "explanation_en": "A dialectal or informal usage, primarily in southern Chinese dialects, meaning 'to want' or 'to need'.",
        "explanation_cn": "主要在中国南方方言中使用的非正式动词，意为‘想要’或‘需要’。",
        "example_en": "I yao some tea — can you pass me the cup?",
        "example_cn": "我想要点茶——你能把杯子递给我吗？"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "medicine",
        "analysis": "“Medicine” (药物) 是一个通用英语词，泛指所有用于治疗疾病的化学或生物制剂，包括西药和中药。而 “yao” 特指中国传统医学体系中的草药或天然制剂，具有文化特定性，不等同于现代医学中的“medicine”。"
      },
      {
        "word_to_compare": "want",
        "analysis": "“Want” (想要) 是标准英语中表达需求或欲望的动词，适用于所有语境。而 “yao” 作为方言动词，仅在特定汉语方言中使用，语义相近但语用范围极窄，不具备标准英语的普遍性。"
      },
      {
        "word_to_compare": "herb",
        "analysis": "“Herb” (草本植物) 指具有药用、调味或芳香价值的植物，是西方语境中的通用术语。而 “yao” 不仅指植物本身，更强调其在中医理论中的配伍、炮制和治疗功能，是一个包含文化实践的整体概念，比 “herb” 更复杂、更系统。"
      }
    ]
  },
  {
    "word": "yard",
    "pronunciation": "yahrd",
    "concise_definition": "n. 院子, 码（长度单位）, 一堆, 场地",
    "forms": {
      "plural": "yards"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "An outdoor area adjacent to a building, typically enclosed by a fence or wall, used for gardening, recreation, or utility purposes.",
        "explanation_cn": "指紧邻建筑物的户外区域，通常由围栏或墙壁围起来，用于园艺、休闲或实用目的。",
        "example_en": "The children played in the backyard while their parents grilled dinner.",
        "example_cn": "孩子们在后院玩耍，而他们的父母正在烤晚餐。"
      },
      {
        "pos": "noun",
        "explanation_en": "A unit of length equal to three feet or 0.9144 meters, commonly used in the United States and the United Kingdom for measuring fabric, land, or distance.",
        "explanation_cn": "一种长度单位，等于三英尺或0.9144米，常用于美国和英国测量布料、土地或距离。",
        "example_en": "The fabric store sells material by the yard.",
        "example_cn": "这家布料店按码出售布料。"
      },
      {
        "pos": "noun",
        "explanation_en": "A large open area used for a specific purpose, such as a railway yard, shipyard, or waste yard, often associated with industrial or logistical activity.",
        "explanation_cn": "指用于特定用途的大片空地，如铁路编组场、造船厂或垃圾场，通常与工业或物流活动相关。",
        "example_en": "The train was being repaired in the maintenance yard.",
        "example_cn": "这列火车正在维修场进行修理。"
      },
      {
        "pos": "noun",
        "explanation_en": "A large quantity or pile of something, often used informally to describe an abundance.",
        "explanation_cn": "指大量或一堆某物，常用于非正式语境中形容丰盛或堆积的状态。",
        "example_en": "There was a yard of paperwork to sort through after the meeting.",
        "example_cn": "会议结束后，有一大堆文件需要整理。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "garden",
        "analysis": "“Garden”（花园）特指种植花草、蔬菜或观赏植物的区域，强调园艺功能和美学设计；而 “yard” 更广泛，可包含草坪、车道、工具棚等非种植区域，功能更实用、更通用。"
      },
      {
        "word_to_compare": "meter",
        "analysis": "“Meter”（米）是国际单位制中的基本长度单位，全球通用；而 “yard” 是英制单位，主要在英美国家使用，1码约等于0.9144米，两者在数值和使用范围上存在显著差异。"
      },
      {
        "word_to_compare": "courtyard",
        "analysis": "“Courtyard”（庭院）特指被建筑物四面围合的内部开放空间，常见于公共建筑或传统住宅；而 “yard” 通常是单侧或后侧开放的，不一定是被建筑包围的，结构更自由、更日常化。"
      }
    ]
  },
  {
    "word": "yards",
    "pronunciation": "yahrds",
    "concise_definition": "n. 码（长度单位）, 庭院, 场地",
    "forms": {
      "singular": "yard"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A unit of length in the imperial and US customary systems, equal to three feet or 0.9144 meters.",
        "explanation_cn": "英制和美国 customary 系统中的长度单位，等于三英尺或 0.9144 米。",
        "example_en": "The football field is 100 yards long.",
        "example_cn": "这个橄榄球场长100码。"
      },
      {
        "pos": "noun",
        "explanation_en": "An area of land adjacent to or surrounding a building, typically paved or grass-covered, often used for domestic or commercial purposes.",
        "explanation_cn": "紧邻或环绕建筑物的一块土地，通常铺有砖石或长有草坪，常用于住宅或商业用途。",
        "example_en": "The children were playing in the backyard.",
        "example_cn": "孩子们正在后院玩耍。"
      },
      {
        "pos": "noun",
        "explanation_en": "A designated area for a specific activity, such as a railway yard, shipyard, or scrap yard.",
        "explanation_cn": "用于特定活动的指定区域，如铁路编组场、造船厂或废料场。",
        "example_en": "The train engines were stored in the railway yard.",
        "example_cn": "火车头停放在铁路编组场里。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "meter",
        "analysis": "“Meter”（米）是国际单位制中的基本长度单位，而 “yard” 是英制单位，两者都用于测量距离，但 “yard” 主要用于美国和英国的日常语境，如体育场地或布料长度，而 “meter” 在全球科学和大多数国家中通用。1 码约等于 0.9144 米，略短于 1 米。"
      },
      {
        "word_to_compare": "garden",
        "analysis": "“Garden”（花园）特指种植花草、蔬菜或观赏植物的区域，强调园艺和自然美感；而 “yard” 更泛指房屋周围的空地，可能包含草坪、铺地、工具棚等，不一定有植物，用途更广泛且更实用。"
      },
      {
        "word_to_compare": "courtyard",
        "analysis": "“Courtyard”（庭院）通常指被建筑物四面围合的内部开放空间，常见于公共建筑或传统住宅，具有封闭性和仪式感；而 “yard” 通常是开放的、单侧或两侧毗邻建筑的户外区域，结构更简单、用途更日常。"
      }
    ]
  },
  {
    "word": "yarn",
    "pronunciation": "yarn",
    "concise_definition": "n. 纱线, 线; v. 讲述, 闲聊",
    "forms": {
      "plural": "yarns",
      "third_person_singular": "yarns",
      "past_tense": "yarned",
      "past_participle": "yarned",
      "present_participle": "yarning"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A long, continuous strand of twisted fibers, such as wool, cotton, or synthetic materials, used for knitting, weaving, or sewing.",
        "explanation_cn": "由羊毛、棉或合成纤维等材料捻成的长而连续的线状物，用于编织、织造或缝纫。",
        "example_en": "She bought a ball of soft wool yarn to knit a sweater.",
        "example_cn": "她买了一团柔软的羊毛纱线来织一件毛衣。"
      },
      {
        "pos": "noun",
        "explanation_en": "A long, often exaggerated or fictional story, typically told in a casual or entertaining way.",
        "explanation_cn": "一段冗长、常被夸张或虚构的故事，通常以轻松或娱乐的方式讲述。",
        "example_en": "He spun a yarn about meeting a pirate on his vacation in the Caribbean.",
        "example_cn": "他讲了一个关于在加勒比度假时遇到海盗的离奇故事。"
      },
      {
        "pos": "verb",
        "explanation_en": "To tell a long, often fanciful or exaggerated story, especially in a relaxed or conversational manner.",
        "explanation_cn": "以轻松或闲聊的方式讲述一段冗长、常带幻想或夸张色彩的故事。",
        "example_en": "The old sailors loved to yarn about their adventures at sea.",
        "example_cn": "那些老水手喜欢闲聊他们在海上的冒险经历。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "thread",
        "analysis": "“Thread” (线) 通常指更细、更纤细的纤维，常用于缝纫或刺绣，强调其物理属性和精细度；而 “yarn” 更粗、更结实，主要用于编织或织造，常指成团的纱线。此外，”thread“ 一般不用于比喻性故事，而 ”yarn“ 在口语中常指夸张的闲谈。"
      },
      {
        "word_to_compare": "tale",
        "analysis": "“Tale” (故事) 是一个通用词，泛指任何叙述性故事，可以是真实的或虚构的，但不带有口语化或夸张的语用色彩；而 ”yarn“ 作为名词时特指那种冗长、夸张、带有娱乐性质的闲谈式故事，语体更口语、更随意。"
      },
      {
        "word_to_compare": "chat",
        "analysis": "“Chat” (闲聊) 指日常轻松的对话，通常是简短、即时、非正式的交流；而 ”yarn“ 作为动词时，强调的是讲述一个结构完整、内容丰富的长篇故事，而非零散的对话。因此，”yarn“ 比 ”chat“ 更具叙事性和表演性。"
      }
    ]
  },
  {
    "word": "yates",
    "pronunciation": "yayts",
    "concise_definition": "n. (姓氏) 耶茨",
    "forms": {
      "plural": "Yateses"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A surname of English origin, commonly found in historical and contemporary contexts, often associated with notable individuals in literature, politics, or the arts.",
        "explanation_cn": "一个源自英语的姓氏，常见于历史和当代语境中，常与文学、政治或艺术领域的知名人物相关联。",
        "example_en": "Elizabeth Yates was a prominent 19th-century British actress and theatre manager.",
        "example_cn": "伊丽莎白·耶茨是19世纪英国著名的女演员和剧院经理。"
      },
      {
        "pos": "noun",
        "explanation_en": "A family name that may refer to specific individuals such as Richard Yates, the American novelist known for his realistic portrayals of middle-class life.",
        "explanation_cn": "可指特定人物的姓氏，例如美国小说家理查德·耶茨，以其对中产阶级生活的现实主义描绘而闻名。",
        "example_en": "Richard Yates's novel Revolutionary Road is considered a classic of American literature.",
        "example_cn": "理查德·耶茨的小说《革命之路》被视为美国文学经典。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "Yates",
        "analysis": "“Yates” 是一个专有名词（姓氏），不具备普通名词的语义范畴，因此无法与普通词汇如 “gates” 或 “bates” 进行语义比较。其唯一用法是作为人名，区别于具有通用含义的单词。"
      }
    ]
  },
  {
    "word": "yay",
    "pronunciation": "yay",
    "concise_definition": "interj. 好耶！万岁！",
    "forms": {
      "plural": "yays"
    },
    "definitions": [
      {
        "pos": "interjection",
        "explanation_en": "An exclamation used to express joy, excitement, or approval, often in informal or childlike contexts.",
        "explanation_cn": "用于表达喜悦、兴奋或赞同的感叹词，常用于非正式或儿童式的语境中。",
        "example_en": "Yay! We won the game!",
        "example_cn": "好耶！我们赢了比赛！"
      },
      {
        "pos": "interjection",
        "explanation_en": "A celebratory shout, sometimes used sarcastically or ironically to express mock enthusiasm.",
        "explanation_cn": "一种庆祝性的喊叫，有时用于讽刺或反语，表达假装的兴奋。",
        "example_en": "Yay, another meeting. Just what I needed.",
        "example_cn": "好耶，又开个会。真是我最需要的。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "hooray",
        "analysis": "“Hooray” 与 “yay” 意义相近，都表示欢呼或庆祝，但 “hooray” 更正式、更传统，常用于成人场合或书面语，而 “yay” 更口语化、更轻快，常用于儿童或轻松语境。"
      },
      {
        "word_to_compare": "awesome",
        "analysis": "“Awesome” 是形容词，用于描述某事物令人惊叹或极好，而 “yay” 是感叹词，直接表达情绪反应。前者评价事物，后者表达即时情感，二者功能不同。"
      },
      {
        "word_to_compare": "woohoo",
        "analysis": "“Woohoo” 与 “yay” 都是表达兴奋的感叹词，但 “woohoo” 带有更强烈的能量感和奔放感，常用于庆祝突破性成就或极度兴奋的时刻，而 “yay” 更温和、更普遍，适用于日常小喜悦。"
      }
    ]
  },
  {
    "word": "ye",
    "pronunciation": "yē",
    "concise_definition": "pron. 你们 (古语或诗歌用语)",
    "forms": {
      "nominative": "ye",
      "objective": "you",
      "possessive": "your",
      "possessive_pronoun": "yours"
    },
    "definitions": [
      {
        "pos": "pronoun",
        "explanation_en": "An archaic or poetic second-person plural pronoun used in Early Modern English to address a group of people; commonly found in religious texts, Shakespearean drama, and historical literature.",
        "explanation_cn": "古英语或诗歌中使用的第二人称复数代词，用于称呼一群人；常见于宗教文本、莎士比亚戏剧和历史文献中。",
        "example_en": "Ye shall know the truth, and the truth shall make you free.",
        "example_cn": "你们必晓得真理，真理必叫你们得以自由。"
      },
      {
        "pos": "pronoun",
        "explanation_en": "Sometimes used in modern contexts to evoke an archaic, formal, or theatrical tone, especially in fantasy, historical reenactments, or religious settings.",
        "explanation_cn": "有时在现代语境中使用，以营造古风、正式或戏剧性的语调，尤其见于奇幻作品、历史重演或宗教场合。",
        "example_en": "Ye are welcome to the castle, travelers of the realm.",
        "example_cn": "欢迎你们，来自王国的旅人。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "you",
        "analysis": "“You” 是现代英语中唯一的第二人称代词，既可作单数也可作复数，已完全取代了 “ye” 的功能。而 “ye” 是其古语形式，仅用于特定历史或文学语境，现代口语中已不再使用。"
      },
      {
        "word_to_compare": "thou",
        "analysis": "“Thou” 是 “ye” 的单数形式，用于称呼一个人，常与 “thee”（宾格）和 “thy”（所有格）搭配使用，构成古英语第二人称单数体系。而 “ye” 是复数形式，二者共同构成古英语中对人称的细致区分，现代英语中均已消失。"
      },
      {
        "word_to_compare": "y'all",
        "analysis": "“Y’all” 是美式英语南方方言中表示第二人称复数的非正式形式，功能上相当于 “ye”，但属于现代口语演变产物，语体更随意，且无历史或文学庄重感。而 “ye” 带有强烈的古典与宗教色彩，语体更为正式和古老。"
      }
    ]
  },
  {
    "word": "yea",
    "pronunciation": "yay",
    "concise_definition": "int. 是的, 赞成, 同意 (常用于投票或正式场合)",
    "forms": {
      "variant": "ye",
      "archaic_form": "yay"
    },
    "definitions": [
      {
        "pos": "interjection",
        "explanation_en": "An affirmative response used in formal voting or deliberative settings to express agreement or approval, often contrasted with 'nay'.",
        "explanation_cn": "在正式投票或审议场合中用于表达赞成或同意的肯定回应，常与 'nay'（反对）相对。",
        "example_en": "All those in favor, say 'yea'.",
        "example_cn": "赞成的请说 'yea'。"
      },
      {
        "pos": "adverb",
        "explanation_en": "An informal or archaic way of saying 'yes', often used in casual speech or regional dialects to express affirmation.",
        "explanation_cn": "一种非正式或古旧的 'yes' 表达方式，常用于口语或地方方言中表示肯定。",
        "example_en": "Yea, I think we should go.",
        "example_cn": "是啊，我觉得我们应该去。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "yes",
        "analysis": "“Yes” 是现代英语中最通用、最中性的肯定词，适用于所有语境。而 “yea” 多用于正式投票场合或古语风格，语体更庄重或陈旧。在日常对话中使用 “yea” 会显得刻意或滑稽。"
      },
      {
        "word_to_compare": "yay",
        "analysis": "“Yay” 是一个表达兴奋或欢呼的感叹词，如庆祝胜利时喊出的 ‘Yay!’，带有强烈的情感色彩。而 “yea” 是理性、有目的的赞成表态，不带情绪渲染。两者拼写相近但语义和语用完全不同。"
      },
      {
        "word_to_compare": "aye",
        "analysis": "“Aye” 与 “yea” 在正式投票中常可互换，尤其在英国议会或海军传统中使用。两者都表示赞成，但 “aye” 更具英式英语和历史色彩，而 “yea” 在美式英语中更常见于国会投票语境。"
      }
    ]
  },
  {
    "word": "yeah",
    "pronunciation": "yeh",
    "concise_definition": "int. 是的, 对, 嗯",
    "forms": {
      "variant": [
        "yea",
        "yep",
        "yup"
      ]
    },
    "definitions": [
      {
        "pos": "interjection",
        "explanation_en": "An informal, casual way of expressing agreement or affirmation, often used in spoken English to convey a relaxed or enthusiastic assent.",
        "explanation_cn": "一种非正式、随意的表达同意或肯定的方式，常用于口语中，传达一种轻松或热情的赞同。",
        "example_en": "Yeah, I think we should leave now before it gets too crowded.",
        "example_cn": "是啊，我觉得我们该现在就走，免得人太多。"
      },
      {
        "pos": "interjection",
        "explanation_en": "A response used to acknowledge a statement or question, sometimes with hesitation or mild reluctance, depending on tone and context.",
        "explanation_cn": "用于回应陈述或问题，根据语调和语境，有时带有犹豫或轻微的不情愿。",
        "example_en": "Yeah... I guess you're right, but I'm still not sure.",
        "example_cn": "嗯……我想你是对的，但我还是不太确定。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "yes",
        "analysis": "“Yes” 是标准、正式的肯定回答，适用于所有语境，包括书面语和正式场合。而 “yeah” 是口语化表达，语气更随意、亲切，常用于朋友间或非正式对话中，正式场合使用会显得不够庄重。"
      },
      {
        "word_to_compare": "yep",
        "analysis": "“Yep” 与 “yeah” 意义相近，都是非正式的肯定词，但 “yep” 带有更明显的轻快、活泼甚至俏皮的语气，常用于短促回应。而 “yeah” 更中性，适用范围更广，语气可随语调变化而更显犹豫或坚定。"
      },
      {
        "word_to_compare": "yup",
        "analysis": "“Yup” 是 “yeah” 的一种变体，发音更重、更口语化，常带有美国南部或乡村口音色彩，语气上比 “yeah” 更加随意甚至有点土气。在书面语中，“yup” 更少见，多用于模仿口语或特定人物语气。"
      }
    ]
  },
  {
    "word": "year",
    "pronunciation": "yir",
    "concise_definition": "n. 年, 一年的时间",
    "forms": {
      "plural": "years"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A period of 365 or 366 days, based on the Earth's orbit around the Sun, used as a unit of time for measuring age, history, and cycles.",
        "explanation_cn": "指地球绕太阳公转一周所需的时间，约为365或366天，用作衡量年龄、历史和周期的时间单位。",
        "example_en": "She has been teaching for over twenty years.",
        "example_cn": "她已经教书二十多年了。"
      },
      {
        "pos": "noun",
        "explanation_en": "A specific calendar year, often referred to in contexts such as fiscal year, academic year, or calendar year, used to organize events and records.",
        "explanation_cn": "指特定的日历年，常用于财政年度、学年或日历年等语境中，用于组织事件和记录。",
        "example_en": "The company’s profits increased significantly in the last fiscal year.",
        "example_cn": "该公司上一财年的利润显著增长。"
      },
      {
        "pos": "noun",
        "explanation_en": "A period of time characterized by a particular quality or event, often used metaphorically to describe a phase in life or history.",
        "explanation_cn": "指以某种特定品质或事件为特征的一段时间，常用于比喻人生或历史中的某个阶段。",
        "example_en": "It was a year of great change for the country.",
        "example_cn": "那一年是这个国家发生巨大变革的一年。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "annum",
        "analysis": "“Annum”（拉丁语来源，意为“年”）是正式或学术语境中对“year”的同义词，多用于固定表达如“per annum”（每年），强调计量单位的精确性，而“year”是日常通用词，适用范围更广。"
      },
      {
        "word_to_compare": "decade",
        "analysis": "“Decade”（十年）是比“year”更大的时间单位，由十个“year”组成。它用于描述更长期的趋势或历史阶段，而“year”聚焦于单一年份的事件或变化。"
      },
      {
        "word_to_compare": "season",
        "analysis": "“Season”（季节）指一年中因气候和自然现象划分的四个部分（春、夏、秋、冬），是“year”的组成部分。它强调自然周期，而“year”是完整的时间计量单位，不依赖气候特征。"
      }
    ]
  },
  {
    "word": "yearbook",
    "pronunciation": "yir·buk",
    "concise_definition": "n. 年鉴, 校刊, 年度纪念册",
    "forms": {
      "plural": "yearbooks"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A book published annually, typically by a school or organization, that documents the events, achievements, and members of a particular year through photographs, captions, and written records.",
        "explanation_cn": "一种每年出版的书籍，通常由学校或组织发行，通过照片、说明文字和文字记录来记载某一年的重要事件、成就和成员信息。",
        "example_en": "The senior class spent months compiling photos and quotes for the yearbook.",
        "example_cn": "毕业班的学生花了数月时间收集照片和名言，编纂年度纪念册。"
      },
      {
        "pos": "noun",
        "explanation_en": "A commemorative record that captures the spirit, culture, and memories of a specific time period, often serving as a nostalgic keepsake for alumni or participants.",
        "explanation_cn": "一种纪念性记录，捕捉特定时期的精神、文化与回忆，常作为校友或参与者的怀旧珍藏品。",
        "example_en": "Looking through her high school yearbook brought back memories of her first dance and best friends.",
        "example_cn": "翻看她的高中年鉴，唤起了她对第一次舞会和最好的朋友们的回忆。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "annual",
        "analysis": "“Annual” (年度的) 是一个形容词，泛指每年发生或出版的事物，如年度报告、年度会议。而 “yearbook” 是一个具体名词，特指以图文形式记录年度事件的纪念册，具有更强的叙事性和情感价值。"
      },
      {
        "word_to_compare": "album",
        "analysis": "“Album” (相册) 通常指按主题或时间整理的照片集合，侧重于视觉呈现，内容较为自由，不一定包含文字说明或组织性记录。而 “yearbook” 是结构化的出版物，包含正式的编排、文字叙述和集体性内容，常用于教育或机构场景。"
      },
      {
        "word_to_compare": "chronicle",
        "analysis": "“Chronicle” (编年史) 是一种按时间顺序记录历史事件的正式文献，通常具有学术性或官方性，涵盖较长的历史跨度。而 “yearbook” 专注于单一学年或年度，内容更个人化、生活化，面向普通参与者而非历史研究者。"
      }
    ]
  },
  {
    "word": "yearly",
    "pronunciation": "yir·lee",
    "concise_definition": "adj. 每年的, 一年一次的; adv. 每年, 一年一次地",
    "forms": {
      "comparative": "yearlier",
      "superlative": "yearliest"
    },
    "definitions": [
      {
        "pos": "adjective",
        "explanation_en": "Occurring once every year or relating to a period of one year; used to describe events, payments, or measurements that happen annually.",
        "explanation_cn": "指每年发生一次的，或与一年期间相关的；用于描述每年发生的事件、付款或测量。",
        "example_en": "The company holds a yearly meeting to review its financial performance.",
        "example_cn": "该公司每年举行一次会议，审查其财务表现。"
      },
      {
        "pos": "adverb",
        "explanation_en": "Happening or done once each year; indicating frequency on an annual basis.",
        "explanation_cn": "指每年发生或执行一次，表示以年为单位的频率。",
        "example_en": "She travels to her hometown yearly to visit her elderly parents.",
        "example_cn": "她每年都会回故乡探望年迈的父母。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "annual",
        "analysis": "“Annual” (每年的) 与 “yearly” 意义高度重叠，常可互换，但 “annual” 更正式，多用于书面语、官方文件或商业语境（如 annual report）；而 “yearly” 更口语化，常用于日常交流。两者都强调“一年一次”，但 “annual” 有时隐含“按日历年度”计算的含义。"
      },
      {
        "word_to_compare": "year-round",
        "analysis": "“Year-round” (全年无休的) 指持续一整年、不间断地发生，与 “yearly” 的“一年一次”含义相反。例如，year-round service 表示全年持续提供服务，而 yearly service 表示每年只提供一次服务。"
      },
      {
        "word_to_compare": "biannual",
        "analysis": "“Biannual” (一年两次的) 表示每年发生两次，与 “yearly” 的频率不同。注意：它有时会被误用为“两年一次”，此时应使用 “biennial”。而 “yearly” 明确表示每年一次，不存在歧义。"
      }
    ]
  },
  {
    "word": "yearning",
    "pronunciation": "yur·ning",
    "concise_definition": "n. 渴望, 热望, 深切的向往",
    "forms": {
      "plural": "yearnings"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A deep, often emotional desire or longing for something, especially something unattainable or distant, such as love, home, or a past time.",
        "explanation_cn": "一种深刻而常常带有情感色彩的渴望，尤其针对那些难以企及或遥远的事物，如爱、家乡或往昔时光。",
        "example_en": "She felt a quiet yearning for the simplicity of her childhood summers.",
        "example_cn": "她心中涌起对童年夏日简朴生活的淡淡渴望。"
      },
      {
        "pos": "noun",
        "explanation_en": "A persistent and heartfelt emotional state characterized by nostalgia, hope, or unfulfilled desire, often expressed in art, music, or literature.",
        "explanation_cn": "一种持久而真挚的情感状态，表现为怀旧、希望或未实现的欲望，常在艺术、音乐或文学中被表达出来。",
        "example_en": "The song was filled with yearning, evoking the pain of lost love.",
        "example_cn": "这首歌充满了深切的渴望，唤起了失去爱情的痛楚。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "desire",
        "analysis": "“Desire” (欲望) 是一个更广泛、更中性的词，可指对任何事物的渴望，包括物质、权力或性，不一定带有情感深度或忧伤色彩。而 “yearning” 更强调情感上的强烈、温柔甚至忧郁的向往，常与失落或不可得相关。"
      },
      {
        "word_to_compare": "longing",
        "analysis": "“Longing” (思念/渴求) 与 “yearning” 几乎同义，常可互换，但 “longing” 更侧重于对某人或某地的思念，尤其在分离情境中；而 “yearning” 的情感范围更广，可指向抽象概念（如自由、意义）或过去时光，更具诗意和文学性。"
      },
      {
        "word_to_compare": "craving",
        "analysis": "“Craving” (强烈渴望) 通常指生理或成瘾性的冲动，如对食物、药物或某种感官体验的迫切需求，带有更直接、更本能的意味。而 “yearning” 是心理和情感层面的，更温和、持久，且常与精神满足相关。"
      }
    ]
  },
  {
    "word": "years",
    "pronunciation": "yirz",
    "concise_definition": "n. 年, 年份, 年龄",
    "forms": {
      "singular": "year"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A unit of time equal to 365 or 366 days, based on the Earth's orbit around the Sun, used to measure duration, age, or historical periods.",
        "explanation_cn": "一种时间单位，等于365或366天，以地球绕太阳公转周期为基础，用于衡量持续时间、年龄或历史时期。",
        "example_en": "She has been teaching for over twenty years.",
        "example_cn": "她已经教书二十多年了。"
      },
      {
        "pos": "noun",
        "explanation_en": "The age of a person or thing, often expressed in plural form to indicate a span of time lived or existed.",
        "explanation_cn": "指人或事物的年龄，常以复数形式表示其存在或生存的年限。",
        "example_en": "He looks younger than his years.",
        "example_cn": "他看起来比实际年龄年轻。"
      },
      {
        "pos": "noun",
        "explanation_en": "A specific calendar year or period marked by particular events, often used in phrases like 'the years of war' or 'the Roaring Twenties'.",
        "explanation_cn": "指特定的日历年或由重大事件标志的时期，常用于如‘战争年代’或‘咆哮的二十年代’等短语中。",
        "example_en": "The years following the revolution were marked by economic hardship.",
        "example_cn": "革命后的几年以经济困难为特征。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "decade",
        "analysis": "“Decade”（十年）是“year”的十倍单位，特指连续的十年时间段，常用于宏观历史或社会分析。而 “years” 是基础时间单位，可指任意数量的年份，更灵活、更常用。"
      },
      {
        "word_to_compare": "season",
        "analysis": "“Season”（季节）指一年中的四个自然阶段（春、夏、秋、冬），强调气候和自然变化，周期短且重复。而 “years” 指完整的时间跨度，用于衡量更长的持续时间或人生阶段，不涉及季节性循环。"
      },
      {
        "word_to_compare": "lifetime",
        "analysis": "“Lifetime”（一生）指从出生到死亡的整个时间段，具有唯一性和终结性，常用于强调人生全程。而 “years” 可指其中的任意部分，是可数、可分割的单位，不必然包含生命的全部。"
      }
    ]
  },
  {
    "word": "yeast",
    "pronunciation": "yest",
    "concise_definition": "n. 酵母, 酵母菌",
    "forms": {
      "plural": "yeasts"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A microscopic, single-celled fungus that ferments sugars to produce carbon dioxide and alcohol, used in baking to make bread rise and in brewing to produce alcoholic beverages.",
        "explanation_cn": "一种微小的单细胞真菌，能将糖类发酵产生二氧化碳和酒精，常用于烘焙中使面团膨胀，或用于酿酒中生产酒精饮料。",
        "example_en": "The recipe calls for one packet of active dry yeast to make the dough fluffy.",
        "example_cn": "这个食谱需要一包活性干酵母，使面团变得松软。"
      },
      {
        "pos": "noun",
        "explanation_en": "A thick, nutrient-rich sediment or residue left after fermentation, sometimes consumed as a dietary supplement for its high vitamin B content.",
        "explanation_cn": "发酵后残留的浓稠营养沉淀物，有时作为富含维生素B的膳食补充剂食用。",
        "example_en": "Nutritional yeast is popular among vegans as a cheese-like flavoring and source of B vitamins.",
        "example_cn": "营养酵母在素食者中很受欢迎，因其具有类似奶酪的风味并富含B族维生素。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "ferment",
        "analysis": "“Ferment” (发酵) 是一个动词，指糖类被微生物分解产生气体或酒精的化学过程，而 “yeast” 是执行这一过程的生物体本身。前者是过程，后者是主体。"
      },
      {
        "word_to_compare": "mold",
        "analysis": "“Mold” (霉菌) 是一种多细胞真菌，通常在食物表面形成可见的绒毛状菌丝，常导致腐败；而 “yeast” 是单细胞真菌，通常不可见，用于有益的发酵过程。两者虽同属真菌，但形态、功能和用途截然不同。"
      },
      {
        "word_to_compare": "leaven",
        "analysis": "“Leaven” (发酵剂) 是一个更广义的术语，泛指任何能使面团膨胀的物质，包括酵母、小苏打或酸性发酵剂。而 “yeast” 是其中一种具体的、生物性的发酵剂。因此，所有酵母都是发酵剂，但并非所有发酵剂都是酵母。"
      }
    ]
  },
  {
    "word": "yee",
    "pronunciation": "yee",
    "concise_definition": "interj. (口语) 哇！耶！",
    "forms": {
      "plural": "yees"
    },
    "definitions": [
      {
        "pos": "interjection",
        "explanation_en": "An exclamation used to express excitement, approval, or enthusiasm, often in informal or playful contexts, especially in youth culture or hip-hop slang.",
        "explanation_cn": "用于表达兴奋、赞同或热情的感叹词，常见于非正式场合、青年文化或嘻哈俚语中，带有活泼、夸张的语气。",
        "example_en": "Yee! We won the game!",
        "example_cn": "耶！我们赢了比赛！"
      },
      {
        "pos": "interjection",
        "explanation_en": "A stylized variant of 'yeah' or 'yes', used for rhythmic emphasis in music, dance, or social media trends, often to convey confidence or swagger.",
        "explanation_cn": "作为 'yeah' 或 'yes' 的风格化变体，用于音乐、舞蹈或社交媒体趋势中，通过节奏感增强语气，传达自信或酷炫的态度。",
        "example_en": "Yee, I just got the new sneakers — no cap!",
        "example_cn": "耶，我刚买了新球鞋——没骗你！"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "yeah",
        "analysis": "“Yeah” 是 “yes” 的非正式口语形式，语气中性，用于日常确认。而 “yee” 更具表演性和情绪张力，常用于强调节奏、情绪爆发或文化身份，带有更强的亚文化色彩。"
      },
      {
        "word_to_compare": "woo",
        "analysis": "“Woo” 是表达兴奋或欢呼的感叹词，常用于体育赛事或惊喜时刻，声音更开放、响亮。而 “yee” 更短促、尖锐，常用于说唱或网络语境，带有节奏感和个性化的表达风格。"
      },
      {
        "word_to_compare": "yay",
        "analysis": "“Yay” 是表达喜悦的儿童化或天真型欢呼词，语调上扬，常用于庆祝小成就。而 “yee” 更具成人化、街头感和潮流感，常与自信、炫耀或反叛情绪关联，语义更复杂。"
      }
    ]
  },
  {
    "word": "yeh",
    "pronunciation": "yeh",
    "concise_definition": "int. 是的, 对 (非正式口语表达)",
    "forms": {
      "variant_of": "yes"
    },
    "definitions": [
      {
        "pos": "interjection",
        "explanation_en": "An informal, colloquial variant of 'yes,' often used in casual speech to express agreement, affirmation, or acknowledgment, particularly in British and some regional English dialects.",
        "explanation_cn": "“yes”的非正式口语变体，常用于随意对话中表示同意、肯定或确认，尤其见于英国英语及某些地方方言。",
        "example_en": "Yeh, I'll be there at eight.",
        "example_cn": "是啊，我八点到。"
      },
      {
        "pos": "interjection",
        "explanation_en": "Used to convey a casual, sometimes hesitant or reluctant agreement, often with a drawn-out or soft pronunciation to reflect tone or mood.",
        "explanation_cn": "用于表达一种随意、有时犹豫或勉强的同意，常通过拖长或轻柔的发音来传达语气或情绪。",
        "example_en": "Yeh... I guess you're right.",
        "example_cn": "嗯……我想你是对的。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "yes",
        "analysis": "“Yes” 是标准、中性的肯定词，适用于所有语境，包括正式场合；而 “yeh” 是其非正式口语形式，多用于日常对话，带有地域或语气色彩，不适合书面语或正式交流。"
      },
      {
        "word_to_compare": "yeah",
        "analysis": "“Yeah” 是 “yeh” 最常见的美式英语拼写变体，发音和用法几乎完全相同，都属于非正式肯定语。两者区别主要在拼写习惯：英式英语更倾向 “yeh”，美式英语普遍使用 “yeah”。"
      },
      {
        "word_to_compare": "uh-huh",
        "analysis": "“Uh-huh” 是一种非语言性肯定回应，常以点头伴随，语气更含糊、被动，多用于倾听时的简短反馈；而 “yeh” 是明确的言语性肯定，带有主动认同的意味，语义更清晰。"
      }
    ]
  },
  {
    "word": "yell",
    "pronunciation": "yel",
    "concise_definition": "v. 大喊, 叫喊; n. 大喊声",
    "forms": {
      "third_person_singular": "yells",
      "past_tense": "yelled",
      "past_participle": "yelled",
      "present_participle": "yelling"
    },
    "definitions": [
      {
        "pos": "verb",
        "explanation_en": "To shout loudly, often due to strong emotion such as anger, fear, excitement, or to get someone's attention.",
        "explanation_cn": "大声喊叫，通常是因为强烈的情绪，如愤怒、恐惧、兴奋，或为了引起他人的注意。",
        "example_en": "She yelled at the driver who nearly hit her bicycle.",
        "example_cn": "她朝那名差点撞到她自行车的司机大喊。"
      },
      {
        "pos": "verb",
        "explanation_en": "To call out loudly in order to communicate over a distance or in a noisy environment.",
        "explanation_cn": "为了在远距离或嘈杂环境中进行沟通而大声呼喊。",
        "example_en": "The coach yelled instructions to the players from the sidelines.",
        "example_cn": "教练在场边大声向球员们发出指令。"
      },
      {
        "pos": "noun",
        "explanation_en": "A loud, sharp cry or shout, often expressing emotion or urgency.",
        "explanation_cn": "一声响亮、尖锐的喊叫，通常表达情绪或紧迫感。",
        "example_en": "A yell of delight came from the children as they saw the ice cream truck.",
        "example_cn": "孩子们看到冰淇淋车时发出了一声欢呼。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "shout",
        "analysis": "“Shout”（喊叫）与 “yell” 非常接近，常可互换，但 “shout” 更中性，可用于任何大声说话的情境，包括命令、提醒或传递信息；而 “yell” 更强调情绪的强烈性，常带有愤怒、恐惧或极度兴奋的色彩。"
      },
      {
        "word_to_compare": "scream",
        "analysis": "“Scream”（尖叫）通常指因极度恐惧、痛苦或惊喜而发出的高音调、刺耳的声音，比 “yell” 更具生理性和本能性，常伴随身体反应。而 “yell” 可以是可控的、有目的的喊叫，不一定伴随恐惧。"
      },
      {
        "word_to_compare": "cry",
        "analysis": "“Cry”（哭喊）主要指因悲伤、疼痛或情绪激动而发出的声音，常与流泪相关，语义更偏向情感宣泄；而 “yell” 更侧重音量和传播目的，不一定伴随情绪低落，甚至可以是兴奋的欢呼。"
      }
    ]
  },
  {
    "word": "yelled",
    "pronunciation": "yeld",
    "concise_definition": "v. 大叫, 喊叫, 呼喊",
    "forms": {
      "base_form": "yell",
      "third_person_singular": "yells",
      "past_tense": "yelled",
      "past_participle": "yelled",
      "present_participle": "yelling"
    },
    "definitions": [
      {
        "pos": "verb",
        "explanation_en": "To shout loudly, typically due to strong emotion such as anger, fear, excitement, or pain, often to be heard over distance or noise.",
        "explanation_cn": "因强烈情绪（如愤怒、恐惧、兴奋或疼痛）而大声喊叫，通常是为了在远距离或嘈杂环境中让人听见。",
        "example_en": "She yelled for help when she saw the fire.",
        "example_cn": "她看到火灾时大声呼救。"
      },
      {
        "pos": "verb",
        "explanation_en": "To call out loudly in order to attract attention, give a command, or express urgency.",
        "explanation_cn": "为了吸引注意、发出指令或表达紧迫感而大声呼叫。",
        "example_en": "The coach yelled at the players to run faster.",
        "example_cn": "教练大声命令球员们跑快点。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "shouted",
        "analysis": "“Shouted” 与 “yelled” 非常接近，常可互换，但 “shouted” 更中性，泛指任何大声说话的行为，不一定伴随强烈情绪；而 “yelled” 更强调情绪驱动的、尖锐或激动的喊叫，语气更强烈、更具情感色彩。"
      },
      {
        "word_to_compare": "screamed",
        "analysis": "“Screamed” (尖叫) 通常指因极度恐惧、痛苦或惊吓而发出的高音调、刺耳的叫声，比 “yelled” 更具生理性和本能性，常带有恐慌或崩溃的意味。而 “yelled” 可以是愤怒或兴奋的喊叫，音调不一定极高。"
      },
      {
        "word_to_compare": "called",
        "analysis": "“Called” (呼叫) 是最普通的表达，指一般性的喊话，音量可能不高，目的也较温和（如叫人过来），不带有强烈情绪或紧迫感。而 “yelled” 暗示音量大、情绪激烈，是 “called” 的强化形式。"
      }
    ]
  },
  {
    "word": "yelling",
    "pronunciation": "yel·ing",
    "concise_definition": "v. 大喊, 叫喊, 喊叫",
    "forms": {
      "base_form": "yell",
      "third_person_singular": "yells",
      "past_tense": "yelled",
      "past_participle": "yelled",
      "present_participle": "yelling"
    },
    "definitions": [
      {
        "pos": "verb",
        "explanation_en": "To shout loudly, often due to strong emotion such as anger, fear, excitement, or to get someone's attention.",
        "explanation_cn": "大声喊叫，通常是因为强烈的情绪，如愤怒、恐惧、兴奋，或为了引起他人的注意。",
        "example_en": "She was yelling at the driver for not stopping at the red light.",
        "example_cn": "她因为司机没有在红灯前停下而对他大喊大叫。"
      },
      {
        "pos": "verb",
        "explanation_en": "To call out loudly in order to communicate over a distance or in a noisy environment.",
        "explanation_cn": "为了在远距离或嘈杂环境中进行交流而大声呼喊。",
        "example_en": "The coach was yelling instructions to the players from the sidelines.",
        "example_cn": "教练在场边大声向球员们发出指令。"
      },
      {
        "pos": "verb",
        "explanation_en": "To express oneself in a loud, forceful, and often uncontrolled manner, sometimes implying a lack of restraint or civility.",
        "explanation_cn": "以响亮、强烈且常常缺乏克制的方式表达自己，有时暗示缺乏礼貌或自制力。",
        "example_en": "He wasn't just speaking—he was yelling, his voice shaking with rage.",
        "example_cn": "他不只是在说话——他是在大喊，声音因愤怒而颤抖。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "shouting",
        "analysis": "“Shouting”（喊叫）与 “yelling” 非常接近，常可互换，但 “shouting” 更中性，可指任何大声说话的行为，如在体育赛事中为球队加油；而 “yelling” 更常带有情绪色彩，如愤怒、恐惧或失控，语义上更强烈、更具攻击性或情绪化。"
      },
      {
        "word_to_compare": "screaming",
        "analysis": "“Screaming”（尖叫）指因极度恐惧、痛苦或兴奋而发出的高音调、尖锐的叫声，通常比 “yelling” 更高亢、更生理化，常伴随身体反应。而 “yelling” 更多是通过声带用力发出的高音量说话声，不一定尖锐。"
      },
      {
        "word_to_compare": "bellowing",
        "analysis": "“Bellowing”（吼叫）通常形容低沉、洪亮、如动物般的吼声，常用于描述体型较大者或动物的发声，如牛或愤怒的巨人。它强调声音的低频和震撼力，而 “yelling” 更偏向人类日常的高音量喊叫，音调更高、更直接。"
      }
    ]
  },
  {
    "word": "yellow",
    "pronunciation": "yel·ou",
    "concise_definition": "adj. 黄色的, 黄的; n. 黄色; v. 变黄",
    "forms": {
      "comparative": "yellower",
      "superlative": "yellowest"
    },
    "definitions": [
      {
        "pos": "adjective",
        "explanation_en": "Of, relating to, or having the color of the part of the visible spectrum between green and orange, typically associated with sunshine, lemons, or gold.",
        "explanation_cn": "指可见光谱中位于绿色与橙色之间的颜色，通常与阳光、柠檬或黄金相关联。",
        "example_en": "The children painted the sun bright yellow in their artwork.",
        "example_cn": "孩子们在画中把太阳涂成了明亮的黄色。"
      },
      {
        "pos": "noun",
        "explanation_en": "The color between green and orange in the visible spectrum; also used to refer to things of this color.",
        "explanation_cn": "可见光谱中位于绿色与橙色之间的颜色；也可泛指具有这种颜色的事物。",
        "example_en": "She wore a stunning yellow dress to the party.",
        "example_cn": "她穿了一条令人惊艳的黄色连衣裙去参加派对。"
      },
      {
        "pos": "verb",
        "explanation_en": "To become yellow in color, especially due to age, decay, or exposure to the elements.",
        "explanation_cn": "指因老化、腐烂或暴露于自然环境中而变黄。",
        "example_en": "The old pages of the book had yellowed over time.",
        "example_cn": "这本书的旧书页随着时间的推移已经泛黄。"
      },
      {
        "pos": "adjective",
        "explanation_en": "Used figuratively to describe someone who is cowardly or lacking courage, especially in American slang.",
        "explanation_cn": "比喻用法，形容人胆小、缺乏勇气（尤用于美式俚语）。",
        "example_en": "He was called yellow for refusing to stand up to the bully.",
        "example_cn": "他因为不敢对抗欺凌者而被骂胆小鬼。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "amber",
        "analysis": "“Amber”（琥珀色）是一种偏红或偏橙的深黄色，常用于描述宝石、树脂或黄昏时的光线，带有温暖、浓郁的质感。而 “yellow” 是更基础、更中性的颜色名称，涵盖从浅黄到深黄的广泛色域，不带有特定色调倾向。"
      },
      {
        "word_to_compare": "gold",
        "analysis": "“Gold”（金色）通常指带有金属光泽的明亮黄色，常与财富、奢华或神圣性相关联，具有反射性和光泽感。而 “yellow” 是纯粹的颜色描述，不隐含材质或价值含义，更偏向视觉属性。"
      },
      {
        "word_to_compare": "ochre",
        "analysis": "“Ochre”（赭石色）是一种天然土黄色，偏棕或偏红，常见于自然地貌和古典绘画颜料，具有质朴、沉稳的视觉效果。相比之下，”yellow“ 更通用、更明亮，常用于现代语境，而 ochre 更具艺术和地质语境的特殊性。"
      }
    ]
  },
  {
    "word": "yellowish",
    "pronunciation": "yel·ow·ish",
    "concise_definition": "adj. 微黄的, 略带黄色的",
    "forms": {
      "comparative": "yellowish",
      "superlative": "yellowish"
    },
    "definitions": [
      {
        "pos": "adjective",
        "explanation_en": "Having a slight or moderate degree of yellow color; not purely yellow but tinged with yellow.",
        "explanation_cn": "具有轻微或中等程度的黄色色调；并非纯黄色，而是略带黄色。",
        "example_en": "The old paper had a yellowish tint from years of exposure to light.",
        "example_cn": "这张旧纸因多年暴露在光线下而呈现出微黄的色调。"
      },
      {
        "pos": "adjective",
        "explanation_en": "Used to describe skin, objects, or substances that appear slightly discolored with a pale or dull yellow hue, often suggesting age, illness, or decay.",
        "explanation_cn": "用于描述皮肤、物体或物质呈现出略带苍白或暗淡的黄色，常暗示老化、疾病或腐烂。",
        "example_en": "His yellowish complexion made the doctor suspect a liver problem.",
        "example_cn": "他微黄的肤色让医生怀疑他有肝脏问题。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "yellow",
        "analysis": "“Yellow” (黄色的) 指明确、纯粹或鲜明的黄色，是标准色名；而 “yellowish” 表示颜色不纯，仅带有黄色的倾向或轻微影响，语义上更弱、更模糊。"
      },
      {
        "word_to_compare": "golden",
        "analysis": "“Golden” (金色的) 通常带有正面、明亮、温暖或珍贵的联想，如金色阳光或黄金；而 “yellowish” 常带有负面或中性含义，如发黄的墙壁或病态的肤色，缺乏光泽感。"
      },
      {
        "word_to_compare": "pale",
        "analysis": "“Pale” (苍白的) 指颜色浅淡、缺乏血色或饱和度，常用于描述肤色或光线；而 “yellowish” 特指带有黄色成分的浅淡，强调色相而非亮度。一个苍白的人可能偏白或偏灰，但一个微黄的人一定带有黄色调。"
      }
    ]
  },
  {
    "word": "yellowstone",
    "pronunciation": "ˈyeləʊˌstaɪn",
    "concise_definition": "n. 黄石（国家公园）, 黄石（河流/地区）",
    "forms": {
      "plural": "Yellowstones"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A national park located primarily in Wyoming, USA, renowned for its geothermal features, including geysers (notably Old Faithful), hot springs, mud pots, and diverse wildlife such as bison, grizzly bears, and wolves.",
        "explanation_cn": "位于美国怀俄明州（部分延伸至蒙大拿州和爱达荷州）的国家公园，以其地热景观闻名，包括间歇泉（如老忠实泉）、温泉、泥沸泉，以及丰富的野生动物，如美洲野牛、灰熊和狼。",
        "example_en": "Yellowstone National Park attracts millions of visitors each year who come to witness its natural wonders.",
        "example_cn": "黄石国家公园每年吸引数百万游客前来观赏其自然奇观。"
      },
      {
        "pos": "noun",
        "explanation_en": "The Yellowstone River, a major tributary of the Missouri River, which flows through Wyoming and Montana and gives the park its name due to the yellowish rocks along its banks.",
        "explanation_cn": "黄石河，密苏里河的主要支流之一，流经怀俄明州和蒙大拿州，因河岸上呈黄色的岩石而得名，国家公园也因此河命名。",
        "example_en": "The Yellowstone River winds through remote canyons and is a critical habitat for native fish species.",
        "example_cn": "黄石河蜿蜒穿过偏远的峡谷，是本地鱼类物种的重要栖息地。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "national_park",
        "analysis": "“National park”（国家公园）是一个通用术语，指由政府设立并保护的自然区域，强调法律地位和保护目的。而 “Yellowstone” 是一个专有名词，特指世界上第一个国家公园，具有历史和文化象征意义，是“国家公园”概念的原型。"
      },
      {
        "word_to_compare": "geothermal_area",
        "analysis": "“Geothermal area”（地热区域）是一个描述性术语，泛指任何具有地热活动（如温泉、喷气孔）的地区。Yellowstone 是一个典型的地热区域，但其规模、多样性和知名度远超一般地热区，是地热现象的全球标杆。"
      },
      {
        "word_to_compare": "wildlife_reserve",
        "analysis": "“Wildlife reserve”（野生动物保护区）侧重于保护动物栖息地，而 Yellowstone 不仅是保护区，更是一个集地质奇观、生态多样性、旅游和科研于一体的综合性国家公园。它的保护范围和功能远比单纯的野生动物保护区更广泛。"
      }
    ]
  },
  {
    "word": "yells",
    "pronunciation": "yelz",
    "concise_definition": "v. 大喊, 大叫, 喊叫",
    "forms": {
      "third_person_singular": "yells",
      "past_tense": "yelled",
      "past_participle": "yelled",
      "present_participle": "yelling",
      "plural": "yells"
    },
    "definitions": [
      {
        "pos": "verb",
        "explanation_en": "To shout loudly, often due to strong emotion such as anger, fear, excitement, or pain, in order to be heard over distance or noise.",
        "explanation_cn": "为了在远距离或嘈杂环境中被听见，因强烈情绪（如愤怒、恐惧、兴奋或痛苦）而大声喊叫。",
        "example_en": "She yelled for help when she saw the fire.",
        "example_cn": "她看到火灾时大声呼救。"
      },
      {
        "pos": "verb",
        "explanation_en": "To call out loudly in a commanding, warning, or enthusiastic tone, often to attract attention or express urgency.",
        "explanation_cn": "以命令、警告或热情的语气大声呼喊，通常是为了引起注意或表达紧迫感。",
        "example_en": "The coach yelled instructions to the players from the sidelines.",
        "example_cn": "教练在场边大声向球员们下达指令。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "shouts",
        "analysis": "“Shouts” 与 “yells” 非常接近，常可互换，但 “shout” 更中性，泛指任何大声说话的行为，不一定伴随强烈情绪；而 “yell” 更强调情绪驱动，通常带有激动、愤怒或恐慌的色彩，语气更激烈。"
      },
      {
        "word_to_compare": "screams",
        "analysis": "“Screams” (尖叫) 指因极度恐惧、痛苦或兴奋而发出的高音调、尖锐刺耳的声音，通常比 “yell” 更具生理性和本能性，音高更高、更不控制。而 “yell” 可以是中高音，更可控，常用于表达意图而非纯粹的生理反应。"
      },
      {
        "word_to_compare": "roars",
        "analysis": "“Roars” (咆哮) 通常用于形容动物（如狮子）或巨大声音（如引擎、风暴）发出的低沉、洪亮、震撼性的吼声，带有力量感和压迫感。而 “yell” 是人类发出的、音调相对较高的喊叫，更侧重于语言性或情绪性沟通。"
      }
    ]
  },
  {
    "word": "yelp",
    "pronunciation": "yelp",
    "concise_definition": "v. 尖叫, 哀鸣; n. 尖叫, 哀鸣声",
    "forms": {
      "third_person_singular": "yelps",
      "past_tense": "yelped",
      "past_participle": "yelped",
      "present_participle": "yelping"
    },
    "definitions": [
      {
        "pos": "verb",
        "explanation_en": "To make a short, high-pitched cry, typically due to pain, fear, or excitement, often used to describe the sound made by dogs or other animals.",
        "explanation_cn": "发出短促、高亢的叫声，通常因疼痛、恐惧或兴奋而发出，常用于描述狗或其他动物的叫声。",
        "example_en": "The dog yelped when it stepped on a thorn.",
        "example_cn": "狗踩到荆棘时发出了一声哀鸣。"
      },
      {
        "pos": "verb",
        "explanation_en": "To complain loudly or bitterly, often in a shrill or whining tone, especially when expressing dissatisfaction.",
        "explanation_cn": "大声或激烈地抱怨，常以尖锐或哀怨的语调表达不满。",
        "example_en": "She yelped about the poor service at the restaurant.",
        "example_cn": "她对餐厅糟糕的服务大加抱怨。"
      },
      {
        "pos": "noun",
        "explanation_en": "A short, high-pitched cry, especially one made by an animal in pain or distress.",
        "explanation_cn": "短促而高亢的叫声，尤指动物因疼痛或痛苦时发出的声音。",
        "example_en": "We heard a yelp from the backyard and rushed outside.",
        "example_cn": "我们听到后院传来一声哀鸣，立刻冲了出去。"
      },
      {
        "pos": "noun",
        "explanation_en": "A loud, shrill complaint or protest, often expressed in an emotional or exaggerated manner.",
        "explanation_cn": "一种尖锐、响亮的抱怨或抗议，常以情绪化或夸张的方式表达。",
        "example_en": "His yelp about the high rent got no sympathy from the landlord.",
        "example_cn": "他对房租高昂的抱怨并没有赢得房东的同情。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "howl",
        "analysis": "“Howl” (嚎叫) 指持续时间较长、音量更大、更悲怆或野性的叫声，常用于狼、狗在夜晚的长啸，带有强烈的情感色彩或仪式感。而 “yelp” 是短促、突然的尖叫，更强调瞬间的疼痛或惊吓，情感强度较低。"
      },
      {
        "word_to_compare": "shout",
        "analysis": "“Shout” (喊叫) 是人类发出的高声呼喊，通常为了引起注意、表达愤怒或命令，语境多为理性或有目的的交流。而 “yelp” 更偏向非理性、本能的反应，常用于动物或人在极度不适时的无意识发声。"
      },
      {
        "word_to_compare": "complain",
        "analysis": "“Complain” (抱怨) 是一个中性、通用的动词，指表达不满，语气可温和也可激烈，不带声音特征。而 “yelp” 作为动词时，不仅指抱怨，还隐含了尖锐、刺耳、情绪化甚至夸张的表达方式，带有强烈的听觉意象。"
      }
    ]
  },
  {
    "word": "yemen",
    "pronunciation": "yem·en",
    "concise_definition": "n. 也门（阿拉伯半岛西南部国家）",
    "forms": {
      "proper_noun": true
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A country located in southwestern Arabia, bordering Saudi Arabia and Oman, with a rich history dating back to ancient civilizations such as Saba and Himyar; it is known for its cultural heritage, mountainous terrain, and recent political instability.",
        "explanation_cn": "位于阿拉伯半岛西南部的国家，与沙特阿拉伯和阿曼接壤，拥有悠久的历史，可追溯至示巴和希木叶尔等古代文明；以其文化遗产、多山地形和近期的政治动荡而闻名。",
        "example_en": "Yemen has been affected by a prolonged civil conflict since 2014.",
        "example_cn": "自2014年以来，也门一直受到长期内战的影响。"
      },
      {
        "pos": "noun",
        "explanation_en": "Used in compound terms to refer to things originating from or associated with the country, such as Yemeni coffee, Yemeni architecture, or Yemeni diaspora.",
        "explanation_cn": "用于构成复合词，指源于或与该国相关的事物，如也门咖啡、也门建筑或也门侨民。",
        "example_en": "Yemeni coffee is prized for its rich, wine-like flavor and is among the oldest cultivated varieties in the world.",
        "example_cn": "也门咖啡以其浓郁如葡萄酒般的风味而备受推崇，是世界上栽培历史最悠久的咖啡品种之一。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "yemeni",
        "analysis": "“Yemeni” 是形容词或名词，用于描述与也门相关的人、物或文化（如 Yemeni people, Yemeni cuisine），而 “Yemen” 是专有名词，仅指该国家本身。两者不可互换，但常在语境中搭配使用。"
      },
      {
        "word_to_compare": "arabia",
        "analysis": "“Arabia” 指阿拉伯半岛这一地理区域，包括沙特阿拉伯、也门、阿曼、阿联酋等多个国家，是一个更广泛的地理概念。而 “Yemen” 是其中的一个主权国家，范围更具体。"
      },
      {
        "word_to_compare": "saudi arabia",
        "analysis": "“Saudi Arabia” 是也门的北部邻国，两者共享文化与语言背景，但政治体制、经济结构和国际关系截然不同。沙特是君主专制国家，经济以石油为主；也门则是发展中国家，长期面临贫困与冲突。"
      }
    ]
  },
  {
    "word": "yemeni",
    "pronunciation": "yem·uh·nee",
    "concise_definition": "adj. 也门的, n. 也门人",
    "forms": {
      "plural": "yemenis"
    },
    "definitions": [
      {
        "pos": "adjective",
        "explanation_en": "Relating to or originating from Yemen, a country in southwestern Arabia, including its culture, language, geography, or people.",
        "explanation_cn": "与也门有关的或源自也门的，包括其文化、语言、地理或人民。",
        "example_en": "Yemeni coffee is renowned for its rich, fruity flavor and aromatic profile.",
        "example_cn": "也门咖啡以其浓郁的果香和芳香特质而闻名。"
      },
      {
        "pos": "noun",
        "explanation_en": "A person who is from Yemen or holds Yemeni nationality; a native or citizen of Yemen.",
        "explanation_cn": "来自也门或拥有也门国籍的人；也门的原住民或公民。",
        "example_en": "Many Yemenis have sought refuge in neighboring countries due to the ongoing conflict.",
        "example_cn": "由于持续的冲突，许多也门人已前往邻国寻求庇护。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "arab",
        "analysis": "“Arab”（阿拉伯的/阿拉伯人）是一个更广泛的民族和语言群体术语，涵盖20多个阿拉伯国家，包括沙特阿拉伯、埃及、叙利亚等。而 “Yemeni” 是一个国家特定的术语，仅指来自也门的人或事物。所有也门人都是阿拉伯人，但并非所有阿拉伯人都是也门人。"
      },
      {
        "word_to_compare": "southwestern",
        "analysis": "“Southwestern”（西南部的）是一个地理方位形容词，描述位置，不涉及国籍或文化身份。例如，美国西南部（Southwestern United States）与也门无关。而 “Yemeni” 是一个具有明确政治和文化归属的专有形容词，特指也门国家。"
      },
      {
        "word_to_compare": "national",
        "analysis": "“National”（国家的）是一个通用词，可指任何国家的属性，如 “national anthem”（国歌）。“Yemeni” 是 “national” 的具体实例，专用于也门，具有唯一性和文化特异性，不能被 “national” 替代而不丢失具体指代。"
      }
    ]
  },
  {
    "word": "yen",
    "pronunciation": "yen",
    "concise_definition": "n. 日元, 强烈的渴望",
    "forms": {
      "plural": "yens"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "The official currency of Japan, subdivided into 100 sen (though sen coins are no longer in circulation).",
        "explanation_cn": "日本的官方货币，1日元等于100仙（仙币已不再流通）。",
        "example_en": "The exchange rate is 145 yen to the US dollar.",
        "example_cn": "汇率是145日元兑1美元。"
      },
      {
        "pos": "noun",
        "explanation_en": "A strong desire or craving for something, often used in the phrase 'to have a yen for'.",
        "explanation_cn": "对某物强烈的渴望或向往，常用于短语 'have a yen for'。",
        "example_en": "She has a yen for traveling to Japan and tasting authentic sushi.",
        "example_cn": "她非常渴望去日本品尝正宗的寿司。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "currency",
        "analysis": "“Currency”（货币）是泛指任何国家或地区使用的法定交换媒介，如美元、欧元等。而 “yen” 是特指日本的货币，属于“currency”的一种具体实例。前者是类别词，后者是专有名词。"
      },
      {
        "word_to_compare": "craving",
        "analysis": "“Craving”（强烈渴望）与 “yen” 在表示欲望时意义相近，但 “craving” 更常用于生理或心理上的迫切需求（如对食物、毒品的渴望），语气更强烈且多用于负面语境；而 “yen” 更口语化、轻快，常用于表达对体验、活动或事物的向往，语气较中性甚至积极。"
      },
      {
        "word_to_compare": "desire",
        "analysis": "“Desire”（欲望）是更正式、更广泛的词，涵盖从轻微偏好到强烈向往的多种程度；而 “yen” 是非正式用语，语义范围更窄，仅用于表达一种持久而强烈的偏好，且通常与具体事物（如食物、旅行）搭配使用，语用上更具生活化色彩。"
      }
    ]
  },
  {
    "word": "yep",
    "pronunciation": "yep",
    "concise_definition": "int. 是的, 对, 没错 (非正式)",
    "forms": {
      "variant": "yup"
    },
    "definitions": [
      {
        "pos": "interjection",
        "explanation_en": "An informal, casual way of saying 'yes' in spoken English, often used in friendly or relaxed contexts to express agreement or confirmation.",
        "explanation_cn": "英语口语中表示‘是的’的非正式、随意说法，常用于轻松、友好的语境中，表达同意或确认。",
        "example_en": "A: Want to grab coffee later? B: Yep, sounds great!",
        "example_cn": "A：待会儿去喝杯咖啡吗？B：嗯，好啊！"
      },
      {
        "pos": "interjection",
        "explanation_en": "Sometimes used to convey a sense of finality, resignation, or mild indifference, depending on tone and context.",
        "explanation_cn": "有时根据语调和语境，可传达一种决断、无奈或轻微的漠然情绪。",
        "example_en": "A: Are you sure this is the right way? B: Yep. (said with a sigh)",
        "example_cn": "A：你确定这是对的路吗？B：嗯。（叹气着说）"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "yes",
        "analysis": "“Yes” 是标准、中性的肯定回答，适用于所有正式和非正式场合。而 “yep” 是其非正式口语变体，语气更随意、亲切，常用于日常对话，不适合书面语或正式场合。"
      },
      {
        "word_to_compare": "yeah",
        "analysis": "“Yeah” 与 “yep” 都是非正式的 ‘yes’ 变体，但 “yeah” 更常见于美式口语，发音更松散，语气更随意甚至懒散；“yep” 则略显干脆、短促，有时带有更明确的确认感，语调上更显积极或干脆利落。"
      },
      {
        "word_to_compare": "uh-huh",
        "analysis": "“Uh-huh” 是一种语气词式的肯定回应，通常用于倾听时的轻微应答，不强调内容，仅表示在听或略表同意。而 “yep” 是更主动、明确的肯定，常用于回应问题或表达立场，语义更清晰。"
      }
    ]
  },
  {
    "word": "yer",
    "pronunciation": "yur",
    "concise_definition": "n. (非正式) 你的",
    "forms": {
      "standard_form": "your"
    },
    "definitions": [
      {
        "pos": "pronoun",
        "explanation_en": "A nonstandard, dialectal, or informal variant of 'your', used primarily in spoken English, especially in certain regional accents (e.g., Scottish, Northern English, or African American Vernacular English).",
        "explanation_cn": "“your”的非标准、方言或口语变体，主要用于口语英语中，常见于某些地区口音（如苏格兰、英格兰北部或非裔美国人白话英语）。",
        "example_en": "Yer mum’s gonna be mad if you don’t come home soon.",
        "example_cn": "如果你不快点回家，你妈会生气的。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "your",
        "analysis": "“Your” 是标准英语中所有格代词，用于正式和非正式语境，语法规范且广泛接受。而 “yer” 是其口语化、非标准的发音变体，通常出现在特定方言或非正式对话中，不应在书面语或正式场合使用。"
      },
      {
        "word_to_compare": "yours",
        "analysis": "“Yours” 是 “your” 的名词性物主代词形式，用于独立表示所属关系（如 “This book is yours”）。而 “yer” 仅是 “your” 的口语发音形式，不能替代 “yours” 的语法功能，两者在结构和用法上完全不同。"
      },
      {
        "word_to_compare": "you're",
        "analysis": "“You're” 是 “you are” 的缩写形式，属于动词短语，与表示所属关系的 “yer” 完全不同。尽管发音相似（尤其在快速口语中），但语义和语法功能无任何重叠，常被混淆但不可互换。"
      }
    ]
  },
  {
    "word": "yes",
    "pronunciation": "yes",
    "concise_definition": "adv. 是的, 对, 表示肯定",
    "forms": {
      "comparative": "",
      "superlative": ""
    },
    "definitions": [
      {
        "pos": "adverb",
        "explanation_en": "An affirmative response used to express agreement, confirmation, or acceptance of a statement, question, or proposal.",
        "explanation_cn": "用于表达对陈述、问题或提议的同意、确认或接受的肯定回答。",
        "example_en": "Do you want to go to the concert? Yes, I'd love to!",
        "example_cn": "你想去听音乐会吗？是的，我很想去！"
      },
      {
        "pos": "adverb",
        "explanation_en": "Used to emphasize or reinforce a statement, often in response to doubt or contradiction.",
        "explanation_cn": "用于强调或加强陈述，常用于回应怀疑或反驳。",
        "example_en": "I told you I was busy — yes, I really am!",
        "example_cn": "我跟你说过我很忙——是的，我真的忙！"
      },
      {
        "pos": "noun",
        "explanation_en": "An affirmative answer or vote; the expression of approval or consent.",
        "explanation_cn": "一种肯定的回答或投票；表示批准或同意的表达。",
        "example_en": "The motion passed with 12 yeses and 5 noes.",
        "example_cn": "该动议以12票赞成、5票反对获得通过。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "yeah",
        "analysis": "“Yeah” 是 “yes” 的非正式口语变体，语气更随意、轻松，常用于日常对话中。而 “yes” 更正式、庄重，适用于书面语、正式场合或强调时。两者语义相同，但语体层级不同。"
      },
      {
        "word_to_compare": "affirmative",
        "analysis": "“Affirmative” 是 “yes” 的正式或技术性同义词，多用于军事、法律、航空或投票等正式语境中，强调程序性确认。它不用于日常口语，而 “yes” 是通用且自然的表达。"
      },
      {
        "word_to_compare": "indeed",
        "analysis": "“Indeed” 表示加强肯定，常用于补充或强调前文，意为“确实”“的确”，比单纯的 “yes” 更具深度和语气重量。它通常不单独作为回答，而是作为句子的一部分，而 “yes” 可独立使用。"
      }
    ]
  },
  {
    "word": "yesterday",
    "pronunciation": "yest·er·day",
    "concise_definition": "n. 昨天, 前天; adv. 昨天",
    "forms": {
      "none": ""
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "The day immediately before today; the most recent completed day in the calendar sequence.",
        "explanation_cn": "指今天之前的那一天，即日历序列中最近已完成的一天。",
        "example_en": "I finished reading the book yesterday.",
        "example_cn": "我昨天读完了这本书。"
      },
      {
        "pos": "adverb",
        "explanation_en": "Used to indicate that an action or event occurred on the day before today.",
        "explanation_cn": "用于表示某个动作或事件发生在今天之前的一天。",
        "example_en": "She called me yesterday to apologize.",
        "example_cn": "她昨天打电话来道歉。"
      },
      {
        "pos": "noun",
        "explanation_en": "A figurative reference to a past time, often implying a time that is now gone or no longer relevant, especially in contrast to the present.",
        "explanation_cn": "比喻性地指过去的一个时期，常暗示那个时期已不复存在或与现在形成对比。",
        "example_en": "The technology of yesterday can't compete with today's innovations.",
        "example_cn": "昨天的技术无法与今天的创新相媲美。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "today",
        "analysis": "“Today” (今天) 指当前正在经历的这一天，与 “yesterday” 形成时间上的直接对立。前者强调当下，后者强调刚过去的过去。两者常用于对比现状与先前状态，如 “Today is different from yesterday.”"
      },
      {
        "word_to_compare": "tomorrow",
        "analysis": "“Tomorrow” (明天) 指即将到来的那一天，与 “yesterday” 构成时间轴上的两端：一个代表过去，一个代表未来。它们常被用来表达变化或期望，如 “What happened yesterday will shape tomorrow.”"
      },
      {
        "word_to_compare": "last night",
        "analysis": "“Last night” (昨晚) 仅指昨天夜晚这一具体时段，而 “yesterday” 指全天（从午夜到午夜）。前者是时间片段，后者是完整日期单位。例如：'I saw the movie last night'（昨晚）vs. 'I finished the project yesterday'（昨天一整天）。"
      }
    ]
  },
  {
    "word": "yet",
    "pronunciation": "yet",
    "concise_definition": "adv. 还, 尚; conj. 然而, 但是",
    "forms": {
      "comparative": "",
      "superlative": ""
    },
    "definitions": [
      {
        "pos": "adverb",
        "explanation_en": "Used in negative sentences or questions to indicate that something expected or desired has not happened up to the present time, often implying it may still happen in the future.",
        "explanation_cn": "用于否定句或疑问句中，表示某事到目前为止尚未发生，但可能在未来发生。",
        "example_en": "She hasn't finished her homework yet.",
        "example_cn": "她还没有完成作业。"
      },
      {
        "pos": "adverb",
        "explanation_en": "Used in affirmative sentences to emphasize that something continues to be true or remains unchanged, often with a sense of surprise or contrast.",
        "explanation_cn": "用于肯定句中，强调某事持续成立或未改变，常带有惊讶或对比的语气。",
        "example_en": "He is yet the most talented musician in the band.",
        "example_cn": "他仍然是乐队中最有才华的音乐家。"
      },
      {
        "pos": "conjunction",
        "explanation_en": "Used to introduce a contrasting idea that follows a previous statement, similar to 'but' or 'however', often with a stronger sense of unexpectedness or contrast.",
        "explanation_cn": "用于引出与前文形成对比的观点，相当于 'but' 或 'however'，但常带有更强的意外或对立意味。",
        "example_en": "The plan was risky, yet it succeeded beyond expectations.",
        "example_cn": "这个计划有风险，然而却超出了预期地成功了。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "still",
        "analysis": "“Still” (仍然) 强调某种状态持续存在，常用于中性或肯定语境，不隐含期待或转折。例如：He is still sleeping. 而 “yet” 在否定句中强调‘尚未发生但期待发生’，在肯定句中则带有意外或强调的语气，语义更复杂。"
      },
      {
        "word_to_compare": "but",
        "analysis": "“But” (但是) 是最常用的转折连词，语气直接、中性，用于连接两个对立的分句。而 “yet” 作为连词时，语气更书面、更强烈，常暗示结果出乎意料或具有讽刺意味，如：It was raining, yet they went out. 比用 'but' 更具文学性。"
      },
      {
        "word_to_compare": "already",
        "analysis": "“Already” (已经) 表示某事发生得比预期更早，与 “yet” 在时间语义上形成鲜明对比。例如：Have you finished? — I’ve already finished. / I haven’t finished yet. 两者常出现在同一语境中，互为反义。"
      }
    ]
  },
  {
    "word": "yi",
    "pronunciation": "ee",
    "concise_definition": "n. 一, 唯一, 一件; v. 以...为衣, 穿上",
    "forms": {
      "plural": "yis"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A unit of one; the number one, often used in Chinese contexts to denote singularity or unity, especially in compound terms or proper names.",
        "explanation_cn": "表示‘一’的单位，常用于中文语境中强调单一性或统一性，尤其在复合词或专有名词中。",
        "example_en": "In Chinese philosophy, 'yi' represents the concept of oneness or the undivided whole.",
        "example_cn": "在中国哲学中，‘yi’代表‘一’的概念，即不可分割的整体。"
      },
      {
        "pos": "noun",
        "explanation_en": "A garment or clothing item, particularly in historical or poetic usage, derived from the Chinese character 衣 (yī), meaning 'clothing'.",
        "explanation_cn": "指衣物，尤其在历史或诗意语境中，源自汉字‘衣’（yī），意为‘衣服’。",
        "example_en": "The ancient poet wore a simple yi of linen, symbolizing humility.",
        "example_cn": "那位古代诗人穿着一件简单的麻布衣，象征着谦逊。"
      },
      {
        "pos": "verb",
        "explanation_en": "To clothe or dress oneself in something, especially in a symbolic or ritualistic context, derived from the Chinese verb 衣 (yī), meaning 'to wear'.",
        "explanation_cn": "指穿上某物，尤其在象征性或仪式性语境中，源自汉语动词‘衣’（yī），意为‘穿’。",
        "example_en": "The emperor yi'd himself in golden robes before the ceremony.",
        "example_cn": "皇帝在仪式前穿上了金色的礼服。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "one",
        "analysis": "“One” 是英语中表示数字1的通用词，强调数量；而 “yi” 作为外来词，常保留其在中文文化中的哲学或象征意义，如‘统一’、‘本源’，不单纯表示计数。"
      },
      {
        "word_to_compare": "garment",
        "analysis": "“Garment” 是英语中对衣物的正式统称，中性且通用；而 “yi” 作为汉语借词，带有文化特异性，常用于学术、文学或东方哲学语境中，强调传统服饰或象征意义，而非普通衣物。"
      },
      {
        "word_to_compare": "don",
        "analysis": "“Don” 是英语中表示‘穿上（衣服）’的正式动词，如 don a coat；而 “yi” 作为动词使用时，更强调文化仪式性或古典语境中的着装行为，语义更厚重，常用于描述古代或象征性着装，而非日常动作。"
      }
    ]
  },
  {
    "word": "yield",
    "pronunciation": "yēld",
    "concise_definition": "v. 产生, 屈服, 让步; n. 产量, 收益",
    "forms": {
      "third_person_singular": "yields",
      "past_tense": "yielded",
      "past_participle": "yielded",
      "present_participle": "yielding"
    },
    "definitions": [
      {
        "pos": "verb",
        "explanation_en": "To produce or provide a result, especially a useful or measurable output such as profit, crop, or energy.",
        "explanation_cn": "指产生或提供某种结果，尤其是可衡量的有用产出，如利润、农作物或能源。",
        "example_en": "This orchard yields about 500 bushels of apples each year.",
        "example_cn": "这个果园每年产约500蒲式耳苹果。"
      },
      {
        "pos": "verb",
        "explanation_en": "To give way under pressure, force, or persuasion; to surrender or concede, often reluctantly.",
        "explanation_cn": "指在压力、力量或劝说下让步、屈服或妥协，常带有不情愿的意味。",
        "example_en": "After hours of negotiation, the company finally yielded to the workers' demands.",
        "example_cn": "经过数小时的谈判，公司最终向工人的要求让步了。"
      },
      {
        "pos": "verb",
        "explanation_en": "To give precedence or right of way, especially in traffic or formal settings.",
        "explanation_cn": "指在交通或正式场合中让出优先权或通行权。",
        "example_en": "Drivers must yield to pedestrians at crosswalks.",
        "example_cn": "司机在斑马线前必须礼让行人。"
      },
      {
        "pos": "noun",
        "explanation_en": "The amount of product or return generated from a process, investment, or land, often expressed as a rate or quantity.",
        "explanation_cn": "指从某一过程、投资或土地中产生的产品或回报量，通常以比率或数量表示。",
        "example_en": "The bond has a high yield of 6% annually.",
        "example_cn": "这只债券的年收益率为6%。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "produce",
        "analysis": "“Produce” (生产) 强调制造或生成某物的过程，常用于工业、农业或艺术创作，语气中性。而 “yield” 更侧重于结果的产出量或回报，常用于衡量效率或收益，如土地产量、投资回报，带有量化和结果导向的意味。"
      },
      {
        "word_to_compare": "surrender",
        "analysis": "“Surrender” (投降) 指完全放弃抵抗或控制权，语气强烈且常含失败或被迫的意味。而 “yield” 在表示让步时语气较轻，可能是策略性或暂时的妥协，不一定意味着彻底失败，如交通让行或谈判让步。"
      },
      {
        "word_to_compare": "return",
        "analysis": "“Return” (回报) 通常用于金融或投资语境，指投入后获得的收益，强调收支关系。而 “yield” 作为名词时虽也用于金融，但更广泛地用于农业、工程等领域，泛指任何过程的产出，语义范围更广。"
      }
    ]
  },
  {
    "word": "yielded",
    "pronunciation": "yeehld",
    "concise_definition": "v. 产生, 提供, 让步, 屈服",
    "forms": {
      "base_form": "yield",
      "third_person_singular": "yields",
      "past_tense": "yielded",
      "past_participle": "yielded",
      "present_participle": "yielding"
    },
    "definitions": [
      {
        "pos": "verb",
        "explanation_en": "To produce or provide something, especially as a result of effort, growth, or natural processes; often used in contexts of output, harvest, or returns.",
        "explanation_cn": "指通过努力、生长或自然过程产生或提供某种结果，常用于描述产出、收成或回报。",
        "example_en": "The orchard yielded a record harvest of apples this year.",
        "example_cn": "今年这个果园收获了创纪录的苹果产量。"
      },
      {
        "pos": "verb",
        "explanation_en": "To give way or surrender to pressure, force, or demands, often reluctantly; to concede or relinquish control or position.",
        "explanation_cn": "指在压力、力量或要求下让步或屈服，通常带有不情愿的意味；指放弃控制权或立场。",
        "example_en": "After hours of negotiation, the company yielded to the workers' demands for higher wages.",
        "example_cn": "经过数小时的谈判，公司最终向工人提高工资的要求让步了。"
      },
      {
        "pos": "verb",
        "explanation_en": "To give precedence or right of way, especially in traffic or formal settings; to defer to another’s right or claim.",
        "explanation_cn": "指在交通或正式场合中让出优先权；指让位于他人的权利或主张。",
        "example_en": "The driver yielded to the pedestrian at the crosswalk.",
        "example_cn": "司机在斑马线前让行给了行人。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "produce",
        "analysis": "“Produce” (生产) 更强调制造或生成的过程，常用于工业、农业或艺术创作，语气中性，不包含让步或屈服的含义。而 “yielded” 除了表示产出外，还常隐含被动性、结果性或受外界影响的特性，如土地“yield”收成，或一方“yield”于压力。"
      },
      {
        "word_to_compare": "surrender",
        "analysis": "“Surrender” (投降) 意义更强烈，通常指在对抗或冲突中完全放弃抵抗，带有失败或被征服的负面色彩。而 “yielded” 的让步含义更温和，可能是策略性、暂时性的退让，不一定意味着彻底失败。"
      },
      {
        "word_to_compare": "concede",
        "analysis": "“Concede” (承认/让步) 更侧重于在争论或竞争中正式承认对方的立场或权利，常用于政治或辩论语境。而 “yielded” 更强调行为上的让出或物理上的退让，如让路、让出控制权，语义范围更广。"
      }
    ]
  },
  {
    "word": "yielding",
    "pronunciation": "yeehld·iŋ",
    "concise_definition": "adj. 顺从的, 易屈服的, 有弹性的",
    "forms": {
      "base_form": "yield",
      "comparative": "more yielding",
      "superlative": "most yielding"
    },
    "definitions": [
      {
        "pos": "adjective",
        "explanation_en": "Willing to give in to the demands, wishes, or opinions of others; not stubborn or rigid in attitude or behavior.",
        "explanation_cn": "愿意顺从他人的要求、愿望或意见；态度或行为上不固执、不僵硬。",
        "example_en": "She was a yielding parent, always accommodating her children's requests.",
        "example_cn": "她是一位顺从的父母，总是满足孩子们的要求。"
      },
      {
        "pos": "adjective",
        "explanation_en": "Capable of bending or deforming under pressure without breaking; flexible or pliable in physical properties.",
        "explanation_cn": "在受压时能够弯曲或变形而不破裂；物理特性上具有柔韧性或可塑性。",
        "example_en": "The yielding nature of the foam made it ideal for cushioning delicate items.",
        "example_cn": "这种泡沫的柔韧性使其成为包装易碎物品的理想材料。"
      },
      {
        "pos": "adjective",
        "explanation_en": "Producing or giving forth something, especially in the context of crops, results, or returns.",
        "explanation_cn": "产生或提供某种东西，尤其指农作物、成果或回报。",
        "example_en": "The yielding soil produced an abundant harvest this year.",
        "example_cn": "这片肥沃的土地今年收获了丰富的作物。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "compliant",
        "analysis": "“Compliant”（顺从的）强调遵守规则、指令或外部要求，常带有被动服从的意味，有时隐含缺乏主见。而 “yielding” 更侧重于性格上的温和与愿意让步，可能出于善意或体贴，语义更中性甚至积极。"
      },
      {
        "word_to_compare": "flexible",
        "analysis": "“Flexible”（灵活的）通常用于描述适应变化的能力，强调适应性与变通性，可用于抽象概念（如计划、思维）或具体物体。而 “yielding” 在描述物体时更强调物理上的柔软与可变形性，在描述人时则更强调情感或意志上的让步，语义范围更窄但更具体。"
      },
      {
        "word_to_compare": "productive",
        "analysis": "“Productive”（多产的）仅适用于 “yielding” 的第三种含义（产生成果），但侧重于效率和产出量，常用于经济、农业或工作场景。而 “yielding” 在此语境下更强调结果的自然生成或提供，不必然包含效率或数量的含义。"
      }
    ]
  },
  {
    "word": "yields",
    "pronunciation": "yēldz",
    "concise_definition": "v. 产生, 提供, 让步, 产出; n. 产量, 收益",
    "forms": {
      "third_person_singular": "yields",
      "past_tense": "yielded",
      "past_participle": "yielded",
      "present_participle": "yielding"
    },
    "definitions": [
      {
        "pos": "verb",
        "explanation_en": "To produce or provide something, especially as a result of effort, natural processes, or investment (e.g., crops, profits, or information).",
        "explanation_cn": "指通过努力、自然过程或投资而产生或提供某种结果，如农作物、利润或信息。",
        "example_en": "The orchard yields over 10,000 apples each season.",
        "example_cn": "这个果园每个季节能产出超过一万颗苹果。"
      },
      {
        "pos": "verb",
        "explanation_en": "To give way or surrender to pressure, demand, or authority, often reluctantly or under compulsion.",
        "explanation_cn": "指在压力、要求或权威面前让步或退让，通常带有不情愿或被迫的意味。",
        "example_en": "After hours of negotiation, the company finally yielded to the workers' demands.",
        "example_cn": "经过数小时的谈判，公司最终向工人的要求让步了。"
      },
      {
        "pos": "verb",
        "explanation_en": "To give up one's right, claim, or position to another, especially in a formal or legal context.",
        "explanation_cn": "指在正式或法律语境中将自身的权利、主张或职位让与他人。",
        "example_en": "He yielded his seat on the board to a more experienced director.",
        "example_cn": "他将董事会席位让给了更有经验的董事。"
      },
      {
        "pos": "noun",
        "explanation_en": "The amount of product, profit, or return generated from an investment, crop, or process over a specific period.",
        "explanation_cn": "指在特定时期内从投资、农作物或过程中所产生的产品、利润或回报数量。",
        "example_en": "The bond has a high yield of 5.2% annually.",
        "example_cn": "这只债券的年收益率高达5.2%。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "produces",
        "analysis": "“Produces” (生产) 更强调制造或生成的过程，常用于工业、农业或艺术创作中，语气中性且直接。而 “yields” 更侧重于结果或回报，常用于描述投入后的产出效益，带有更强的经济或功能性含义，如投资回报或作物收成。"
      },
      {
        "word_to_compare": "gives",
        "analysis": "“Gives” (给予) 是一个通用词，泛指任何形式的给予，可以是物质、情感或抽象事物，语义广泛但不够精确。而 “yields” 在表示“让步”或“产出”时更具语境限定性，常用于正式、技术或经济语境，强调结果的必然性或可衡量性。"
      },
      {
        "word_to_compare": "returns",
        "analysis": "“Returns” (回报) 与 “yields” 在金融语境中常可互换，但 “returns” 更强调收益的返还性质，常用于投资分析中计算净收益；而 “yields” 更侧重于周期性或持续性的产出率，如债券收益率、土地亩产，更常用于描述比率或效率。"
      }
    ]
  },
  {
    "word": "yikes",
    "pronunciation": "yīks",
    "concise_definition": "interj. 哎呀！（表示惊讶、恐惧或不安）",
    "forms": {
      "no_plural_or_conjugation": true
    },
    "definitions": [
      {
        "pos": "interjection",
        "explanation_en": "An exclamation used to express sudden surprise, alarm, or mild fear, often in response to something unexpected, unpleasant, or slightly dangerous.",
        "explanation_cn": "用于表达突然的惊讶、警觉或轻微的恐惧，通常是对某种意外、不愉快或略带危险的事物的反应。",
        "example_en": "Yikes! I didn't realize the stairs were so steep!",
        "example_cn": "哎呀！我没意识到楼梯这么陡！"
      },
      {
        "pos": "interjection",
        "explanation_en": "A casual, often humorous or ironic way to acknowledge something awkward, embarrassing, or socially uncomfortable.",
        "explanation_cn": "一种随意、常带幽默或讽刺意味的表达方式，用于承认某种尴尬、难堪或社交上令人不适的情况。",
        "example_en": "Yikes, I just sent that email to my boss instead of my friend.",
        "example_cn": "哎呀，我刚刚把邮件发给老板了，而不是朋友。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "oh no",
        "analysis": "“Oh no” 更直接地表达担忧或灾难即将发生的感觉，语气更严肃，常用于真实危机情境。而 “yikes” 更轻快、口语化，常用于轻微惊吓或尴尬场合，带有一定幽默感。"
      },
      {
        "word_to_compare": "wow",
        "analysis": "“Wow” 通常表达正面或中性的惊叹，如对美景、成就或规模的赞叹。而 “yikes” 几乎总是带有负面或不安的情绪色彩，表示不适或警觉，两者情感倾向相反。"
      },
      {
        "word_to_compare": "uh-oh",
        "analysis": "“Uh-oh” 专门用于意识到自己或他人即将或已经犯错时的轻微恐慌，强调“坏事要发生了”的预感。而 “yikes” 更广泛，可用于任何令人惊吓或不适的瞬间，不一定涉及错误。"
      }
    ]
  },
  {
    "word": "yin",
    "pronunciation": "yin",
    "concise_definition": "n. 阴, 阴性, 阴面",
    "forms": {
      "plural": "yins"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "In Chinese philosophy, the passive, dark, feminine, or receptive principle in nature, often represented by the dark side of the taijitu (yin-yang symbol), and associated with qualities such as coolness, stillness, and introspection.",
        "explanation_cn": "在中国哲学中，指自然界中消极、黑暗、阴性或接纳的原理，常以太极图的暗侧表示，与凉爽、静止、内省等特质相关联。",
        "example_en": "The balance of yin and yang is essential to traditional Chinese medicine.",
        "example_cn": "阴阳平衡是中医的根本原则。"
      },
      {
        "pos": "noun",
        "explanation_en": "A symbol or representation of the feminine, passive, or inward aspects of existence, often contrasted with yang in art, literature, and spiritual practices.",
        "explanation_cn": "指存在中女性化、被动或内向特质的象征，常在艺术、文学和精神实践中与阳相对比。",
        "example_en": "Her calm demeanor and quiet strength embodied the essence of yin.",
        "example_cn": "她平静的举止和内敛的力量体现了阴的精髓。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "yang",
        "analysis": "“Yang” (阳) 是与 “yin” 相对的哲学概念，代表主动、光明、阳性、外向的自然力量，如热、动、刚。两者构成互补对立的统一体，缺一不可。yin 强调收敛与容纳，yang 强调发散与创造。"
      },
      {
        "word_to_compare": "feminine",
        "analysis": "“Feminine” (女性的) 是一个社会文化概念，泛指与女性相关的特质，如温柔、敏感、关怀等。虽然 yin 常被用来象征女性特质，但它是更深层的宇宙哲学范畴，不局限于性别，而 “feminine” 更偏向社会建构和心理层面。"
      },
      {
        "word_to_compare": "shadow",
        "analysis": "“Shadow” (阴影) 在心理学中指人格中被压抑或忽视的部分，常带有负面含义。而 “yin” 并非负面，而是宇宙中不可或缺的平衡力量，具有中性甚至神圣的内涵。yin 是结构性的哲学范畴，shadow 是个体心理的隐喻。"
      }
    ]
  },
  {
    "word": "ying",
    "pronunciation": "ying",
    "concise_definition": "n. 阴（中国哲学中的对立概念）",
    "forms": {
      "plural": "yings"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "In Chinese philosophy, the passive, receptive, dark, or feminine principle in the dualistic concept of yin and yang, representing qualities such as coolness, stillness, introspection, and darkness.",
        "explanation_cn": "在中国哲学中，阴阳二元概念中的阴性原则，代表被动、接纳、黑暗或女性特质，如凉爽、静止、内省和黑暗。",
        "example_en": "Yin represents the moon, water, and the earth, while yang represents the sun, fire, and the sky.",
        "example_cn": "阴代表月亮、水和大地，而阳代表太阳、火和天空。"
      },
      {
        "pos": "noun",
        "explanation_en": "In traditional Chinese medicine and martial arts, yin refers to the internal, nourishing, and calming aspects of the body or energy flow, often associated with rest and conservation.",
        "explanation_cn": "在传统中医和武术中，阴指身体或能量流动中内在的、滋养的、平静的方面，常与休息和能量保存相关联。",
        "example_en": "To restore balance, the practitioner focused on increasing yin energy through meditation and cooling foods.",
        "example_cn": "为了恢复平衡，练习者通过冥想和食用寒性食物来增强阴气。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "yang",
        "analysis": "“Yang”（阳）是“yin”（阴）的对立面，代表主动、明亮、温暖和外向的特质。两者共同构成动态平衡的哲学体系，缺一不可。yin 强调内敛与静止，yang 强调外显与运动。"
      },
      {
        "word_to_compare": "darkness",
        "analysis": "“Darkness”（黑暗）是一个物理或视觉上的概念，仅描述缺乏光线的状态。而 “yin” 是一个哲学和能量层面的概念，黑暗只是其象征之一，它还包含静止、柔顺、滋养等多重含义，远比单纯的黑暗更丰富。"
      },
      {
        "word_to_compare": "passivity",
        "analysis": "“Passivity”（被动性）是一个心理学或行为学术语，指缺乏主动行动的倾向。而 “yin” 是一个文化与宇宙观中的根本范畴，被动性只是其表现之一，它还蕴含着生命力、滋养力和转化力，具有积极的哲学意义。"
      }
    ]
  },
  {
    "word": "ymca",
    "pronunciation": "ˈɪm.kə",
    "concise_definition": "n. 基督教青年会",
    "forms": {
      "plural": "ymcas"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A worldwide nonprofit organization founded in 1844 in London, originally established to provide moral, spiritual, and physical development for young men through religious instruction, recreational activities, and social services.",
        "explanation_cn": "一个成立于1844年伦敦的全球性非营利组织，最初旨在通过宗教教育、娱乐活动和社会服务，促进青年男子的道德、精神和身体发展。",
        "example_en": "Many young people join the YMCA to use its gym, swim in the pool, and attend community events.",
        "example_cn": "许多年轻人加入基督教青年会，以使用其健身房、游泳池并参加社区活动。"
      },
      {
        "pos": "noun",
        "explanation_en": "A cultural symbol in the United States and other countries representing affordable fitness, youth programs, and inclusive community spaces, often associated with the popular song 'YMCA' by the Village People.",
        "explanation_cn": "在美国及其他国家，它作为一种文化象征，代表了负担得起的健身设施、青年项目和包容性的社区空间，常与乡村骑士乐队的流行歌曲《YMCA》相关联。",
        "example_en": "The YMCA in our town offers after-school programs for children and senior fitness classes.",
        "example_cn": "我们镇上的基督教青年会为儿童提供课后项目，并为老年人开设健身课程。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "youth center",
        "analysis": "“Youth center”（青年中心）是一个泛指为青少年提供活动空间的场所，可能由政府、社区或非宗教组织运营，不包含宗教或道德教育成分。而 “YMCA” 是一个具有明确基督教背景和全球组织体系的特定机构，其服务范围更广，包括住宿、健身、教育和社区服务。"
      },
      {
        "word_to_compare": "church",
        "analysis": "“Church”（教堂）是进行宗教礼拜和信仰实践的场所，核心功能是宗教崇拜。而 “YMCA” 虽起源于基督教，但现代机构已高度世俗化，主要功能是提供健身、教育和社交服务，宗教活动不再是其主要或强制性内容。"
      },
      {
        "word_to_compare": "community center",
        "analysis": "“Community center”（社区中心）是一个中性术语，泛指为当地居民提供各类服务的公共设施，如图书馆、会议室、活动室等，通常无宗教或特定组织背景。而 “YMCA” 是一个有明确历史、品牌和全球网络的特定组织，其设施和服务具有统一标准和品牌标识。"
      }
    ]
  },
  {
    "word": "yo",
    "pronunciation": "yoh",
    "concise_definition": "interj. 嘿, 喂 (用于引起注意)",
    "forms": {
      "plural": "yos"
    },
    "definitions": [
      {
        "pos": "interjection",
        "explanation_en": "An informal exclamation used to get someone's attention, often in casual or urban speech; can express surprise, greeting, or a call to action.",
        "explanation_cn": "一种非正式的感叹词，用于在随意或都市口语中引起他人注意，可表达惊讶、打招呼或发出行动号召。",
        "example_en": "Yo, can you pass me the salt?",
        "example_cn": "嘿，你能把盐递给我吗？"
      },
      {
        "pos": "interjection",
        "explanation_en": "A greeting or casual salutation, especially among friends or in hip-hop culture, equivalent to 'hey' or 'hello'.",
        "explanation_cn": "一种非正式的问候语，尤其在朋友之间或嘻哈文化中使用，相当于‘嘿’或‘你好’。",
        "example_en": "Yo, what’s up? Long time no see!",
        "example_cn": "嘿，最近怎么样？好久不见！"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "hey",
        "analysis": "“Hey” 是更通用、中性的打招呼用语，适用于大多数非正式场合，语气相对平和。而 “yo” 更具街头感和年轻化色彩，常带有更强的随意性或文化认同感，尤其在特定社群中使用频率更高。"
      },
      {
        "word_to_compare": "hi",
        "analysis": "“Hi” 是标准的、礼貌的问候语，适用于广泛语境，语气中性且无地域或文化限制。相比之下， “yo” 更口语化、非正式，甚至可能被视为粗鲁，若在正式场合使用会显得不合时宜。"
      },
      {
        "word_to_compare": "alright",
        "analysis": "“Alright” 通常作为陈述句或过渡语使用，表示认可或确认（如 “Alright, let’s go”），而非直接用于吸引注意。而 “yo” 的核心功能是发起互动，具有明确的召唤性质，语义功能更接近 “hey” 而非 “alright”。"
      }
    ]
  },
  {
    "word": "yoda",
    "pronunciation": "yoh·duh",
    "concise_definition": "n. 尤达（《星球大战》中的绝地大师），引申为智慧深邃、言辞简练的长者",
    "forms": {
      "plural": "yodas"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A fictional character from the Star Wars universe, a wise and ancient Jedi Master known for his unique speech pattern, deep philosophical insight, and mastery of the Force. Often used as a cultural reference to denote a wise, enigmatic mentor.",
        "explanation_cn": "《星球大战》宇宙中的虚构角色，一位智慧而年长的绝地大师，以其独特的语序、深刻的哲学洞见和对原力的精通而闻名。常被用作文化隐喻，指代一位睿智、神秘的导师。",
        "example_en": "When I was stuck on my project, my grandfather gave me advice like Yoda: 'Do or do not, there is no try.'",
        "example_cn": "当我卡在项目上时，我祖父给了我尤达式的建议：‘做或不做，没有尝试这一说。’"
      },
      {
        "pos": "noun",
        "explanation_en": "A person or thing that embodies profound wisdom delivered in cryptic, inverted, or minimalist language, often used humorously or respectfully to describe someone whose advice seems oddly structured but deeply insightful.",
        "explanation_cn": "指以神秘、倒装或极简语言传达深刻智慧的人或事物，常用于幽默或尊敬地形容那些言辞古怪却极具洞察力的建议者。",
        "example_en": "My old philosophy professor is a real Yoda—his lectures sound like riddles, but they always reveal the truth.",
        "example_cn": "我那位老哲学教授真是个尤达——他的讲座听起来像谜语，却总能揭示真理。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "sage",
        "analysis": "“Sage”（智者）泛指具有深厚智慧和经验的长者，强调其德行与洞察力，语言通常庄重、直接。而 “Yoda” 更强调其语言风格的奇特（如倒装句）和神秘感，常带有文化戏谑或流行语色彩，不一定是传统意义上的德高望重者。"
      },
      {
        "word_to_compare": "guru",
        "analysis": "“Guru”（导师/大师）源自印度文化，指在某一领域（如灵性、技术）具有权威指导能力的人，通常被追随者视为知识来源。它更侧重专业权威性，而 “Yoda” 则更强调其语义结构的反常与哲理的隐晦性，常用于非正式语境。"
      },
      {
        "word_to_compare": "oracle",
        "analysis": "“Oracle”（神谕者）源自古希腊，指能传达神意、预言未来的神秘人物，其话语往往晦涩难解，需人解读。与 “Yoda” 相似的是其语言的模糊性，但 “oracle” 更具宗教或宿命论色彩，而 “Yoda” 是现代流行文化中拟人化的智慧象征，更贴近日常幽默使用。"
      }
    ]
  },
  {
    "word": "yoga",
    "pronunciation": "yoh·guh",
    "concise_definition": "n. 瑜伽, 瑜伽练习, 瑜伽哲学",
    "forms": {
      "plural": "yogas"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "An ancient Indian physical, mental, and spiritual practice that combines postures (asanas), breathing techniques (pranayama), and meditation to promote health, flexibility, and inner peace.",
        "explanation_cn": "一种源自印度的身心灵修炼体系，结合体式（asanas）、呼吸控制（pranayama）和冥想，旨在促进健康、柔韧性和内心平静。",
        "example_en": "She practices yoga every morning to reduce stress and improve her posture.",
        "example_cn": "她每天早上练习瑜伽以减轻压力并改善体态。"
      },
      {
        "pos": "noun",
        "explanation_en": "A philosophical system in Hinduism aimed at uniting the individual soul with the universal consciousness through discipline and self-control.",
        "explanation_cn": "印度教中的一种哲学体系，旨在通过自律与自我控制，使个体灵魂与宇宙意识合一。",
        "example_en": "In the Bhagavad Gita, yoga is described as the path of disciplined action and devotion.",
        "example_cn": "在《薄伽梵歌》中，瑜伽被描述为自律行动与虔诚奉献的道路。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "stretching",
        "analysis": "“Stretching”（拉伸）仅指身体肌肉的伸展运动，目的是增加柔韧性或缓解紧张，属于物理层面的活动。而 “yoga” 是一个综合体系，包含体式、呼吸、冥想和哲学，具有身心合一的深层目标，远超单纯的拉伸。"
      },
      {
        "word_to_compare": "meditation",
        "analysis": "“Meditation”（冥想）专注于意识的内观与专注，常以静坐为主，强调心理平静与觉知。虽然瑜伽包含冥想，但瑜伽还包括身体动作和呼吸控制，是一种更全面的身心训练方式，而冥想只是其组成部分之一。"
      },
      {
        "word_to_compare": "pilates",
        "analysis": "“Pilates”（普拉提）是一种以核心力量训练、身体控制和姿势矫正为核心的现代健身体系，强调肌肉的精准激活与稳定性。虽然两者都注重身体控制，但瑜伽更侧重灵性成长、呼吸与意识的统一，而普拉提则更偏向于体能康复与形体塑造。"
      }
    ]
  },
  {
    "word": "yogi",
    "pronunciation": "yoh·gee",
    "concise_definition": "n. 瑜伽修行者, 瑜伽士",
    "forms": {
      "plural": "yogis"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A person who practices yoga, especially one who is deeply devoted to its spiritual and meditative aspects, often seeking enlightenment or inner peace through discipline, breath control, and physical postures.",
        "explanation_cn": "指练习瑜伽的人，尤指那些致力于其精神与冥想层面、通过自律、呼吸控制和体式追求觉悟或内心平静的人。",
        "example_en": "The ancient yogi spent decades in solitude, meditating under the Bodhi tree.",
        "example_cn": "这位古代瑜伽士在菩提树下独居数十年，静心冥想。"
      },
      {
        "pos": "noun",
        "explanation_en": "In Western popular culture, a person associated with Eastern spirituality, often characterized by long hair, robes, and a calm, detached demeanor, sometimes stereotypically portrayed as mystical or otherworldly.",
        "explanation_cn": "在西方流行文化中，指与东方灵性传统相关联的人，常以长发、长袍和宁静超然的举止为特征，有时被刻板地描绘为神秘或超凡脱俗。",
        "example_en": "The movie featured a wise old yogi who gave the protagonist cryptic advice about life.",
        "example_cn": "这部电影中有一位睿智的老瑜伽士，给主角提供了关于人生的玄妙建议。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "meditator",
        "analysis": "“Meditator”（冥想者）泛指任何进行冥想练习的人，不限于瑜伽传统，也不一定包含体式或呼吸控制。而 “yogi” 是一个更全面的术语，涵盖冥想、体式、道德戒律和精神追求，具有更深厚的文化与宗教背景。"
      },
      {
        "word_to_compare": "ascetic",
        "analysis": "“Ascetic”（苦行者）强调通过极端自我克制、禁欲和苦修来追求精神净化，常与物质世界的彻底弃绝相关。而 “yogi” 虽然也可能过简朴生活，但其核心是通过瑜伽体系实现身心统一，而非单纯否定肉体或欲望。"
      },
      {
        "word_to_compare": "guru",
        "analysis": "“Guru”（上师/导师）指传授灵性知识的老师，通常是瑜伽士中的权威人物，但并非所有瑜伽士都是上师。一个 yogi 可以是学生，而 a guru 必然是教导者。两者有师徒关系，但角色不同。"
      }
    ]
  },
  {
    "word": "yogurt",
    "pronunciation": "yoh·gurt",
    "concise_definition": "n. 酸奶, 酸乳",
    "forms": {
      "plural": "yogurts"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A fermented dairy product made by bacterial fermentation of milk, typically characterized by a thick texture and tangy flavor, often consumed as a healthy food or snack.",
        "explanation_cn": "一种通过乳酸菌发酵牛奶制成的发酵乳制品，通常具有浓稠的质地和酸味，常作为健康食品或零食食用。",
        "example_en": "She started her day with a bowl of plain yogurt and fresh berries.",
        "example_cn": "她以一碗原味酸奶和新鲜浆果开始一天。"
      },
      {
        "pos": "noun",
        "explanation_en": "A food product that may be flavored, sweetened, or mixed with fruits, grains, or probiotics to enhance taste or nutritional value.",
        "explanation_cn": "一种可添加风味、甜味或混合水果、谷物和益生菌以提升口感或营养价值的食品产品。",
        "example_en": "The supermarket offers dozens of yogurt varieties, from Greek to coconut-flavored.",
        "example_cn": "超市提供数十种酸奶品种，从希腊酸奶到椰子味酸奶应有尽有。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "kefir",
        "analysis": "“Kefir”（开菲尔）也是一种发酵乳制品，但使用的是酵母和乳酸菌的混合菌群，发酵过程更复杂，口感更稀薄、气泡感更强，且通常含有更多种类的益生菌。而 “yogurt” 主要依赖乳酸菌发酵，质地更浓稠，风味更温和。"
      },
      {
        "word_to_compare": "buttermilk",
        "analysis": "“Buttermilk”（酪乳）传统上是制作黄油后剩余的液体，现代商业产品多为人工发酵的低脂牛奶。它比酸奶更稀、酸味更尖锐，常用于烘焙或饮品。而 “yogurt” 更浓稠，通常直接食用，营养更侧重于蛋白质和益生菌。"
      },
      {
        "word_to_compare": "curd",
        "analysis": "“Curd”（凝乳）是牛奶在酸或凝乳酶作用下凝结形成的固体部分，是奶酪制作的中间产物，质地粗糙、酸味强烈，通常不直接作为食品食用。而 “yogurt” 是经过可控发酵、质地均匀、可直接食用的完整乳制品，口感更顺滑。"
      }
    ]
  },
  {
    "word": "yoke",
    "pronunciation": "yōk",
    "concise_definition": "n. 轭, 束缚; v. 用轭连接, 使受束缚",
    "forms": {
      "plural": "yokes",
      "third_person_singular": "yokes",
      "past_tense": "yoked",
      "past_participle": "yoked",
      "present_participle": "yoking"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A wooden bar or frame used to join a pair of oxen or other draft animals at the neck so they can pull together, typically used in agriculture.",
        "explanation_cn": "一种木制横杆或框架，用于将一对牛或其他挽畜的颈部连接起来，使它们能够协同拉重物，常用于农业。",
        "example_en": "The farmer adjusted the yoke to ensure the oxen pulled evenly.",
        "example_cn": "农夫调整了轭具，以确保两头牛均匀发力。"
      },
      {
        "pos": "noun",
        "explanation_en": "A symbol or means of oppression, control, or subjugation; a burdensome constraint or obligation.",
        "explanation_cn": "指压迫、控制或奴役的象征或手段；一种沉重的束缚或义务。",
        "example_en": "The people rose up to break the yoke of colonial rule.",
        "example_cn": "人民奋起反抗，挣脱了殖民统治的枷锁。"
      },
      {
        "pos": "verb",
        "explanation_en": "To join or connect two people or things, especially in a way that imposes a shared burden or responsibility.",
        "explanation_cn": "将两个人或事物连接起来，尤指以一种强加共同负担或责任的方式。",
        "example_en": "The two companies were yoked together in a joint venture.",
        "example_cn": "两家公司被联合起来开展一项合资项目。"
      },
      {
        "pos": "verb",
        "explanation_en": "To put a yoke on an animal, especially an ox, to prepare it for pulling a plow or cart.",
        "explanation_cn": "给动物（尤指牛）戴上轭具，以准备其拉犁或拉车。",
        "example_en": "The farmer yoked the bulls before dawn to begin plowing the field.",
        "example_cn": "农夫在黎明前给公牛戴上轭具，开始耕田。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "bond",
        "analysis": "“Bond”（纽带/联系）泛指人与人、物与物之间的连接，可以是情感、法律或物理的，通常中性或积极，如“情感纽带”。“Yoke”则带有强烈的压迫性、强制性含义，多用于描述不平等或沉重的束缚，语义更负面。"
      },
      {
        "word_to_compare": "chain",
        "analysis": "“Chain”（链条）是具体的物理束缚工具，常用于字面或隐喻地表示限制自由。“Yoke”虽也可指物理工具，但更强调“共同承担负担”的配对性，且常用于抽象语境（如政治压迫），比“chain”更具象征性和文化意象。"
      },
      {
        "word_to_compare": "link",
        "analysis": "“Link”（连接）是中性词，指两个事物之间的简单连接，无强制或负担含义，如“数据链接”。“Yoke”则隐含权力不对等、责任共担和强制性，语义强度远高于“link”。"
      }
    ]
  },
  {
    "word": "yoko",
    "pronunciation": "yoh·koh",
    "concise_definition": "n. 横向, 横向的; (人名) 横子",
    "forms": {
      "plural": "yokos"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A Japanese term meaning 'horizontal' or 'side-to-side', often used in English to describe a direction or orientation perpendicular to the vertical axis, especially in art, design, or martial arts contexts.",
        "explanation_cn": "日语词汇，意为‘横向的’或‘从左到右的’，常在英语中用于描述与垂直轴垂直的方向，尤其在艺术、设计或武术语境中。",
        "example_en": "In sumo wrestling, the yoko-gake is a side throw technique.",
        "example_cn": "在相扑中，横挂是一种侧摔技术。"
      },
      {
        "pos": "noun",
        "explanation_en": "A given name of Japanese origin, commonly used for women, meaning 'child of the side' or 'horizontal child', often symbolizing balance or harmony.",
        "explanation_cn": "源自日语的女性名字，意为‘侧边的孩子’或‘横向的孩子’，常象征平衡与和谐。",
        "example_en": "Yoko Ono is a renowned Japanese artist and musician.",
        "example_cn": "小野洋子是一位著名的日本艺术家和音乐家。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "horizontal",
        "analysis": "“Horizontal”（水平的）是英语中描述与地面平行方向的通用术语，强调几何或物理上的方位，适用于所有语境。而 “yoko” 是日语借词，多用于特定文化语境（如艺术、武术），带有文化色彩和语用特殊性，不用于日常英语描述方位。"
      },
      {
        "word_to_compare": "lateral",
        "analysis": "“Lateral”（侧面的）是更正式的英语术语，强调从侧面或旁侧的方向，常用于医学、工程或科学领域。它比 “yoko” 更抽象和专业，而 “yoko” 更具文化特异性，常与日本传统实践相关联。"
      },
      {
        "word_to_compare": "name",
        "analysis": "作为人名时，‘Yoko’ 是一个专有名词，具有文化身份意义，不能与普通名词如 ‘horizontal’ 混用。其语义完全依赖于语境：在艺术语境中指小野洋子，在技术语境中指方向，二者不可互换。"
      }
    ]
  },
  {
    "word": "yong",
    "pronunciation": "yong",
    "concise_definition": "n. 勇敢, 勇气; adj. 勇敢的",
    "forms": {
      "plural": "yongs",
      "comparative": "yonger",
      "superlative": "yongest"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "The quality of being brave in the face of danger, difficulty, or fear; the mental or moral strength to confront pain, adversity, or risk without being overwhelmed.",
        "explanation_cn": "在面对危险、困难或恐惧时所表现出的勇敢品质；面对痛苦、逆境或风险时，内心或道德上所展现出的不被压倒的力量。",
        "example_en": "His yong in standing up for justice inspired the entire community.",
        "example_cn": "他为正义挺身而出的勇气激励了整个社区。"
      },
      {
        "pos": "adjective",
        "explanation_en": "Possessing or characterized by courage; willing to face danger or difficulty without hesitation.",
        "explanation_cn": "具有或表现出勇敢的特质；愿意毫不犹豫地面对危险或困难。",
        "example_en": "She is a yong firefighter who rushed into the burning building to save the child.",
        "example_cn": "她是一位勇敢的消防员，冲进着火的大楼救出了孩子。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "brave",
        "analysis": "“Brave” 是最常用的英语形容词，表示“勇敢的”，语义直接且广泛用于日常语境。而 “yong” 是中文词汇，语义更贴近“英勇”或“豪迈”，常带有道德或精神层面的崇高感，多用于书面语或文学表达。"
      },
      {
        "word_to_compare": "courage",
        "analysis": "“Courage” 是 “yong” 作为名词时的英文对应词，但 “courage” 更强调心理上的克服恐惧，常用于抽象语境（如 moral courage）；而 “yong” 在中文中可作名词也可作形容词，使用更灵活，且常与行动、牺牲、气节等概念结合，文化内涵更丰富。"
      },
      {
        "word_to_compare": "valiant",
        "analysis": "“Valiant” 是一个较正式、文学化的英语形容词，意为“英勇的”，常用于描述战斗或重大挑战中的表现，与 “yong” 在文学语境中的使用相似。但 “valiant” 更侧重于外在行为的壮烈，而 “yong” 可包含内在的坚定与气概，不局限于战斗场景。"
      }
    ]
  },
  {
    "word": "yoo",
    "pronunciation": "yoo",
    "concise_definition": "interj. (口语) 嘿, 喂",
    "forms": {
      "variant": [
        "yo",
        "yoo"
      ]
    },
    "definitions": [
      {
        "pos": "interjection",
        "explanation_en": "An informal, casual greeting used to attract someone's attention, often in a friendly or playful manner, especially among young people or in urban slang.",
        "explanation_cn": "一种非正式、随意的打招呼方式，用于吸引某人的注意，通常带有友好或调皮的语气，常见于年轻人或城市俚语中。",
        "example_en": "Yoo, over here! I've been waiting for you!",
        "example_cn": "嘿，这边！我等你很久了！"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "hey",
        "analysis": "“Hey” 是最通用的非正式打招呼用语，适用于各种场合和人群，语气中性或略带随意；而 “yoo” 更具地域性和年轻化特征，常带有更强的街头感或嘻哈文化色彩，语调通常更拉长、更夸张。"
      },
      {
        "word_to_compare": "hi",
        "analysis": "“Hi” 是标准的、礼貌的问候语，适用于大多数社交场合；而 “yoo” 是高度口语化、非正式的表达，通常只用于熟人之间，甚至可能被视为粗鲁或不尊重，若在正式场合使用。"
      },
      {
        "word_to_compare": "yo",
        "analysis": "“Yo” 与 “yoo” 几乎完全同义，是其更常见的拼写形式，两者可互换使用。“Yoo” 通常是 “yo” 的口语化变体，发音更拖长，常见于歌曲、社交媒体或影视剧中以增强语气表现力。"
      }
    ]
  },
  {
    "word": "yoon",
    "pronunciation": "yoon",
    "concise_definition": "n. (专有名词) 尹（韩语姓氏）",
    "forms": {
      "plural": "Yoons"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A common Korean surname, romanized as 'Yoon' or 'Yun', derived from the Chinese character 尹, meaning 'governor' or 'official'. It is one of the most prevalent family names in Korea.",
        "explanation_cn": "一个常见的韩语姓氏，罗马化为 'Yoon' 或 'Yun'，源自汉字 '尹'，意为 '官员' 或 '统治者'。它是韩国最普遍的姓氏之一。",
        "example_en": "Yoon Suk Yeol is the current president of South Korea.",
        "example_cn": "尹锡悦是韩国现任总统。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "Yun",
        "analysis": "“Yun” 是 “Yoon” 的另一种常见罗马化拼写形式，两者在韩语中发音完全相同，区别仅在于拼写习惯。在韩国官方文件和部分国际媒体中，两者常混用，但 “Yoon” 更常用于现代英语语境中。"
      },
      {
        "word_to_compare": "Kim",
        "analysis": "“Kim”（金）是韩国最大姓氏，而 “Yoon” 是第五大姓氏。两者均为源自汉字的韩语姓氏，但 “Kim” 源自 金（金属/财富），而 “Yoon” 源自 尹（官职），在文化含义和历史渊源上有所不同。"
      },
      {
        "word_to_compare": "Lee",
        "analysis": "“Lee”（李）是第二大韩国家族姓氏，与 “Yoon” 同为常见姓氏，但 “Lee” 源自 李（李树/姓氏），使用人口远超 “Yoon”。两者在社会知名度上相近，但 “Lee” 的国际认知度更高，尤其在流行文化中。"
      }
    ]
  },
  {
    "word": "york",
    "pronunciation": "york",
    "concise_definition": "n. 纽约（地名）；约克（地名）；（历史）约克郡；（品牌）约克空调",
    "forms": {
      "plural": "yorks"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A major city in the northeastern United States, officially known as New York City, serving as a global center for finance, culture, media, and diplomacy.",
        "explanation_cn": "美国东北部的主要城市，正式名称为纽约市，是全球金融、文化、媒体和外交的中心。",
        "example_en": "She moved to York to pursue a career in Broadway theater.",
        "example_cn": "她搬到纽约，追求百老汇戏剧事业。"
      },
      {
        "pos": "noun",
        "explanation_en": "A historic city in northern England, known for its medieval architecture, including York Minster and the city walls, and as the former capital of the Kingdom of Northumbria.",
        "explanation_cn": "英格兰北部一座历史悠久的城市，以中世纪建筑闻名，包括约克大教堂和古城墙，曾是诺森布里亚王国的首都。",
        "example_en": "We spent a weekend exploring the cobbled streets of York, England.",
        "example_cn": "我们周末在英格兰约克的鹅卵石街道上漫步游览。"
      },
      {
        "pos": "noun",
        "explanation_en": "A historic county in northern England, now divided into North Yorkshire, West Yorkshire, and South Yorkshire, known for its rolling hills, abbeys, and agricultural heritage.",
        "explanation_cn": "英格兰北部的一个历史郡，现分为北约克郡、西约克郡和南约克郡，以其连绵的丘陵、修道院和农业传统著称。",
        "example_en": "The Yorkshire Dales are a popular destination for hikers and nature lovers.",
        "example_cn": "约克郡戴尔是徒步旅行者和自然爱好者的热门目的地。"
      },
      {
        "pos": "noun",
        "explanation_en": "A brand name for a line of air conditioning and heating systems, originally developed by the York Heating and Ventilating Company.",
        "explanation_cn": "一个空调和供暖系统的品牌名称，最初由约克供暖与通风公司开发。",
        "example_en": "Our office installed a new York HVAC system last winter.",
        "example_cn": "我们办公室去年冬天安装了一套新的约克暖通空调系统。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "New York",
        "analysis": "“New York” 是 “York” 在美国语境下的完整名称，特指纽约市或纽约州，而 “York” 单独使用时可能指英国的约克市或约克郡，需依赖语境区分。两者虽共享词源，但地理和文化含义截然不同。"
      },
      {
        "word_to_compare": "London",
        "analysis": "“London” 是英国的首都，政治与经济中心，而 “York” 是历史悠久的文化古城，规模较小，更侧重于中世纪遗产和旅游价值。两者虽同为英国重要城市，但功能与形象差异显著。"
      },
      {
        "word_to_compare": "Manchester",
        "analysis": "“Manchester” 是英国工业革命的发源地之一，以纺织业和现代体育文化著称，而 “York” 则以宗教建筑、旅游和历史保护闻名。两者代表了英国城市发展的不同路径：工业 vs. 历史传承。"
      }
    ]
  },
  {
    "word": "yorker",
    "pronunciation": "yohr·kər",
    "concise_definition": "n. 纽约人, 纽约市居民; (棒球) 快球, 快速直球",
    "forms": {
      "plural": "yorkers"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A native or resident of New York City, often used to describe someone with the characteristic energy, pace, or attitude associated with life in the city.",
        "explanation_cn": "指纽约市的本地居民或常住者，常用来形容具有与纽约城市生活相关的特点，如节奏快、性格直率或充满活力的人。",
        "example_en": "As a true New Yorker, she never waits for the bus—she runs for it.",
        "example_cn": "作为一个地道的纽约人，她从不等公交车——而是跑着去追。"
      },
      {
        "pos": "noun",
        "explanation_en": "In baseball, a fast, straight pitch thrown with high velocity, typically aimed at the batter’s head or upper body to surprise or intimidate.",
        "explanation_cn": "在棒球运动中，指一种高速、直线飞行的投球，通常瞄准击球手的头部或上半身，以制造突然性或威慑对手。",
        "example_en": "The pitcher threw a devastating yorker that the batter couldn’t react to in time.",
        "example_cn": "投手投出一记致命的快球，击球手根本来不及反应。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "new Yorker",
        "analysis": "“New Yorker” 是正式拼写，特指纽约市居民，常用于新闻、文学或文化语境中，带有身份认同的意味；而 “yorker” 是其非正式缩略形式，口语中使用，有时可能被误解为泛指纽约州居民，需根据语境判断。"
      },
      {
        "word_to_compare": "fastball",
        "analysis": "“Fastball” (快球) 是棒球术语中对高速直球的通用名称，涵盖多种类型（如四缝线快球、二缝线快球）；而 “yorker” 是其俚语或特定语境下的别称，尤其在美式口语中使用，强调其迅猛和攻击性，但非官方术语。"
      },
      {
        "word_to_compare": "resident",
        "analysis": "“Resident” (居民) 是中性、通用的法律或地理术语，适用于任何地方的常住者；而 “yorker” 具有强烈的文化和地域色彩，不仅指居住地，还隐含对纽约生活方式、性格特征的认同，语义更丰富、更具象征性。"
      }
    ]
  },
  {
    "word": "yorkers",
    "pronunciation": "yohr·kərz",
    "concise_definition": "n. 纽约人（复数）",
    "forms": {
      "singular": "yorker"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A person who is from or lives in New York City, often used to denote residents with a distinct cultural identity associated with the city's fast-paced lifestyle, diversity, and urban character.",
        "explanation_cn": "指来自或居住在纽约市的人，常用于指代具有该城市快节奏生活方式、多元文化和都市特质的居民。",
        "example_en": "The subway is crowded with yorkers rushing to work in the morning.",
        "example_cn": "早晨的地铁里挤满了赶着上班的纽约人。"
      },
      {
        "pos": "noun",
        "explanation_en": "Sometimes used informally to refer to people from the state of New York, though more accurately, 'New Yorkers' typically refers to residents of New York City.",
        "explanation_cn": "有时非正式地用于指代来自纽约州的人，但更准确地说，'New Yorkers' 通常特指纽约市的居民。",
        "example_en": "Some upstate residents joke that only city dwellers are called 'yorkers'.",
        "example_cn": "一些纽约州北部居民开玩笑说，只有城里人才被称为‘yorkers’。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "New Yorkers",
        "analysis": "“New Yorkers” 是标准拼写形式，用于正式和非正式语境，指纽约市居民；而 “yorkers” 是其非正式、口语化或简化的复数形式，常见于文学、媒体或日常对话中，但不被推荐用于正式写作。两者语义基本相同，但 “yorkers” 带有更强的俚语色彩。"
      },
      {
        "word_to_compare": "residents",
        "analysis": "“Residents” (居民) 是一个通用词，泛指任何地方的居住者，缺乏地域文化内涵。而 “yorkers” 特指纽约市居民，承载着关于城市性格、生活方式和身份认同的隐含意义，语义更具体、更具文化标识性。"
      },
      {
        "word_to_compare": "natives",
        "analysis": "“Natives” (本地人) 强调出生地或原籍，常隐含“世代居住”的含义；而 “yorkers” 不一定要求出生在纽约，只要长期居住或认同纽约文化即可。因此，“yorkers” 更强调文化归属，而非血缘或出生地。"
      }
    ]
  },
  {
    "word": "yorkshire",
    "pronunciation": "yohrk·sheer",
    "concise_definition": "n. 约克郡（英国地名）；adj. 约克郡的",
    "forms": {
      "proper_noun": true
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A historic county in northern England, known for its rolling hills, moorlands, industrial heritage, and distinctive dialect and culture; it is now administratively divided into several regions including North Yorkshire, West Yorkshire, and South Yorkshire.",
        "explanation_cn": "英国北部的一个历史悠久的郡，以其连绵的丘陵、荒原、工业遗产以及独特的方言和文化而闻名；如今在行政上划分为多个区域，包括北约克郡、西约克郡和南约克郡。",
        "example_en": "She grew up in the heart of Yorkshire, surrounded by sheep farms and ancient stone walls.",
        "example_cn": "她在约克郡腹地长大，四周是绵羊农场和古老的石墙。"
      },
      {
        "pos": "adjective",
        "explanation_en": "Relating to or originating from Yorkshire, especially describing its people, dialect, food, or traditions.",
        "explanation_cn": "与约克郡相关或源自约克郡的，尤指其居民、方言、食物或传统。",
        "example_en": "Yorkshire pudding is a traditional British dish served with roast beef.",
        "example_cn": "约克郡布丁是一种与烤牛肉一起食用的传统英式菜肴。"
      },
      {
        "pos": "noun",
        "explanation_en": "A person from Yorkshire; often used to describe someone with the characteristic traits associated with the region, such as directness, practicality, and dry humor.",
        "explanation_cn": "来自约克郡的人；常用来形容具有该地区典型特质的人，如直率、务实和冷幽默。",
        "example_en": "He’s a true Yorkshireman—no nonsense, hardworking, and always ready with a wry joke.",
        "example_cn": "他是个地道的约克郡人——不啰嗦、勤劳，总能冒出一句冷幽默。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "lancashire",
        "analysis": "“Lancashire”（兰开夏）是英格兰西北部另一个历史郡，与约克郡相邻，同样以工业革命遗产和地方饮食闻名（如兰开夏炖肉）。但约克郡更广为人知的是其荒原风光、约克郡布丁和方言，而兰开夏则以纺织业和更密集的城市化著称。两者虽同属英格兰北部，但文化认同和地理特征有明显差异。"
      },
      {
        "word_to_compare": "northern",
        "analysis": "“Northern”（北方的）是一个泛指英格兰北部地区的形容词，涵盖约克郡、兰开夏、达勒姆等多个区域。而 “Yorkshire” 是一个具体的地理和文化实体，具有独特的历史、语言和身份认同。使用 “northern” 时语义更宽泛，而 “Yorkshire” 则带有强烈的地方自豪感和具体文化内涵。"
      },
      {
        "word_to_compare": "geordie",
        "analysis": "“Geordie” 是指来自英格兰东北部泰恩赛德地区（如纽卡斯尔）的人或其方言，与约克郡人（Yorkshireman）在口音、词汇和文化上截然不同。虽然两者都属于英格兰北部，但约克郡人以直率务实著称，而盖尔迪人则以独特的口音和强烈的社区认同闻名，二者常被当地人视为不同的文化群体。"
      }
    ]
  },
  {
    "word": "yoruba",
    "pronunciation": "yoh·roo·buh",
    "concise_definition": "n. 约鲁巴语, 约鲁巴人",
    "forms": {
      "plural": "Yorubas"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A Niger-Congo language spoken primarily by the Yoruba people of southwestern Nigeria and parts of Benin and Togo, known for its tonal system and rich oral literature.",
        "explanation_cn": "一种主要由尼日利亚西南部以及贝宁和多哥部分地区约鲁巴人使用的尼日尔-刚果语系语言，以其声调系统和丰富的口头文学传统著称。",
        "example_en": "She is learning Yoruba to connect with her ancestral heritage.",
        "example_cn": "她正在学习约鲁巴语，以连接自己的祖先遗产。"
      },
      {
        "pos": "noun",
        "explanation_en": "A member of an ethnic group native to southwestern Nigeria, known for their complex social structures, artistic traditions (especially in sculpture and beadwork), and influential religious practices such as Ifá divination.",
        "explanation_cn": "指原生于尼日利亚西南部的一个民族，以其复杂的社会结构、艺术传统（尤其是雕塑和珠饰工艺）以及具有影响力的宗教实践（如伊法占卜）而闻名。",
        "example_en": "The Yoruba have played a central role in shaping the cultural identity of modern Nigeria.",
        "example_cn": "约鲁巴人在塑造现代尼日利亚的文化认同中发挥了核心作用。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "igbo",
        "analysis": "“Igbo”（伊博语/伊博人）是尼日利亚另一主要民族及其语言，与约鲁巴语同属尼日尔-刚果语系，但语法结构、声调系统和文化传统不同。伊博人以商业传统和基督教传播广泛著称，而约鲁巴人则以君主制、神灵信仰体系（如奥里沙崇拜）和城市文明更为突出。"
      },
      {
        "word_to_compare": "hausa",
        "analysis": "“Hausa”（豪萨语/豪萨人）是西非使用最广的本土语言之一，主要分布在尼日利亚北部和尼日尔，属亚非语系，与约鲁巴语的语言谱系不同。豪萨语使用阿拉伯字母书写传统，而约鲁巴语使用拉丁字母，且豪萨文化更受伊斯兰教深刻影响，与约鲁巴的多神信仰体系形成鲜明对比。"
      },
      {
        "word_to_compare": "tribe",
        "analysis": "“Tribe”（部落）是一个泛指族群的术语，常带有殖民时代的刻板印象，不够精确。而 “Yoruba” 是一个具体、有明确语言、历史和文化认同的民族名称，学术上更推荐使用 “Yoruba people” 或 “Yoruba ethnic group” 以避免贬义或简化。"
      }
    ]
  },
  {
    "word": "yosemite",
    "pronunciation": "yoh·sem·ih·tee",
    "concise_definition": "n. 约塞米蒂（美国国家公园名）",
    "forms": {
      "plural": "Yosemites"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A national park located in the Sierra Nevada mountains of California, renowned for its towering granite cliffs, waterfalls, giant sequoia groves, and diverse ecosystems; it is one of the most iconic and visited parks in the United States.",
        "explanation_cn": "位于加利福尼亚州内华达山脉的一座国家公园，以其高耸的花岗岩悬崖、瀑布、巨型红杉林和多样的生态系统而闻名，是美国最著名且最受欢迎的国家公园之一。",
        "example_en": "We spent a week hiking through Yosemite and were awestruck by Half Dome and El Capitan.",
        "example_cn": "我们在约塞米蒂徒步了一周，被半圆顶和酋长岩的壮丽景色深深震撼。"
      },
      {
        "pos": "noun",
        "explanation_en": "A brand name or cultural reference used to evoke natural beauty, rugged wilderness, or outdoor adventure, often in marketing or product naming (e.g., Yosemite SUV, Yosemite-themed apparel).",
        "explanation_cn": "作为品牌名称或文化符号，用于唤起自然美景、原始荒野或户外冒险的联想，常用于市场营销或产品命名（如约塞米蒂SUV、约塞米蒂主题服饰）。",
        "example_en": "The new camping gear line is called 'Yosemite Outfitters' to emphasize its durability in harsh natural environments.",
        "example_cn": "这款新的露营装备系列命名为‘约塞米蒂装备’，以强调其在严酷自然环境中的耐用性。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "national_park",
        "analysis": "“National park”（国家公园）是一个通用类别，泛指由政府设立并保护的自然区域，而 “Yosemite” 是一个具体的国家公园名称，具有独特的地理、文化和历史意义。使用 “Yosemite” 时，人们联想到的是其标志性景观，而 “national park” 仅表示类型。"
      },
      {
        "word_to_compare": "sequoia",
        "analysis": "“Sequoia”（红杉）指代一种具体的巨型树木或红杉林，是约塞米蒂公园内的一个组成部分；而 “Yosemite” 是包含红杉林、瀑布、悬崖等多种地貌的完整地理区域。前者是元素，后者是整体。"
      },
      {
        "word_to_compare": "yellowstone",
        "analysis": "“Yellowstone”（黄石公园）是美国另一个著名的国家公园，以地热景观（如间歇泉）著称；而 “Yosemite” 以花岗岩地貌和瀑布闻名。两者虽同为美国国家公园，但地质特征、植被类型和游客体验截然不同，常被并列提及以代表美国自然遗产的多样性。"
      }
    ]
  },
  {
    "word": "you",
    "pronunciation": "yoo",
    "concise_definition": "pron. 你, 你们",
    "forms": {
      "subjective": "you",
      "objective": "you",
      "possessive_adjective": "your",
      "possessive_pronoun": "yours",
      "reflexive": "yourself (singular), yourselves (plural)"
    },
    "definitions": [
      {
        "pos": "pronoun",
        "explanation_en": "The second-person pronoun used to refer to the person or people being addressed, whether singular or plural in modern English.",
        "explanation_cn": "第二人称代词，用于指称正在被说话者称呼的个体或群体，在现代英语中单复数形式相同。",
        "example_en": "You are welcome to join us for dinner.",
        "example_cn": "欢迎你来和我们一起吃晚饭。"
      },
      {
        "pos": "pronoun",
        "explanation_en": "Used in a general or impersonal sense to refer to people in general, equivalent to 'one' in formal contexts.",
        "explanation_cn": "用于泛指，表示‘人们’或‘大家’，相当于正式语境中的 'one'。",
        "example_en": "You never know what might happen tomorrow.",
        "example_cn": "你永远不知道明天会发生什么。"
      },
      {
        "pos": "pronoun",
        "explanation_en": "Used in imperative or instructional contexts to address the reader or listener directly, often in manuals, advice, or public announcements.",
        "explanation_cn": "用于命令句或指导性语境中，直接称呼读者或听者，常见于说明书、建议或公共公告中。",
        "example_en": "You must wear a helmet when riding a motorcycle.",
        "example_cn": "骑摩托车时必须戴头盔。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "thou",
        "analysis": "“Thou” 是古英语中第二人称单数主格形式，现已基本退出现代英语，仅见于宗教文本或莎士比亚作品中。它带有强烈的古典或庄重色彩，而 “you” 是现代英语中唯一通用的第二人称代词，涵盖单复数且无正式/非正式之分（在古英语中 “thee/thou” 为非正式， “ye/you” 为正式）。"
      },
      {
        "word_to_compare": "one",
        "analysis": "“One” 是正式语体中用于泛指的第三人称代词，表示‘任何人’或‘人们’，语气更抽象、客观。而 “you” 在泛指用法中更口语化、直接，拉近与听者的距离，常用于日常建议或说明中，更具亲和力。"
      },
      {
        "word_to_compare": "we",
        "analysis": "“We” 是第一人称复数代词，表示说话者与他人共同构成的群体；而 “you” 是第二人称，指向对话的另一方。二者在语义角色上完全对立：一个属于说话者阵营，一个属于听话者阵营。在修辞上，使用 “you” 可增强互动感，而 “we” 则强调归属与共识。"
      }
    ]
  },
  {
    "word": "youll",
    "pronunciation": "yo͞oəl",
    "concise_definition": "int. (口语缩写) 你会, 你将",
    "forms": {
      "full_form": "you will"
    },
    "definitions": [
      {
        "pos": "contraction",
        "explanation_en": "A contraction of 'you will', used to express future intention, prediction, or promise in informal speech and writing.",
        "explanation_cn": "“you will”的缩写形式，用于口语和非正式书面语中，表示未来的意图、预测或承诺。",
        "example_en": "You'll love this movie—it's got everything!",
        "example_cn": "你会喜欢这部电影的——它什么都有！"
      },
      {
        "pos": "contraction",
        "explanation_en": "Often used in commands, suggestions, or reassurances to convey a sense of certainty or inevitability about a future action involving the listener.",
        "explanation_cn": "常用于命令、建议或安慰中，传达对听者未来行为的确定性或必然性。",
        "example_en": "You'll feel better after you rest.",
        "example_cn": "你休息一下就会好起来的。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "you'd",
        "analysis": "“You'd” 是 “you would” 或 “you had” 的缩写，用于虚拟语气、假设或过去完成时，表达非现实或条件性的情境。而 “you'll” 专指将来时，表达真实或预期的未来事件，语气更确定。"
      },
      {
        "word_to_compare": "you're",
        "analysis": "“You're” 是 “you are” 的缩写，用于描述当前状态或特征。而 “you'll” 表示未来动作，两者在时态上完全不同：一个指现在，一个指将来，不可互换。"
      },
      {
        "word_to_compare": "will",
        "analysis": "“Will” 是独立的情态动词，用于正式语境中表达将来时；而 “you'll” 是其与主语 “you” 的口语化缩合形式，语用上更随意、更贴近日常对话。在书面语中，正式文体通常避免使用缩写形式。"
      }
    ]
  },
  {
    "word": "young",
    "pronunciation": "yung",
    "concise_definition": "adj. 年轻的, 幼小的, 未成熟的",
    "forms": {
      "comparative": "younger",
      "superlative": "youngest"
    },
    "definitions": [
      {
        "pos": "adjective",
        "explanation_en": "Having lived for a short time; not old in age, typically referring to a person or animal in the early stages of life.",
        "explanation_cn": "指生命历程较短，年龄尚小，通常用于描述人或动物处于生命早期阶段的状态。",
        "example_en": "She was only 17 when she became a professional dancer — very young for such a demanding career.",
        "example_cn": "她17岁就成为职业舞者——对于如此要求严苛的职业来说，年纪太小了。"
      },
      {
        "pos": "adjective",
        "explanation_en": "Not fully developed or mature; lacking experience, wisdom, or sophistication, often implying immaturity or naivety.",
        "explanation_cn": "指尚未完全发展或成熟，常暗示缺乏经验、智慧或世故，带有不成熟或天真之意。",
        "example_en": "His young ideas about politics were enthusiastic but unrealistic.",
        "example_cn": "他对政治的幼稚想法充满热情但不切实际。"
      },
      {
        "pos": "adjective",
        "explanation_en": "Of recent origin or establishment; not yet old in terms of existence or history.",
        "explanation_cn": "指最近才出现或建立的，就其存在或历史而言尚不长久。",
        "example_en": "The company is still young, but it has already attracted major investors.",
        "example_cn": "这家公司还很年轻，但已经吸引了主要投资者。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "juvenile",
        "analysis": "“Juvenile”（青少年的/幼稚的）更常用于法律、心理学或正式语境中，特指与未成年人相关的特征，有时带有贬义，强调行为或心理上的不成熟。而 “young” 是中性词，仅描述年龄阶段，不隐含评判。"
      },
      {
        "word_to_compare": "adolescent",
        "analysis": "“Adolescent”（青春期的）特指从儿童到成年的过渡阶段（通常12-18岁），是一个生理和心理发展的特定时期。而 “young” 是更宽泛的年龄描述，可涵盖婴儿、儿童、青少年甚至刚成年的人。"
      },
      {
        "word_to_compare": "fresh",
        "analysis": "“Fresh”（崭新的/新手的）常用于描述经验不足的状态，如“fresh graduate”（应届毕业生），强调缺乏实践，但不一定指年龄小。而 “young” 直接关联时间长度，是年龄维度的描述，两者语义重心不同。"
      }
    ]
  },
  {
    "word": "younger",
    "pronunciation": "yung·guhr",
    "concise_definition": "adj. 更年轻的, 较小的",
    "forms": {
      "comparative": "younger",
      "superlative": "youngest"
    },
    "definitions": [
      {
        "pos": "adjective",
        "explanation_en": "Of a person or thing that has existed for a shorter time than another; having a lower age in comparison.",
        "explanation_cn": "指比另一人或事物存在时间更短，年龄更小的，用于比较时表示较低的年龄。",
        "example_en": "My younger sister started college at sixteen.",
        "example_cn": "我妹妹十六岁就上大学了。"
      },
      {
        "pos": "adjective",
        "explanation_en": "Referring to the more recent generation in a family or group, often implying a closer relationship or shared experience with the speaker.",
        "explanation_cn": "指家庭或群体中较新的一代，常暗示与说话者有更紧密的关系或共同经历。",
        "example_en": "The younger members of the team are more comfortable with digital tools.",
        "example_cn": "团队中较年轻的成员对数字工具更得心应手。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "younger",
        "analysis": "“Younger” 是 “young” 的比较级，专用于年龄或时间上的相对比较，不可用于抽象概念（如“更年轻的心态”需用 “more youthful”）。它强调的是与另一个具体对象的年龄差，而非绝对年龄。"
      },
      {
        "word_to_compare": "juvenile",
        "analysis": "“Juvenile” (青少年的/幼稚的) 通常指处于青春期或未成熟的阶段，常带有贬义或法律/学术语境，如 juvenile delinquent（少年犯）。而 “younger” 是中性描述，仅表示年龄较小，无价值判断。"
      },
      {
        "word_to_compare": "newer",
        "analysis": "“Newer” (更新的) 指事物出现或产生的时间更近，适用于物品、技术、版本等，如 a newer model。而 “younger” 仅用于有生命或可类比生命历程的主体（人、动物、世代），不能用于无生命物的“新旧”比较。"
      }
    ]
  },
  {
    "word": "youngest",
    "pronunciation": "yung·gist",
    "concise_definition": "adj. 最年轻的",
    "forms": {
      "base_form": "young",
      "comparative": "younger",
      "superlative": "youngest"
    },
    "definitions": [
      {
        "pos": "adjective",
        "explanation_en": "The superlative form of 'young', indicating the person or thing with the least age in a group or comparison.",
        "explanation_cn": "‘young’ 的最高级形式，表示在一组人或事物中年龄最小的。",
        "example_en": "She is the youngest member of the team, but she contributes the most innovative ideas.",
        "example_cn": "她是团队中最年轻的成员，但却提出了最具创新性的想法。"
      },
      {
        "pos": "adjective",
        "explanation_en": "Used to describe the most recently born or developed child in a family, often carrying emotional or familial connotations.",
        "explanation_cn": "用于描述家庭中出生最晚的孩子，常带有情感或家庭关系的意味。",
        "example_en": "As the youngest in the family, he was always spoiled by his older siblings.",
        "example_cn": "作为家里最小的孩子，他总是被哥哥姐姐们宠着。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "junior",
        "analysis": "“Junior”（年幼的/低级的）通常用于正式场合，指在年龄、资历或等级上较低的人，尤其在家庭或职场中（如 John Jr.）。它强调的是相对地位而非绝对年龄，而 “youngest” 是纯粹基于年龄的客观比较。"
      },
      {
        "word_to_compare": "newest",
        "analysis": "“Newest”（最新的）强调时间上最近出现或被引入的事物，常用于物品、技术或趋势，如 “the newest smartphone”。它关注的是“新近出现”，而非“年龄小”。“Youngest” 专用于有生命体的年龄最小者，不能用于无生命物。"
      },
      {
        "word_to_compare": "least experienced",
        "analysis": "“Least experienced”（经验最少的）描述的是缺乏实践或技能，常与年龄相关但不等同。一个 youngest 的人可能经验丰富，而一个 least experienced 的人可能年纪较大。两者在语义上可能重叠，但逻辑基础不同：前者是年龄，后者是能力。"
      }
    ]
  },
  {
    "word": "youngster",
    "pronunciation": "yung·stur",
    "concise_definition": "n. 年轻人, 小孩, 少年",
    "forms": {
      "plural": "youngsters"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A young person, typically a child or adolescent, often used in an informal or affectionate context to refer to someone significantly younger than the speaker.",
        "explanation_cn": "指一个年轻人，通常是儿童或青少年，常用于非正式或亲切的语境中，指比说话者年幼许多的人。",
        "example_en": "The youngsters were playing soccer in the park after school.",
        "example_cn": "放学后，那些孩子们在公园里踢足球。"
      },
      {
        "pos": "noun",
        "explanation_en": "A person who is young in age or experience, sometimes implying immaturity or lack of sophistication, especially when contrasted with older or more experienced individuals.",
        "explanation_cn": "指在年龄或经验上较年轻的人，有时隐含不成熟或缺乏世故的意味，尤其在与年长或更有经验者对比时使用。",
        "example_en": "He may be a youngster in the industry, but his ideas are already making waves.",
        "example_cn": "他在业内还算年轻，但他的想法已经引起了轰动。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "child",
        "analysis": "“Child” (儿童) 通常指年龄在婴儿期至青春期前的未成年人，有明确的年龄界限（一般12岁以下）。“Youngster” 范围更广，可涵盖青少年甚至二十出头的年轻人，语气更口语化、更宽松。"
      },
      {
        "word_to_compare": "teenager",
        "analysis": "“Teenager” (青少年) 特指13至19岁的人，是年龄的精确划分。“Youngster” 则不局限于这个年龄段，可以指更小的孩子，也可以指二十岁左右的年轻人，语义更宽泛，且常带情感色彩。"
      },
      {
        "word_to_compare": "youth",
        "analysis": "“Youth” (青年) 是一个更正式、更抽象的词，可指青年群体或青年时期，常用于社会、政策或学术语境（如“youth unemployment”）。“Youngster” 更个人化、口语化，强调个体而非群体，且常带有轻微的亲昵或轻视语气。"
      }
    ]
  },
  {
    "word": "youngsters",
    "pronunciation": "yung·sturz",
    "concise_definition": "n. 年轻人, 青少年",
    "forms": {
      "singular": "youngster"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A young person, typically a child or adolescent, often used in informal or affectionate contexts to refer to people who are not yet adults.",
        "explanation_cn": "指一个年轻人，通常是儿童或青少年，常用于非正式或亲切的语境中，指尚未成年的人。",
        "example_en": "The park was full of youngsters playing soccer after school.",
        "example_cn": "放学后，公园里满是踢足球的年轻人。"
      },
      {
        "pos": "noun",
        "explanation_en": "A group of young people regarded collectively, especially in contrast to older generations, often implying energy, idealism, or inexperience.",
        "explanation_cn": "指一群年轻人，常作为与老一辈的对比，暗含活力、理想主义或缺乏经验的意味。",
        "example_en": "Youngsters today are more tech-savvy than their parents ever were.",
        "example_cn": "如今的年轻人比他们的父母更懂科技。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "youth",
        "analysis": "“Youth” (青年时期/年轻人) 是一个更正式、更广泛的术语，既可以指年龄阶段（青春期），也可以指一群年轻人，常用于社会、政治或学术语境。而 “youngsters” 更口语化，带有轻微的亲切或轻描淡写色彩，通常不用于正式写作。"
      },
      {
        "word_to_compare": "teenagers",
        "analysis": "“Teenagers” (青少年) 特指年龄在13至19岁之间的人，范围明确；而 “youngsters” 范围更广，可包括儿童甚至20岁出头的年轻人，没有严格的年龄界限，语义更模糊、更包容。"
      },
      {
        "word_to_compare": "kids",
        "analysis": "“Kids” (孩子们) 是非常口语化、非正式的词，通常指儿童或非常年轻的青少年，有时可能显得不够尊重；而 “youngsters” 虽然也非正式，但语气更中性甚至略带褒义，常用于描述有活力、有潜力的年轻群体。"
      }
    ]
  },
  {
    "word": "your",
    "pronunciation": "yoor",
    "concise_definition": "pron. 你的, 你们的",
    "forms": {
      "possessive_form": "your"
    },
    "definitions": [
      {
        "pos": "pronoun",
        "explanation_en": "A second-person possessive adjective used to indicate ownership or association with the person or people being addressed, whether singular or plural.",
        "explanation_cn": "第二人称所有格形容词，用于表示被称呼的人或人群所拥有或关联的事物，无论是单数还是复数形式。",
        "example_en": "Is this your book?",
        "example_cn": "这是你的书吗？"
      },
      {
        "pos": "pronoun",
        "explanation_en": "Used to express a relationship, connection, or characteristic belonging to the addressee, often in abstract or emotional contexts.",
        "explanation_cn": "用于表达与被称呼者相关的某种关系、联系或特征，常用于抽象或情感语境中。",
        "example_en": "I appreciate your kindness.",
        "example_cn": "我感谢你的善意。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "you're",
        "analysis": "“You're” 是 “you are” 的缩写形式，为动词短语，用于表示状态或特征（如：You're kind）。而 “your” 是所有格形容词，用于修饰名词，表示所属关系（如：your kindness）。两者发音相同但词性和用法完全不同，是常见的拼写错误来源。"
      },
      {
        "word_to_compare": "yours",
        "analysis": "“Yours” 是第二人称的独立所有格代词，可单独使用，不修饰名词（如：This book is yours）。而 “your” 必须后接名词构成所有格短语（如：your book）。前者是代词，后者是形容词。"
      },
      {
        "word_to_compare": "their",
        "analysis": "“Their” 是第三人称复数所有格形容词，表示‘他们的’，而 “your” 专指第二人称（你/你们）的所属关系。两者在人称上形成对比：your 指对话双方，their 指对话之外的其他人。"
      }
    ]
  },
  {
    "word": "youre",
    "pronunciation": "yoor",
    "concise_definition": "v. (口语缩写) 你是",
    "forms": {
      "full_form": "you are"
    },
    "definitions": [
      {
        "pos": "contraction",
        "explanation_en": "A contraction of 'you are', used in informal speech and writing to combine the subject 'you' with the verb 'are' to indicate state, condition, or identity.",
        "explanation_cn": "是 'you are' 的缩写形式，用于非正式口语和书面语中，将主语 'you' 与动词 'are' 合并，表示状态、状况或身份。",
        "example_en": "You're going to love this movie!",
        "example_cn": "你会喜欢这部电影的！"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "your",
        "analysis": "“Your” 是物主代词，表示“你的”，用于修饰名词，如 your book（你的书）。而 “you're” 是 “you are” 的缩写，是一个动词短语，用于描述状态或动作。两者发音相同但词性和用法完全不同，是常见的拼写错误来源。"
      },
      {
        "word_to_compare": "yours",
        "analysis": "“Yours” 是物主代词的独立形式，表示“你的（东西）”，如 This book is yours.（这本书是你的。）它不与动词搭配，也不表示状态。“You're” 则必须与形容词、名词或介词短语搭配构成谓语，如 You're happy.（你很开心。）"
      },
      {
        "word_to_compare": "y'all",
        "analysis": "“Y'all” 是美式南方英语中 “you all” 的缩写，用于复数第二人称，相当于中文的“你们”。“You're” 仅用于单数或复数的 “you”，但始终是 “you are” 的缩写，不表示群体概念。两者在语义和地域使用上均有明显区别。"
      }
    ]
  },
  {
    "word": "yours",
    "pronunciation": "yoorz",
    "concise_definition": "pron. 你的, 你们的",
    "forms": {
      "base_form": "your"
    },
    "definitions": [
      {
        "pos": "pronoun",
        "explanation_en": "The possessive pronoun form of 'you', used to indicate ownership or association without a following noun; it replaces a noun phrase to avoid repetition.",
        "explanation_cn": "‘you’ 的所有格代词形式，用于在不重复名词的情况下表示某物属于‘你’或‘你们’，替代名词短语。",
        "example_en": "This book is yours, not mine.",
        "example_cn": "这本书是你的，不是我的。"
      },
      {
        "pos": "pronoun",
        "explanation_en": "Used in formal or emotional contexts to emphasize personal connection, responsibility, or belonging, often in letters, speeches, or expressions of affection.",
        "explanation_cn": "在正式或情感语境中使用，以强调个人联系、责任或归属感，常用于书信、演讲或表达感情时。",
        "example_en": "With all my love, yours always,",
        "example_cn": "满怀爱意，永远属于你的，"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "your",
        "analysis": "“Your” 是形容词性物主代词，必须后接名词，如 “your book”；而 “yours” 是名词性物主代词，可独立使用，无需名词，如 “The book is yours”。两者语义相同，但语法功能不同。"
      },
      {
        "word_to_compare": "mine",
        "analysis": "“Mine” 是 ‘my’ 的名词性物主代词形式，对应第一人称；而 “yours” 对应第二人称。两者结构相同，但指代对象不同。例如：This pen is mine. / This pen is yours. 语义上形成人称对比。"
      },
      {
        "word_to_compare": "belonging to you",
        "analysis": "“Belonging to you” 是一个描述性短语，语法上冗长且非正式，用于强调归属关系；而 “yours” 是简洁、标准的语法形式，广泛用于口语和书面语。在正式写作中，优先使用 “yours” 以保持语言精炼。"
      }
    ]
  },
  {
    "word": "yourself",
    "pronunciation": "yoor·self",
    "concise_definition": "pron. 你自己, 你们自己",
    "forms": {
      "reflexive_form": "yourself (singular), yourselves (plural)"
    },
    "definitions": [
      {
        "pos": "pronoun",
        "explanation_en": "Used as a reflexive pronoun to refer back to the subject 'you' when the subject and object of the verb are the same person or group.",
        "explanation_cn": "用作反身代词，当句子的主语和宾语为同一人或同一群体时，指代主语 'you'。",
        "example_en": "You should take care of yourself.",
        "example_cn": "你应该照顾好自己。"
      },
      {
        "pos": "pronoun",
        "explanation_en": "Used for emphasis to highlight that the action is done by the person alone, without help or involvement from others.",
        "explanation_cn": "用作强调代词，强调某人独自完成某事，未得到他人帮助或参与。",
        "example_en": "You yourself said this was a bad idea.",
        "example_cn": "你自己说过这是个糟糕的主意。"
      },
      {
        "pos": "pronoun",
        "explanation_en": "Used in idiomatic expressions to indicate personal responsibility, independence, or self-reliance.",
        "explanation_cn": "用于习语表达中，表示个人责任、独立性或自立。",
        "example_en": "If you want it done right, you'll have to do it yourself.",
        "example_cn": "如果你希望事情做好，就得自己动手。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "you",
        "analysis": "“You” 是第二人称主格或宾格代词，用于指代对话中的对方，不包含动作的自我指向性。而 “yourself” 是反身或强调形式，必须与主语 “you” 指代同一对象，用于强调动作的承受者就是施动者本身。"
      },
      {
        "word_to_compare": "yourselves",
        "analysis": "“Yourselves” 是 “yourself” 的复数形式，用于指代多个听话者（你们自己）。两者在语法功能和语义上完全一致，仅在数上不同。使用时需与主语的人称和数量保持一致。"
      },
      {
        "word_to_compare": "oneself",
        "analysis": "“Oneself” 是泛指的反身代词，用于无人称或泛指的语境（如：One should believe in oneself），而 “yourself” 是特指对话中的对方，具有明确的第二人称指向性。前者更正式、抽象，后者更直接、具体。"
      }
    ]
  },
  {
    "word": "yourselves",
    "pronunciation": "yoor·selvz",
    "concise_definition": "pron. 你们自己",
    "forms": {
      "singular_form": "yourself"
    },
    "definitions": [
      {
        "pos": "pronoun",
        "explanation_en": "The reflexive or intensive form of 'you' used when referring to two or more people performing an action on themselves or emphasizing their individual agency.",
        "explanation_cn": "‘you’ 的反身或强调形式，用于指代两个或以上的人对自己实施某种行为，或强调他们各自的主动性。",
        "example_en": "You should all take responsibility for yourselves.",
        "example_cn": "你们每个人都应该为自己的行为负责。"
      },
      {
        "pos": "pronoun",
        "explanation_en": "Used for emphasis to highlight that the action is performed by the group independently, without external help.",
        "explanation_cn": "用于强调该动作由该群体独立完成，无需外界帮助。",
        "example_en": "You yourselves saw what happened — no one else was there.",
        "example_cn": "你们自己亲眼看到了发生的事——没有别人在场。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "yourself",
        "analysis": "“Yourself” 是单数形式，用于指代一个人对自己实施动作，如 “Take care of yourself.”；而 “yourselves” 是复数形式，用于指代两个或以上的人，如 “Take care of yourselves.” 两者在语义结构上完全对应，仅在人称数量上不同。"
      },
      {
        "word_to_compare": "themselves",
        "analysis": "“Themselves” 是第三人称复数的反身代词，用于指代 ‘they’，如 “They hurt themselves.”；而 “yourselves” 是第二人称复数形式，用于指代 ‘you’。两者在语法功能上相同，但所指代的主体不同。"
      },
      {
        "word_to_compare": "you",
        "analysis": "“You” 是主格或宾格代词，用于指代听话者，如 “I gave you the book.”；而 “yourselves” 是反身或强调形式，必须与主语 ‘you’ 一致，且用于强调动作回指自身。不能单独替代 ‘you’，必须在语境中体现自我指向或强调。"
      }
    ]
  },
  {
    "word": "youth",
    "pronunciation": "yooth",
    "concise_definition": "n. 青年, 青春期, 青年时期",
    "forms": {
      "plural": "youths"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "The period of life between childhood and adulthood, typically ranging from the early teens to the late twenties, characterized by physical, emotional, and social development.",
        "explanation_cn": "指从童年到成年之间的生命阶段，通常为十几岁到二十多岁，以身体、情感和社会方面的成长为特征。",
        "example_en": "She spent her youth traveling across Europe and learning different cultures.",
        "example_cn": "她年轻时游历欧洲，学习不同的文化。"
      },
      {
        "pos": "noun",
        "explanation_en": "Young people collectively, especially those in their teens or early twenties; often used to refer to a generation or demographic group.",
        "explanation_cn": "指年轻人的总称，尤指十几岁到二十出头的人群；常用于指代一代人或特定人口群体。",
        "example_en": "The government launched a program to support youth employment.",
        "example_cn": "政府推出了一项支持青年就业的计划。"
      },
      {
        "pos": "noun",
        "explanation_en": "The state or quality of being young; the freshness, energy, and vitality associated with youth.",
        "explanation_cn": "年轻的状态或特质；与青春相关的活力、朝气和生命力。",
        "example_en": "Despite his age, he still has the youth of spirit and a passion for adventure.",
        "example_cn": "尽管年事已高，他仍保持着年轻的精神和对冒险的热情。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "adolescence",
        "analysis": "“Adolescence”（青春期）特指从儿童期到成年期的生理和心理过渡阶段，通常为10至19岁，强调生物学和心理学的发展过程。而 “youth” 范围更广，可涵盖到20多岁，且更侧重社会身份和文化意义上的年轻人，不局限于生理变化。"
      },
      {
        "word_to_compare": "teenager",
        "analysis": "“Teenager”（青少年）专指13至19岁的人，是一个精确的年龄范围术语，常用于日常语境。而 “youth” 是一个更宽泛、更正式的词，可包括20岁出头的人，且常用于政策、社会或学术语境中。"
      },
      {
        "word_to_compare": "childhood",
        "analysis": "“Childhood”（童年）指从出生到青春期开始前的阶段，强调依赖性、学习和游戏。而 “youth” 是童年之后的阶段，标志着独立性、自我认同和社会责任的逐步形成，两者在发展阶段和心理特征上有明显区别。"
      }
    ]
  },
  {
    "word": "youthful",
    "pronunciation": "yooth·fuhl",
    "concise_definition": "adj. 年轻的, 充满青春活力的, 显年轻的",
    "forms": {
      "comparative": "more youthful",
      "superlative": "most youthful"
    },
    "definitions": [
      {
        "pos": "adjective",
        "explanation_en": "Having the qualities associated with youth, such as energy, enthusiasm, vigor, or a fresh, lively appearance; often used to describe someone who looks or acts younger than their actual age.",
        "explanation_cn": "具有与青春相关的特质，如精力充沛、热情洋溢、活力十足或清新活泼的外表；常用于形容某人看起来或行为举止比实际年龄更年轻。",
        "example_en": "Despite her 70s, she maintains a youthful spirit and loves dancing at parties.",
        "example_cn": "尽管她已七十多岁，但仍保持着青春的心态，喜欢在派对上跳舞。"
      },
      {
        "pos": "adjective",
        "explanation_en": "Characteristic of or typical of young people; relating to the early stage of life or development.",
        "explanation_cn": "属于或典型于年轻人的；与生命或发展的早期阶段相关。",
        "example_en": "The novel captures the youthful idealism of students in the 1960s.",
        "example_cn": "这部小说捕捉了20世纪60年代学生们的青春理想主义。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "young",
        "analysis": "“Young” (年轻的) 是一个基础的年龄描述词，指在生命周期中处于早期阶段的人或事物，强调客观年龄。而 “youthful” 更侧重于主观特质，如活力、精神或外貌上的青春感，即使年龄较大也可使用。例如，一个60岁的人可以是 youthful，但不能说是 young。"
      },
      {
        "word_to_compare": "adolescent",
        "analysis": "“Adolescent” (青春期的) 专指处于13至19岁之间生理与心理发育阶段的人，具有明确的年龄范围和发育特征。而 “youthful” 不限于特定年龄段，可泛指任何表现出青春特质的人或事物，适用范围更广。"
      },
      {
        "word_to_compare": "vibrant",
        "analysis": "“Vibrant” (充满活力的) 强调生命力、色彩或能量的强烈表现，可用于人、颜色、声音或氛围。虽然与 “youthful” 在描述活力时有重叠，但 “vibrant” 不必然关联年龄，而 “youthful” 则隐含与青春相关的特质。"
      }
    ]
  },
  {
    "word": "youths",
    "pronunciation": "yooths",
    "concise_definition": "n. 青少年, 青年们 (复数形式)",
    "forms": {
      "singular": "youth"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "Young people, typically in the period between childhood and adulthood, often referring to individuals aged roughly 13 to 25.",
        "explanation_cn": "指处于童年与成年之间的年轻人，通常指年龄大约在13至25岁之间的人。",
        "example_en": "The program aims to engage local youths in community service.",
        "example_cn": "该项目旨在让当地青少年参与社区服务。"
      },
      {
        "pos": "noun",
        "explanation_en": "The state or period of being young; youthfulness, often used in a collective or abstract sense to refer to the qualities associated with youth.",
        "explanation_cn": "年轻的状态或时期；青春，常用于集体或抽象意义上，指与青年相关的特质。",
        "example_en": "He looks back on his youths with nostalgia, remembering the freedom and energy of those years.",
        "example_cn": "他怀着怀旧的心情回顾自己的青春岁月，回忆起那段自由与活力的时光。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "teenagers",
        "analysis": "“Teenagers” (青少年) 专指13至19岁的人，范围较窄且基于年龄划分；而 “youths” 范围更广，可包括20多岁的年轻人，且更常用于社会、政策或文化语境中，带有集体或群体含义。"
      },
      {
        "word_to_compare": "adolescents",
        "analysis": "“Adolescents” (青春期少年) 是一个心理学和医学术语，特指经历生理和心理青春期变化的个体，通常指10至19岁。它强调发展阶段，而 “youths” 更侧重社会身份和文化角色，语义更宽泛。"
      },
      {
        "word_to_compare": "young people",
        "analysis": "“Young people” 是一个更中性、更口语化的表达，泛指所有年轻个体，年龄范围不固定；而 “youths” 更正式，有时带有特定语境下的社会意义（如青年问题、青年政策），在书面语和官方文件中更常见。"
      }
    ]
  },
  {
    "word": "youtube",
    "pronunciation": "yoo·too·be",
    "concise_definition": "n. 优兔（视频分享平台）",
    "forms": {
      "plural": "youtubes"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A global online video-sharing platform owned by Google, where users can upload, view, rate, share, and comment on videos covering a wide range of topics including entertainment, education, news, and personal content.",
        "explanation_cn": "由谷歌公司拥有的全球性在线视频分享平台，用户可在其中上传、观看、评分、分享和评论涵盖娱乐、教育、新闻和个人内容等广泛主题的视频。",
        "example_en": "I learned how to fix my bike by watching a tutorial on YouTube.",
        "example_cn": "我通过在优兔上观看一个教程学会了如何修理我的自行车。"
      },
      {
        "pos": "noun",
        "explanation_en": "A cultural phenomenon and major source of digital content creation, influencing trends, careers, and public opinion through user-generated videos and influencer marketing.",
        "explanation_cn": "一种文化现象和数字内容创作的主要来源，通过用户生成的视频和网红营销影响潮流、职业发展和公众舆论。",
        "example_en": "Many young people now aspire to become YouTubers as a full-time career.",
        "example_cn": "如今，许多年轻人希望将成为YouTuber作为全职职业。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "vimeo",
        "analysis": "“Vimeo” 是一个更注重高质量视频和艺术性创作的平台，主要面向专业创作者和电影制作人，广告较少，社区氛围更封闭。而 “YouTube” 更大众化，内容类型广泛，商业化程度高，用户基数庞大，是主流视频消费的首选平台。"
      },
      {
        "word_to_compare": "tiktok",
        "analysis": "“TikTok” 以短视频（通常15秒至3分钟）和算法驱动的推荐机制为核心，强调娱乐性、节奏感和病毒式传播，主要用户为青少年和年轻群体。而 “YouTube” 支持长视频（数分钟至数小时），内容结构更完整，适合深度学习、教程和系列化内容，受众年龄层更广。"
      },
      {
        "word_to_compare": "netflix",
        "analysis": "“Netflix” 是一个按需订阅的流媒体服务平台，主要提供专业制作的电影、电视剧和纪录片，内容由平台方采购或自制，用户无法上传内容。而 “YouTube” 是用户生成内容（UGC）平台，任何人都可以成为内容发布者，内容生态更加开放和多元化。"
      }
    ]
  },
  {
    "word": "youtuber",
    "pronunciation": "yoo·too·bər",
    "concise_definition": "n. YouTuber, 网络视频博主, YouTube 内容创作者",
    "forms": {
      "plural": "youtubers"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A person who creates and uploads videos to YouTube, often building a personal brand and audience around specific content such as entertainment, education, gaming, or lifestyle.",
        "explanation_cn": "指在 YouTube 上创建并上传视频的人，通常围绕特定内容（如娱乐、教育、游戏或生活方式）建立个人品牌和粉丝群体。",
        "example_en": "She became a famous youtuber by posting daily makeup tutorials that attracted millions of viewers.",
        "example_cn": "她通过发布每日化妆教程吸引了数百万观众，成为知名 YouTuber。"
      },
      {
        "pos": "noun",
        "explanation_en": "An informal term for an online content creator whose primary platform is YouTube, often associated with digital influence, monetization through ads or sponsorships, and direct audience engagement.",
        "explanation_cn": "一种非正式用语，指以 YouTube 为主要平台的网络内容创作者，通常与数字影响力、通过广告或赞助盈利以及与观众直接互动相关联。",
        "example_en": "Many youtubers now earn more than traditional celebrities through brand partnerships and merchandise sales.",
        "example_cn": "许多 YouTuber 通过品牌合作和商品销售获得的收入已超过传统名人。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "influencer",
        "analysis": "“Influencer”（网红/意见领袖）是一个更广泛的术语，泛指在社交媒体（如 Instagram、TikTok、微博等）上拥有大量追随者并能影响其行为的人。而 “youtuber” 特指在 YouTube 平台上活跃的内容创作者，虽然许多 youtuber 也是 influencer，但并非所有 influencer 都是 youtuber。"
      },
      {
        "word_to_compare": "content creator",
        "analysis": "“Content creator”（内容创作者）是涵盖所有数字平台（包括 YouTube、TikTok、Bilibili、Podcast 等）的通用术语，强调创作行为本身。而 “youtuber” 是一个平台限定词，特指 YouTube 上的内容创作者，具有更强的语境指向性。"
      },
      {
        "word_to_compare": "vlogger",
        "analysis": "“Vlogger”（视频博客作者）特指以视频日记或个人生活记录为主要形式的创作者，是 youtuber 的一个子集。并非所有 youtuber 都是 vlogger —— 例如游戏实况主播或动画制作者也是 youtuber，但不属于 vlogger。"
      }
    ]
  },
  {
    "word": "youtubers",
    "pronunciation": "yoo·too·burs",
    "concise_definition": "n. YouTuber（YouTube 内容创作者）",
    "forms": {
      "singular": "youtuber"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A person who creates and uploads videos to YouTube, often building a large audience and earning income through advertising, sponsorships, or fan support.",
        "explanation_cn": "指在 YouTube 上创建并上传视频的人，通常通过广告、赞助或粉丝支持建立大量观众并获得收入。",
        "example_en": "Many youtubers have turned their passion for gaming into full-time careers.",
        "example_cn": "许多 YouTuber 将对游戏的热爱转变为全职职业。"
      },
      {
        "pos": "noun",
        "explanation_en": "A digital influencer whose content on YouTube shapes public opinion, trends, or consumer behavior, often across genres like beauty, education, comedy, or vlogging.",
        "explanation_cn": "指在 YouTube 上发布内容并影响公众意见、潮流或消费行为的数字影响力人物，涵盖美妆、教育、喜剧或生活记录等多种领域。",
        "example_en": "The youtuber who reviews tech gadgets has over 10 million subscribers.",
        "example_cn": "这位评测科技产品的 YouTuber 拥有超过一千万订阅者。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "influencer",
        "analysis": "“Influencer”（网红/意见领袖）是一个更广泛的术语，泛指在社交媒体平台（如 Instagram、TikTok、微博）上拥有影响力的人。而 “youtuber” 特指在 YouTube 平台活跃的内容创作者，其内容形式以长视频为主，制作周期和深度通常更高。"
      },
      {
        "word_to_compare": "content creator",
        "analysis": "“Content creator”（内容创作者）是描述所有在互联网上制作内容的人的通用术语，涵盖博客作者、播客主持人、短视频制作者等。而 “youtuber” 是其子集，专指在 YouTube 上发布内容的人，具有平台特定性。"
      },
      {
        "word_to_compare": "vlogger",
        "analysis": "“Vlogger”（视频博主）特指主要制作“视频日志”（vlog）内容的人，强调个人生活记录。虽然许多 youtubers 是 vloggers，但并非所有 youtubers 都做 vlog——他们也可能制作教程、动画、游戏实况或纪录片。因此，vlogger 是 youtuber 的一种类型，而非同义词。"
      }
    ]
  },
  {
    "word": "youve",
    "pronunciation": "yoov",
    "concise_definition": "缩写形式 = you have",
    "forms": {
      "full_form": "you have"
    },
    "definitions": [
      {
        "pos": "contraction",
        "explanation_en": "A contraction of 'you have', used in spoken and informal written English to indicate possession, completion of an action, or experience.",
        "explanation_cn": "“you have”的缩写形式，用于口语和非正式书面语中，表示拥有、动作完成或经历。",
        "example_en": "You've done an excellent job on this project.",
        "example_cn": "你把这个项目做得非常出色。"
      },
      {
        "pos": "contraction",
        "explanation_en": "Used in perfect tenses to show that an action occurred at an unspecified time before now or has relevance to the present moment.",
        "explanation_cn": "用于完成时态，表示某个动作发生在过去不确定的时间，或与现在有关联。",
        "example_en": "You've already eaten? I didn't know that!",
        "example_cn": "你已经吃过了？我都不知道！"
      },
      {
        "pos": "contraction",
        "explanation_en": "Often used in questions and negative statements to express surprise, accusation, or emphasis.",
        "explanation_cn": "常用于疑问句和否定句中，表达惊讶、指责或强调。",
        "example_en": "You've never been to Paris?",
        "example_cn": "你从来没去过巴黎？"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "you had",
        "analysis": "“You had” 是 “you have” 的过去完成时形式，用于描述在过去某一时间点之前已经完成的动作。而 “you've”（= you have）用于现在完成时，强调动作与现在的关联。两者时态不同，不能互换。"
      },
      {
        "word_to_compare": "you're",
        "analysis": "“You're” 是 “you are” 的缩写，表示状态或特征；而 “you've” 是 “you have” 的缩写，表示动作完成或拥有。两者语法功能完全不同，例如：You're tired（你累了） vs. You've eaten（你吃过了）。"
      },
      {
        "word_to_compare": "yours",
        "analysis": "“Yours” 是物主代词，表示“你的（东西）”，如 “This book is yours.”；而 “you've” 是动词缩写，表示动作或状态，二者词性与用法毫无关联。"
      }
    ]
  },
  {
    "word": "yr",
    "pronunciation": "ir",
    "concise_definition": "n. 年（year 的缩写）",
    "forms": {
      "full_form": "year"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A shortened form of 'year', used primarily in informal writing, dates, or space-limited contexts such as tables, charts, or digital interfaces.",
        "explanation_cn": "‘year’ 的缩写形式，主要用于非正式书写、日期标注或表格、图表、数字界面等空间受限的场合。",
        "example_en": "The project will take 2 yr to complete.",
        "example_cn": "这个项目将需要两年时间完成。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "year",
        "analysis": "“Year” 是标准书面和口语形式，适用于所有正式和非正式语境。而 “yr” 是非正式缩写，仅在特定情境（如日历、表格、广告、技术文档）中使用，不应出现在学术写作或正式信函中。"
      },
      {
        "word_to_compare": "yrs",
        "analysis": "“Yrs” 是 “years” 的复数缩写形式，与 “yr” 为同一缩写体系，但用于复数语境。两者均属非正式用法，且在正式文本中应避免使用。例如：“3 yrs” = “3 years”。"
      },
      {
        "word_to_compare": "annum",
        "analysis": "“Annum” 是拉丁语来源的正式术语，意为“每年”，常用于金融或法律文本中（如 per annum）。它不是 “year” 的缩写，而是同义的正式替代词，语体层级远高于 “yr”。"
      }
    ]
  },
  {
    "word": "yrs",
    "pronunciation": "yers",
    "concise_definition": "n. 年（year 的非正式复数形式）",
    "forms": {
      "full_form": "years"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "An informal plural abbreviation of 'year', used primarily in casual writing, notes, or contexts where brevity is preferred.",
        "explanation_cn": "‘year’ 的非正式复数缩写形式，主要用于口语化写作、笔记或需要简洁表达的场合。",
        "example_en": "I've been working here for 5 yrs.",
        "example_cn": "我在这里工作了五年。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "years",
        "analysis": "“Years” 是 “yrs” 的标准拼写形式，适用于所有正式和非正式语境。而 “yrs” 仅用于非正式场合，如短信、社交媒体、手写便条等，不应出现在学术论文、商务文件或正式出版物中。两者语义完全相同，区别仅在于语体风格。"
      },
      {
        "word_to_compare": "annum",
        "analysis": "“Annum” 是拉丁语借词，意为‘每年’，常用于正式或学术语境中，如 ‘per annum’（每年）。它不是 ‘year’ 的复数形式，也不用于表示具体年数，与 ‘yrs’ 在用法和语体上完全不同。"
      },
      {
        "word_to_compare": "aeon",
        "analysis": "“Aeon” 指极长的时间段，常用于哲学或科学语境，意为‘纪元’或‘永恒’，与 ‘yrs’ 所表示的普通时间单位毫无关联。"
      }
    ]
  },
  {
    "word": "yt",
    "pronunciation": "wī-ti",
    "concise_definition": "n. (非正式) YouTube 的缩写",
    "forms": {
      "full_form": "YouTube"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A widely used informal abbreviation for 'YouTube', the popular online video-sharing platform owned by Google, where users upload, view, and share videos on a vast range of topics.",
        "explanation_cn": "YouTube 的非正式缩写，指由谷歌拥有的流行在线视频分享平台，用户可在该平台上传、观看和分享涵盖广泛主题的视频。",
        "example_en": "I found a great cooking tutorial on yt last night.",
        "example_cn": "昨晚我在 YouTube 上找到了一个很棒的烹饪教程。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "YouTube",
        "analysis": "“YouTube” 是正式全称，用于书面语、正式场合或品牌语境；而 “yt” 是口语或网络语境中的缩略形式，常见于社交媒体、聊天或非正式对话中，具有高度的随意性和地域性。"
      },
      {
        "word_to_compare": "vid",
        "analysis": "“Vid” 是 “video” 的非正式缩写，泛指任何视频内容，不特指平台；而 “yt” 专指 YouTube 平台，具有明确的平台指向性。两者语义范围不同：一个是内容类型，一个是平台名称。"
      },
      {
        "word_to_compare": "tiktok",
        "analysis": "“TikTok” 是另一个短视频平台的名称，与 “yt”（YouTube）在功能上有重叠（如短视频分享），但用户群体、内容风格和算法机制差异显著。两者是竞争性平台，不可互换使用。"
      }
    ]
  },
  {
    "word": "yu",
    "pronunciation": "yoo",
    "concise_definition": "n. (古) 鱼；姓氏",
    "forms": {
      "plural": "yus"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "An archaic or poetic term for 'fish', used in Middle English and occasionally in literary contexts to evoke an old-fashioned or rustic tone.",
        "explanation_cn": "中古英语中的古语或诗意用词，意为‘鱼’，偶尔用于文学语境中以营造古老或质朴的氛围。",
        "example_en": "In the old tale, the yu swam in the silver stream, glinting like a living jewel.",
        "example_cn": "在古老的故事中，鱼在银色的溪流中游动，闪烁如活生生的宝石。"
      },
      {
        "pos": "noun",
        "explanation_en": "A Chinese surname (俞, 余, or 裕 in Chinese characters), commonly found among Chinese communities worldwide.",
        "explanation_cn": "一个中文姓氏（对应汉字如俞、余、裕），在世界各地的华人社区中常见。",
        "example_en": "Professor Yu has published extensively on ancient Chinese philosophy.",
        "example_cn": "俞教授在古代中国哲学领域发表了大量著作。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "fish",
        "analysis": "“Fish” 是现代英语中表示水生脊椎动物的通用词，中性且广泛使用。而 “yu” 是古语或文学性用词，仅在特定语境中使用，带有历史或诗意色彩，现代口语中几乎不用。"
      },
      {
        "word_to_compare": "surname",
        "analysis": "“Surname” 是通用术语，指任何家族姓氏。而 “yu” 作为姓氏时，特指源自中文的姓氏，具有文化专属性，其拼写和发音在英语语境中保留了汉语拼音的特征，不同于西方姓氏的演变方式。"
      }
    ]
  },
  {
    "word": "yuan",
    "pronunciation": "yoo·ahn",
    "concise_definition": "n. 人民币单位, 元",
    "forms": {
      "plural": "yuan"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "The basic unit of currency in the People's Republic of China, subdivided into 10 jiao or 100 fen; commonly used in both spoken and written contexts to denote monetary amounts.",
        "explanation_cn": "中华人民共和国的法定货币单位，可细分为10角或100分；在口语和书面语中广泛用于表示金额。",
        "example_en": "The book costs 25 yuan.",
        "example_cn": "这本书售价25元。"
      },
      {
        "pos": "noun",
        "explanation_en": "Historically, a silver coin used in China before the establishment of the modern yuan; the term has been retained as the name of the current currency despite changes in monetary systems.",
        "explanation_cn": "历史上指中国在现代人民币制度建立前使用的银币；尽管货币体系已变更，该词仍被沿用为现行货币的名称。",
        "example_en": "In the late Qing dynasty, merchants often traded using silver yuan.",
        "example_cn": "清末时期，商人常使用银元进行交易。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "renminbi",
        "analysis": "“Renminbi” (人民币) 是中国官方货币的正式名称，意为“人民的货币”，而 “yuan” 是其基本计价单位。在日常使用中，人们常说 “yuan” 来表示金额，但在正式金融或法律文件中，通常使用 “renminbi”。例如：人民币汇率 vs. 元汇率。"
      },
      {
        "word_to_compare": "dollar",
        "analysis": "“Dollar” 是美国及其他多个国家使用的货币单位，与 “yuan” 在功能上类似，都是日常交易中的基本计价单位。但 “dollar” 有多种变体（如美元、加元、澳元），而 “yuan” 专指中国货币。此外，美元在国际金融体系中作为储备货币的地位远高于人民币。"
      },
      {
        "word_to_compare": "jiao",
        "analysis": "“Jiao” (角) 是 yuan 的十分之一，相当于“毛”或“ dime”在美元体系中的地位。虽然 “jiao” 在理论上是更小的单位，但在现代中国，由于通货膨胀，jiao 已极少在实际交易中使用，而 yuan 是实际流通和标价的主要单位。"
      }
    ]
  },
  {
    "word": "yugoslavia",
    "pronunciation": "yoo·goh·slah·vee·uh",
    "concise_definition": "n. 南斯拉夫（已解体的国家）",
    "forms": {
      "none": "无复数形式（专有名词）"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A former country in southeastern Europe that existed from 1918 to 1992, formed by the union of several South Slavic peoples including Serbs, Croats, Slovenes, Montenegrins, Bosniaks, and Macedonians. It was initially a kingdom and later a socialist federation under Josip Broz Tito.",
        "explanation_cn": "一个存在于1918年至1992年的前南欧国家，由塞尔维亚人、克罗地亚人、斯洛文尼亚人、黑山人、波斯尼亚人和马其顿人等南斯拉夫民族联合组成，最初为王国，后在约瑟普·布罗兹·铁托领导下成为社会主义联邦。",
        "example_en": "Yugoslavia dissolved into several independent nations after the Yugoslav Wars in the 1990s.",
        "example_cn": "在1990年代南斯拉夫战争之后，南斯拉夫解体为多个独立国家。"
      },
      {
        "pos": "noun",
        "explanation_en": "Used historically to refer to the cultural, linguistic, and political sphere of the South Slavic peoples under a single state identity, especially during the 20th century.",
        "explanation_cn": "历史上用于指代20世纪在单一国家认同下南斯拉夫民族的文化、语言和政治领域。",
        "example_en": "The music and literature of Yugoslavia reflected a rich blend of regional traditions.",
        "example_cn": "南斯拉夫的音乐和文学反映了多种地区传统的丰富融合。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "serbia",
        "analysis": "“Serbia”（塞尔维亚）是原南斯拉夫联邦中最大、最具主导地位的共和国，如今是一个独立国家。而 “Yugoslavia” 是包含塞尔维亚在内的多民族联邦国家，两者是部分与整体的关系。塞尔维亚是南斯拉夫的组成部分，而非同义词。"
      },
      {
        "word_to_compare": "balkans",
        "analysis": "“Balkans”（巴尔干）是一个地理和文化区域名称，涵盖包括前南斯拉夫各国在内的多个东南欧国家（如希腊、阿尔巴尼亚、保加利亚等）。而 “Yugoslavia” 是一个具体的政治实体，仅指20世纪的南斯拉夫国家。Balkans 是区域概念，Yugoslavia 是国家概念。"
      },
      {
        "word_to_compare": "croatia",
        "analysis": "“Croatia”（克罗地亚）是原南斯拉夫的一个加盟共和国，1991年宣布独立。它曾是南斯拉夫的一部分，但不能代表整个国家。Yugoslavia 是包含克罗地亚在内的多民族联邦，而 Croatia 是其子集。两者是整体与部分的关系，不可互换。"
      }
    ]
  },
  {
    "word": "yukon",
    "pronunciation": "yoo·kahn",
    "concise_definition": "n. 育空地区（加拿大西北部地区）, 育空河",
    "forms": {
      "plural": "Yukons"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A territory in northwestern Canada, known for its vast wilderness, gold rush history, and indigenous cultures; it is one of Canada's three federal territories.",
        "explanation_cn": "加拿大西北部的一个地区，以其广袤的荒野、淘金热历史和原住民文化而闻名；它是加拿大三个联邦地区之一。",
        "example_en": "The Yukon is home to Mount Logan, the highest peak in Canada.",
        "example_cn": "育空地区是加拿大最高峰——洛根山的所在地。"
      },
      {
        "pos": "noun",
        "explanation_en": "A major river in northwestern North America, flowing from the Yukon Territory in Canada through Alaska to the Bering Sea; it is one of the longest rivers in North America.",
        "explanation_cn": "北美洲西北部的一条主要河流，发源于加拿大的育空地区，流经阿拉斯加，最终注入白令海；它是北美最长的河流之一。",
        "example_en": "The Yukon River supports diverse fish populations, including salmon that migrate thousands of miles.",
        "example_cn": "育空河支持着多样化的鱼类种群，包括洄游数千英里的鲑鱼。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "territory",
        "analysis": "“Territory”（地区）是一个通用词，泛指任何受管辖但未成为正式州或省的区域，如美国的波多黎各或加拿大的努纳武特。而 “Yukon” 是一个专有名词，特指加拿大西北部的这个具体行政区，具有明确的地理、历史和政治身份。"
      },
      {
        "word_to_compare": "river",
        "analysis": "“River”（河流）是通用名词，泛指任何自然水流通道。而 “Yukon” 作为专有名词，特指北美西北部这条具有重要生态和历史意义的河流，常与淘金热、原住民生活和极地探险紧密关联，承载着文化内涵，远超普通河流的含义。"
      },
      {
        "word_to_compare": "alaska",
        "analysis": "“Alaska”（阿拉斯加）是美国的一个州，与育空地区接壤，常在地理或历史语境中与之并提（如育空河贯穿两地）。但 Alaska 是一个州级行政区，拥有更大的人口和经济规模，而 Yukon 是加拿大较小的联邦地区，更偏重自然与原住民文化，两者在行政地位和文化语境上存在显著差异。"
      }
    ]
  },
  {
    "word": "yum",
    "pronunciation": "yoom",
    "concise_definition": "interj. 好吃, 美味, 嘿嘿（表达对食物的喜爱）",
    "forms": {
      "comparative": "",
      "superlative": ""
    },
    "definitions": [
      {
        "pos": "interjection",
        "explanation_en": "An informal exclamation used to express pleasure or delight at the taste of food, often conveying a sense of immediate enjoyment or craving.",
        "explanation_cn": "一种非正式的感叹词，用于表达对食物味道的愉悦或欣喜，常传达一种即时的享受感或食欲。",
        "example_en": "Yum! This chocolate cake is absolutely divine.",
        "example_cn": "好吃！这块巧克力蛋糕简直太棒了。"
      },
      {
        "pos": "interjection",
        "explanation_en": "Used in casual speech or writing to convey enthusiasm about food, often mimicking the sound of someone savoring a bite.",
        "explanation_cn": "在口语或非正式写作中使用，以表达对食物的热情，常模仿人品尝时发出的满足声音。",
        "example_en": "Yum, I could eat this pasta every day!",
        "example_cn": "好吃，我每天都能吃这碗意面！"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "delicious",
        "analysis": "“Delicious”（美味的）是形容词，用于客观描述食物的品质，语气正式且中性，适用于书面语和口语。而 “yum” 是感叹词，更口语化、情绪化，强调即时的感官反应，常用于表达兴奋或孩子气的喜悦。"
      },
      {
        "word_to_compare": "tasty",
        "analysis": "“Tasty”（可口的）是形容词，比 “delicious” 更口语化，但仍用于描述食物本身。而 “yum” 不是描述词，而是直接的情感表达，常独立使用，不修饰名词，更富表现力和拟声性。"
      },
      {
        "word_to_compare": "yummy",
        "analysis": "“Yummy” 是 “yum” 的形容词形式，常用于儿童语言或轻松语境，如 “This is yummy!”。两者语义高度相关，但 “yum” 是感叹词，用于独立喊出；“yummy” 是形容词，需搭配名词使用。前者更短促有力，后者更温和绵长。"
      }
    ]
  },
  {
    "word": "yummy",
    "pronunciation": "yuh·mee",
    "concise_definition": "adj. 美味的, 可口的",
    "forms": {
      "comparative": "yummier",
      "superlative": "yummiest"
    },
    "definitions": [
      {
        "pos": "adjective",
        "explanation_en": "Used informally to describe food that has a very pleasant taste, often evoking delight or strong enjoyment, especially by children or in casual contexts.",
        "explanation_cn": "非正式用语，用于形容食物味道非常可口，常表达出极大的愉悦感，尤其用于儿童或轻松的语境中。",
        "example_en": "This chocolate cake is absolutely yummy!",
        "example_cn": "这个巧克力蛋糕简直太美味了！"
      },
      {
        "pos": "adjective",
        "explanation_en": "Expressing enthusiastic approval of something sensory, especially taste, often with a playful or childlike tone.",
        "explanation_cn": "以一种活泼或孩子气的语气表达对某种感官体验（尤其是味觉）的热烈赞赏。",
        "example_en": "The kids shouted, 'Yummy!' as soon as the pizza arrived.",
        "example_cn": "披萨一端上来，孩子们就大喊：'太好吃了！'"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "delicious",
        "analysis": "“Delicious”（美味的）是更正式、通用的形容词，适用于各种语境，强调食物的高品质和令人愉悦的味道。而 “yummy” 更口语化、情感化，常带有天真或兴奋的语气，多用于日常对话或儿童语言中。"
      },
      {
        "word_to_compare": "tasty",
        "analysis": "“Tasty”（好吃的）比 “yummy” 稍显中性，虽也属口语，但更侧重客观描述味道好，不带强烈情绪色彩。而 “yummy” 更具感染力，常伴随表情或语气表达满足感，情感浓度更高。"
      },
      {
        "word_to_compare": "delectable",
        "analysis": "“Delectable”（极美味的）是文学性或高雅语境中的用词，强调精致、优雅的美味，常用于正式写作或高级餐饮描述。而 “yummy” 完全属于非正式、生活化的表达，两者在语体和使用场合上截然不同。"
      }
    ]
  },
  {
    "word": "yun",
    "pronunciation": "yoon",
    "concise_definition": "n. (中文姓氏) 云",
    "forms": {
      "plural": "Yuns"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A Chinese surname, transliterated as 'Yun' in English, derived from the Chinese character 云 (yún), meaning 'cloud'. It is one of the less common surnames in China and is historically associated with certain regional lineages.",
        "explanation_cn": "一个中文姓氏，英文音译为 'Yun'，源自汉字 '云'（yún），意为 '云'。它是中国较少见的姓氏之一，历史上与某些地域家族有关。",
        "example_en": "Professor Yun is a renowned expert in ancient Chinese philosophy.",
        "example_cn": "云教授是中国古代哲学领域的知名专家。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "Yun",
        "analysis": "作为姓氏，'Yun' 是 '云' 的拼音形式，与英文中其他音译姓氏如 'Wang'（王）、'Li'（李）类似。它不具备英语中普通名词的语义，仅作为专有名词使用。因此，它与英语中表示 'cloud' 的单词 'cloud' 无直接语义关联，仅在汉字来源上共享字形与发音。"
      },
      {
        "word_to_compare": "Yun (as in 'Yunus')",
        "analysis": "在某些文化语境中（如阿拉伯语或土耳其语），'Yun' 可能是 'Yunus'（优努斯）的缩写，指《古兰经》中的先知约拿。但在中文语境中，'Yun' 作为姓氏时与该含义无关，需根据语境区分。"
      }
    ]
  },
  {
    "word": "yung",
    "pronunciation": "yung",
    "concise_definition": "n. （俚语）年轻人，尤指年轻一代；adj. 年轻的（非正式用法）",
    "forms": {
      "plural": "yungs"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A slang term, primarily used in hip-hop and urban culture, to refer to a young person, especially one associated with contemporary youth trends, music, or fashion.",
        "explanation_cn": "一种俚语，主要在嘻哈和都市文化中使用，指年轻人，尤其是与当代青年潮流、音乐或时尚相关的人。",
        "example_en": "He's just a yung kid trying to make it in the rap game.",
        "example_cn": "他只是一个想在说唱圈闯出名堂的年轻小子。"
      },
      {
        "pos": "adjective",
        "explanation_en": "An informal, stylized spelling of 'young' used in pop culture, music lyrics, and social media to convey a sense of modernity, edginess, or cultural relevance.",
        "explanation_cn": "“young”的非正式拼写变体，常用于流行文化、音乐歌词和社交媒体中，以传达现代感、前卫感或文化相关性。",
        "example_en": "That new track is so yung — it’s got all the vibes of the street.",
        "example_cn": "这首新歌太有年轻范儿了——完全充满了街头气息。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "young",
        "analysis": "“Young” 是标准英语中表示年龄小的正式形容词，适用于所有语境；而 “yung” 是其非正式、文化特定的变体，主要用于音乐、社交媒体和亚文化语境中，带有风格化和身份认同的意味，不具备正式语体的使用资格。"
      },
      {
        "word_to_compare": "kid",
        "analysis": "“Kid” 指儿童或青少年，常带有亲昵或轻视的语气，语义范围更窄，通常不用于指代成年早期的青年；而 “yung” 可涵盖从青少年到二十多岁的年轻人，更贴近当代流行文化中对“年轻一代”的泛称，语义更宽泛且更具时代感。"
      },
      {
        "word_to_compare": "teen",
        "analysis": "“Teen” 是 “teenager” 的缩写，特指13至19岁的青少年，年龄范围明确；而 “yung” 没有严格的年龄界限，可泛指任何被视为“年轻”或“有年轻心态”的人，常用于表达一种文化态度而非生理年龄。"
      }
    ]
  },
  {
    "word": "yup",
    "pronunciation": "yup",
    "concise_definition": "int. 是的, 对, 没错 (口语)",
    "forms": {
      "variant": "yep"
    },
    "definitions": [
      {
        "pos": "interjection",
        "explanation_en": "An informal, casual affirmation used to express agreement or confirmation, often in spoken English or casual writing.",
        "explanation_cn": "一种非正式、随意的肯定词，用于表达同意或确认，常见于口语或非正式书面语中。",
        "example_en": "Yup, I'll be there at 7.",
        "example_cn": "是的，我七点到。"
      },
      {
        "pos": "interjection",
        "explanation_en": "A colloquial substitute for 'yes,' often conveying a relaxed, friendly, or dismissive tone depending on context and intonation.",
        "explanation_cn": "作为 'yes' 的口语替代词，根据语境和语调，可传达轻松、友好或敷衍的语气。",
        "example_en": "You're coming to the party? Yup.",
        "example_cn": "你来参加派对吗？嗯，来。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "yes",
        "analysis": "“Yes” 是标准、中性的肯定词，适用于所有语境，包括正式场合。而 “yup” 是高度口语化的变体，仅用于非正式交流，带有轻松或随意的语气，不适合书面语或正式对话。"
      },
      {
        "word_to_compare": "yep",
        "analysis": "“Yep” 与 “yup” 几乎完全同义，都是 “yes” 的口语形式，区别仅在于发音和地域偏好。两者可互换使用，但 “yep” 稍微更常见于美式英语，而 “yup” 常带有更明显的南方或乡村口音色彩。"
      },
      {
        "word_to_compare": "yeah",
        "analysis": "“Yeah” 是最普遍的口语化肯定词，比 “yup” 更常用且语气更随意，有时甚至显得懒散。而 “yup” 听起来更短促、干脆，常用于快速回应，带有轻微的俏皮或地方特色。"
      }
    ]
  },
  {
    "word": "yuri",
    "pronunciation": "yoo·ree",
    "concise_definition": "n. 女同性恋题材（动漫/文学）",
    "forms": {
      "plural": "yuris"
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A genre of Japanese manga, anime, and literature that focuses on romantic or sexual relationships between women, often characterized by emotional intimacy, subtle expressions of affection, and aesthetic storytelling.",
        "explanation_cn": "一种日本漫画、动画和文学体裁，聚焦于女性之间的浪漫或性关系，通常以情感亲密、含蓄的爱意表达和美学叙事为特征。",
        "example_en": "The anime series 'Sailor Moon' contains early yuri elements that influenced later works in the genre.",
        "example_cn": "动画系列《美少女战士》包含了一些早期的百合元素，影响了该类型后来的作品。"
      },
      {
        "pos": "noun",
        "explanation_en": "A cultural label used by fans and creators to describe media that portrays same-sex female relationships, regardless of whether the characters explicitly identify as lesbian.",
        "explanation_cn": "一种由粉丝和创作者使用的文化标签，用于描述描绘女性同性关系的媒体作品，无论角色是否明确自认为女同性恋。",
        "example_en": "Many readers enjoy yuri for its nuanced portrayal of love beyond traditional gender norms.",
        "example_cn": "许多读者喜爱百合题材，因其对超越传统性别规范之爱的细腻刻画。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "shoujo-ai",
        "analysis": "“Shoujo-ai”（少女爱）是“yuri”的早期术语，字面意为“少女之爱”，曾用于描述女性间的情感关系，但因语义模糊和被误用为儿童色情的代称，现已逐渐被“yuri”取代。现代“yuri”更强调成年女性间的情感与性关系，而“shoujo-ai”多用于指代青少年间纯爱或柏拉图式关系。"
      },
      {
        "word_to_compare": "lesbian",
        "analysis": "“Lesbian”（女同性恋）是一个医学与社会学意义上的性取向术语，指真实世界中女性对女性的性吸引与情感依恋。而“yuri”是虚构作品中的类型标签，其内容可能包含真实女同性恋关系，也可能仅是浪漫幻想或审美表达，不一定反映现实身份认同。"
      },
      {
        "word_to_compare": "BL (Boys' Love)",
        "analysis": "“BL”（男孩的爱）是日本流行文化中描绘男性同性关系的类型，与“yuri”在叙事结构、受众群体和美学风格上高度相似，但性别对象不同。两者均起源于女性向创作，常由女性创作者为女性观众制作，但“BL”聚焦男性情感，而“yuri”聚焦女性情感。"
      }
    ]
  },
  {
    "word": "yusuf",
    "pronunciation": "yoo·soof",
    "concise_definition": "n. 尤素福（人名）",
    "forms": {
      "variant_spellings": [
        "Yousef",
        "Youseff",
        "Yusuf",
        "Youssef"
      ]
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A male given name of Arabic origin, derived from the Hebrew name Yosef, meaning 'he will add' or 'God shall add'. It is widely used in Muslim, Christian, and Jewish communities across the Middle East, North Africa, and South Asia.",
        "explanation_cn": "源自阿拉伯语的男性名字，源于希伯来语名字 Yosef，意为‘他将增添’或‘上帝将增添’。广泛用于中东、北非和南亚的穆斯林、基督徒和犹太社群。",
        "example_en": "Yusuf is a talented musician who blends traditional Sufi chants with modern jazz.",
        "example_cn": "尤素福是一位才华横溢的音乐家，他将苏菲派吟唱与现代爵士乐融合在一起。"
      },
      {
        "pos": "noun",
        "explanation_en": "In Islamic tradition, Yusuf refers to the Prophet Joseph, known for his beauty, patience, and wisdom, as recounted in the Quran (Surah Yusuf). He is one of the most celebrated prophets in Islam.",
        "explanation_cn": "在伊斯兰传统中，尤素福指先知约瑟，以其美貌、忍耐与智慧著称，详见《古兰经》第12章（尤素福章）。他是伊斯兰教中最受尊崇的先知之一。",
        "example_en": "The story of Yusuf in the Quran is often cited as a model of moral integrity and divine patience.",
        "example_cn": "《古兰经》中尤素福的故事常被引为道德操守与神圣忍耐的典范。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "Joseph",
        "analysis": "“Joseph” 是希伯来语 Yosef 的英语形式，广泛用于基督教和西方文化中，指圣经中的约瑟。而 “Yusuf” 是其阿拉伯语和伊斯兰文化中的对应形式，拼写和发音因语言和地域而异，但指代的是同一位先知。两者在宗教叙事上高度一致，但文化语境和使用群体不同。"
      },
      {
        "word_to_compare": "Youssef",
        "analysis": "“Youssef” 是 “Yusuf” 的另一种常见拼写变体，主要在法语影响地区（如北非）使用。发音略有不同，但语义和文化背景完全相同。两者是同一名字的方言或拼写差异，非不同词义。"
      },
      {
        "word_to_compare": "Joshua",
        "analysis": "“Joshua” 是另一个希伯来语名字 Yehoshua 的英语形式，意为‘耶和华是救主’，与 Yusuf（意为‘他将增添’）在词源、含义和宗教角色上均无关联。尽管两者都是圣经人物，但不应混淆。"
      }
    ]
  },
  {
    "word": "yves",
    "pronunciation": "eev",
    "concise_definition": "n. （人名）伊夫（法语名，常用于男性）",
    "forms": {
      "variant_spelling": [
        "Yves",
        "Ives"
      ]
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A French masculine given name, derived from the Germanic name 'Ivo', meaning 'yew' (the tree), often associated with strength and resilience. It is notably borne by the French fashion designer Yves Saint Laurent.",
        "explanation_cn": "法语男性名，源自日耳曼语名 'Ivo'，意为‘紫杉树’，常象征力量与韧性。该名字最著名的是法国时尚设计师伊夫·圣罗兰（Yves Saint Laurent）。",
        "example_en": "Yves Saint Laurent revolutionized women's fashion with his tuxedo suit for women in the 1960s.",
        "example_cn": "伊夫·圣罗兰在20世纪60年代以女性燕尾服颠覆了女性时尚。"
      },
      {
        "pos": "noun",
        "explanation_en": "A surname or family name in French-speaking regions, sometimes used as a proper noun in brand names or artistic pseudonyms.",
        "explanation_cn": "在法语地区用作姓氏，有时也用于品牌名称或艺术化名。",
        "example_en": "The art gallery featured a collection titled 'Yves: Echoes of the Modern'",
        "example_cn": "画廊展出了一组名为《伊夫：现代的回响》的作品集。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "Ives",
        "analysis": "“Ives” 是 “Yves” 的英语化拼写变体，常见于英语国家，如美国作曲家查尔斯·艾夫斯（Charles Ives）。两者同源，但 “Yves” 更保留法语发音和文化语境，而 “Ives” 更偏向英语拼读习惯。"
      },
      {
        "word_to_compare": "Yves Saint Laurent",
        "analysis": "“Yves Saint Laurent” 是一个完整人名，特指著名设计师，不能单独用作普通名词。而 “Yves” 作为独立词时，仅指名字本身，不自动关联品牌或人物，需语境支持。"
      },
      {
        "word_to_compare": "Eve",
        "analysis": "“Eve” 是女性名，源自希伯来语，意为“生命”，与 “Yves”（源自紫杉树）在语义和性别上完全不同。尽管发音相似，但两者无词源或文化关联。"
      }
    ]
  },
  {
    "word": "yvonne",
    "pronunciation": "ee·vawn",
    "concise_definition": "n. 女名，伊冯娜（法语名Yvonne的英语形式）",
    "forms": {
      "variant_spellings": [
        "Yvonne",
        "Yvonn",
        "Ivonne"
      ]
    },
    "definitions": [
      {
        "pos": "noun",
        "explanation_en": "A feminine given name of French origin, derived from the Germanic name 'Ivo', meaning 'yew' or 'archer'. It has been popular in English-speaking countries since the early 20th century.",
        "explanation_cn": "源自法语的女性名字，由日耳曼语名字 'Ivo' 演变而来，意为‘紫杉树’或‘弓箭手’。自20世纪初以来在英语国家广为流行。",
        "example_en": "Yvonne was a renowned actress in French cinema during the 1950s.",
        "example_cn": "伊冯娜是20世纪50年代法国电影界著名的女演员。"
      },
      {
        "pos": "noun",
        "explanation_en": "Used as a proper noun to refer to specific individuals, often carrying cultural or historical associations, such as Yvonne Craig (actress) or Yvonne De Carlo (Hollywood star).",
        "explanation_cn": "用作专有名词，指代特定人物，常带有文化或历史关联，例如女演员伊冯娜·克雷格或好莱坞明星伊冯娜·德卡洛。",
        "example_en": "Yvonne De Carlo became famous for her role as Lily Munster in 'The Munsters'.",
        "example_cn": "伊冯娜·德卡洛因在《芒斯特一家》中饰演莉莉·芒斯特而闻名。"
      }
    ],
    "comparison": [
      {
        "word_to_compare": "Yvonne",
        "analysis": "‘Yvonne’ 是一个专有名词，仅用于人名，不具备普通名词的语义功能。它与其他词汇（如‘example’或‘develop’）在词性和用法上完全不同，无法构成语义上的近义词或对比关系。其唯一相关性在于文化、历史或语言学层面的命名传统。"
      }
    ]
  }
]